Repository: DamienCassou/nitrokey-documentation
Catalog: locales/*/LC_MESSAGES/hsm.po
Languages: it

source: TLS Setup with Apache2
it: Impostazione TLS con Apache2

source: The very same concept as descriped here can be used for many applications using openssl as crypto-backend. The concept mostly boils down to: replace (secret) key-file with PKCS#11 URL referencing a key on a security token (Nitrokey)
it: Lo stesso concetto descritto qui può essere usato per molte applicazioni che usano openssl come crypto-backend. Il concetto si riduce principalmente a: sostituire il file chiave (segreto) con un URL PKCS#11 che fa riferimento a una chiave su un token di sicurezza (Nitrokey)

source: Preparation
it: Preparazione

source: ensure that the `apache2` version is at least 2.4.42 for proper ``mod_ssl`` support
it: assicurarsi che la versione di `apache2` sia almeno 2.4.42 per un corretto ``mod_ssl`` supporto

source: activate ``mod_ssl`` using ``a2enmod ssl``, if not already done
it: attivare ``mod_ssl`` usando ``a2enmod ssl``, se non è già stato fatto

source: additionally ``openssl`` is needed and ``libengine-pkcs11-openssl`` see :doc:`PKCS#11 URL<pkcs11-url>`
it: inoltre ``openssl`` è necessario e ``libengine-pkcs11-openssl`` vedi :doc:`PKCS#11 URL<pkcs11-url>`

source: Configure Apache2 to Use a Security Key
it: Configurare Apache2 per utilizzare una chiave di sicurezza

source: Basically the only thing to do is replace ``SSLCertificateFile`` with the proper PKCS#11 URL and delete any other references to keys or certificates. E.g., ``SSLCertificateKeyFile`` is not needed anymore.
it: Fondamentalmente l'unica cosa da fare è sostituire ``SSLCertificateFile`` con il corretto URL PKCS#11 ed eliminare qualsiasi altro riferimento a chiavi o certificati. Per esempio, ``SSLCertificateKeyFile`` non è più necessario.

source: An example directive might look like this:
it: Una direttiva di esempio potrebbe essere come questa:

source: The proper PKCS#11 URL can be extracted as documented in :doc:`PKCS#11 URL Generation<pkcs11-url>`
it: Il corretto URL PKCS#11 può essere estratto come documentato in :doc:`PKCS#11 URL Generation<pkcs11-url>`

source: Be sure to place the directive inside a `VirtualHost` configuration.
it: Assicuratevi di mettere la direttiva all'interno di una configurazione `VirtualHost`.

source: Provide PIN During Apache2 Startup
it: Fornire il PIN durante l'avvio di Apache2

source: Using the previously described method Apache2 will ask on every startup for the User-PIN, thus basically declining batch startup. Apache2 provides another directive to provide the PIN during startup.
it: Usando il metodo precedentemente descritto Apache2 chiederà ad ogni avvio il PIN utente, quindi in pratica rifiutando l'avvio in batch. Apache2 fornisce un'altra direttiva per fornire il PIN durante l'avvio.

source: Apache2 expects an executable after ``|``, which will be executed during startup and it's output (trailing newline is expected) will be used as PIN. Obviously arbitrary complex PIN retrieval methods can be implemented using this approach. Although here a trivial example has been chosen to just ``echo`` the PIN during startup.
it: Apache2 si aspetta un eseguibile dopo ``|``, che sarà eseguito durante l'avvio e il suo output (la newline finale è attesa) sarà usato come PIN. Ovviamente possono essere implementati metodi arbitrari e complessi per il recupero del PIN usando questo approccio. Anche se qui è stato scelto un esempio banale per ottenere solo ``echo`` il PIN durante l'avvio.

source: Further ``SSLPassPhraseDialog`` is a global directive, thus has to be placed in the global configuration scope in Apache2.
it: Inoltre ``SSLPassPhraseDialog`` è una direttiva globale, quindi deve essere messa nello scope di configurazione globale in Apache2.

source: This shown example is not a secure mechanism to pass your PIN, as it will be written in plain-text inside your configuration
it: Questo esempio mostrato non è un meccanismo sicuro per passare il tuo PIN, poiché sarà scritto in chiaro all'interno della tua configurazione

source: See the `Apache2 mod_ssl documentation`_ for more details on this feature.
it: Vedere la `documentazione di Apache2 mod_ssl`_ per maggiori dettagli su questa caratteristica.

source: Complete Apache2 Config Example
it: Esempio di configurazione completa di Apache2

source: A complete Apache2 (``VirtualHost``) config snippet might look like this:
it: Un frammento completo di configurazione di Apache2 (``VirtualHost``) potrebbe essere come questo:

source: Creating a Certificate Authority
it: Creare un'autorità di certificazione

source: This article shows you how to setup your own private certificate authority backed by a Nitrokey HSM. This certificate authority has no automation and does not really scale. Other open source projects can be referenced for automation and scalability.
it: Questo articolo vi mostra come configurare la vostra autorità di certificazione privata supportata da un HSM Nitrokey. Questa autorità di certificazione non ha automazione e non è realmente scalabile. Si può fare riferimento ad altri progetti open source per l'automazione e la scalabilità.

source: Choose Cryptographic Algorithms
it: Scegliere gli algoritmi crittografici

source: I’m going to assume that you’re as paranoid as I am, so I will be using the following command for generating private keys:
it: Presumo che siate paranoici come me, quindi userò il seguente comando per generare le chiavi private:

source: But, if you’re less paranoid that I am, you can safely choose the following options:
it: Ma, se siete meno paranoici di me, potete tranquillamente scegliere le seguenti opzioni:

source: Likewise, I will be using the sha512 algorithm throughout this article, but sha256 can safely be used.
it: Allo stesso modo, userò l'algoritmo sha512 in tutto questo articolo, ma sha256 può essere tranquillamente usato.

source: Preparing to Start
it: Prepararsi a iniziare

source: To start with, you need to pick a directory to store your CA.
it: Per cominciare, è necessario scegliere una directory per memorizzare il vostro CA.

source: Install the necessary tools:
it: Installare gli strumenti necessari:

source: For Windows download the official `OpenSC releases <https://github.com/OpenSC/OpenSC/releases>`_ and make sure you install `p11tool as described <https://github.com/thales-e-security/p11tool>`_. Using the PowerShell most commands should be identical as long as both tools and their binaries are within your ``PATH``.
it: Per Windows scaricate le versioni ufficiali ` di OpenSC <https://github.com/OpenSC/OpenSC/releases>`_ e assicuratevi di installare `p11tool come descritto <https://github.com/thales-e-security/p11tool>`_. Usando la PowerShell la maggior parte dei comandi dovrebbe essere identica, purché entrambi gli strumenti e i loro binari siano all'interno del vostro ``PATH``.

source: Creating the Root Certificate Authority
it: Creare l'autorità di certificazione radice

source: We start by generating the private key for the certificate authority directly on the Nitrokey HSM. This allows us to use the private key in the future, but not access it.
it: Iniziamo generando la chiave privata per l'autorità di certificazione direttamente sull'HSM Nitrokey. Questo ci permette di utilizzare la chiave privata in futuro, ma non di accedervi.

source: Note the ID number (e0161cc8b6f5d66ac6835ecdecb623fc0506a675), we’ll need it later.
it: Nota il numero ID (e0161cc8b6f5d66ac6835ecdecb623fc0506a675), ci servirà più tardi.

source: If you need the ID in the future, you can list the keys on the Nitrokey HSM:
it: Se hai bisogno dell'ID in futuro, puoi elencare le chiavi sul Nitrokey HSM:

source: We need to create a config file to generate a self-signed public certificate.
it: Dobbiamo creare un file di configurazione per generare un certificato pubblico autofirmato.

source: Fill out the request information in <angle brackets> with information for your CA.
it: Compilate le informazioni di richiesta in <parentesi angolari> con le informazioni per il vostro CA.

source: Generate the self-signed public certificate from the private key. Use the private key id value from earlier.
it: Generare il certificato pubblico autofirmato dalla chiave privata. Usa il valore id della chiave privata di prima.

source: Verify that the root certificate was generated correctly. Verify that Signature-Algorithm matches above and below. Verify that Issuer and Subject match, all root certificates are self signed. Verify that Key Usage matches what was in the v3_ca information in our config file.
it: Verificare che il certificato di root sia stato generato correttamente. Verificare che Signature-Algorithm corrisponda sopra e sotto. Verificate che Issuer e Subject corrispondano, tutti i certificati di root sono autofirmati. Verificate che Key Usage corrisponda a quello che c'era nelle informazioni v3_ca nel nostro file di configurazione.

source: Creating the Intermediate Certificate Authority
it: Creare l'autorità di certificazione intermedia

source: We continue by generating the private key for the intermediate certificate authority directly on the Nitrokey HSM. This allows us to use the private key in the future, but not access it.
it: Continuiamo generando la chiave privata per l'autorità di certificazione intermedia direttamente sull'HSM Nitrokey. Questo ci permette di utilizzare la chiave privata in futuro, ma non di accedervi.

source: Note the ID number (bcb48fe9b566ae61891aabbfde6a23d4ff3ab639), we’ll need it later.
it: Nota il numero ID (bcb48fe9b566ae61891aabbfde6a23d4ff3ab639), ci servirà più tardi.

source: Generate the certificate signing request for the intermediate CA from the intermediate CA’s private key. Use the private key ID value from earlier.
it: Genera la richiesta di firma del certificato per la CA intermedia dalla chiave privata della CA intermedia. Usate il valore ID della chiave privata di prima.

source: Verify that the CSR was created correctly. Verify that your Subject is correct. Verify that your Public Key and Signature Algorithm are correct.
it: Verificare che la CSR sia stata creata correttamente. Verificare che l'oggetto sia corretto. Verificare che la chiave pubblica e l'algoritmo di firma siano corretti.

source: We need to find out the fully qualified PKCS#11 URI for your private key:
it: Abbiamo bisogno di scoprire l'URI PKCS#11 pienamente qualificato per la vostra chiave privata:

source: In this instance, the fully qualified PKCS#11 URI is:
it: In questo caso, l'URI PKCS#11 completamente qualificato è:

source: Now, we need to create a config file to use the private key of the root certificate to sign the csr of the intermediate certificate.
it: Ora, abbiamo bisogno di creare un file di configurazione per utilizzare la chiave privata del certificato root per firmare il csr del certificato intermedio.

source: Then sign the intermediate certificate with the root certificate.
it: Poi firmate il certificato intermedio con il certificato di root.

source: Verify that the root certificate was generated correctly. Verify that the Issuer and Subject are different, and correct. Verify that the Key Usage matches the config file. Verify that the signature algorithm are correct above and below.
it: Verificare che il certificato di root sia stato generato correttamente. Verificare che Issuer e Subject siano diversi e corretti. Verificare che il Key Usage corrisponda al file di configurazione. Verificare che l'algoritmo di firma sia corretto sopra e sotto.

source: Verify that the intermediate certificate verifies against the root certificate.
it: Verificate che il certificato intermedio si verifichi rispetto al certificato radice.

source: Create a certificate chain file:
it: Creare un file di catena del certificato:

source: You now have a certificate authority backed by an HSM.
it: Ora avete un'autorità di certificazione supportata da un HSM.

source: Sign a Server Certificate
it: Firmare un certificato del server

source: Now that you have a certificate authority, you’d probably like to know how to use it.
it: Ora che avete un'autorità di certificazione, probabilmente vorrete sapere come usarla.

source: Create a CSR in the normal method for your application. Proper creation of your certificate, including SAN, for your particular application is outside the scope of this document.
it: Create una CSR nel metodo normale per la vostra applicazione. La corretta creazione del vostro certificato, compresa la SAN, per la vostra particolare applicazione è al di fuori dello scopo di questo documento.

source: Create a config file to use the private key of the intermediate certificate to sign the CSRs of your servers.
it: Create un file di configurazione per utilizzare la chiave privata del certificato intermedio per firmare le CSR dei vostri server.

source: Then run openssl to sign the server’s CSR.
it: Poi eseguite openssl per firmare la CSR del server.

source: References
it: Riferimenti

source: I used the following resources to help in compiling this document.
it: Ho usato le seguenti risorse per aiutare nella compilazione di questo documento.

source: `How to initialize your Nitrokey HSM <https://github.com/OpenSC/OpenSC/wiki/SmartCardHSM#initialize-the-device>`_
it: ` Come inizializzare il vostro Nitrokey HSM <https://github.com/OpenSC/OpenSC/wiki/SmartCardHSM#initialize-the-device>`_

source: `How to create a root and intermediate CA <https://jamielinux.com/docs/openssl-certificate-authority/create-the-root-pair.html>`_
it: `Come creare una CA radice e intermedia <https://jamielinux.com/docs/openssl-certificate-authority/create-the-root-pair.html>`_

source: `How to ensure the serial numbers of your intermediate CA and server certs are up to spec <https://www.phildev.net/ssl/creating_ca.html>`_
it: `Come assicurarsi che i numeri di serie della CA intermedia e delle certificazioni del server siano conformi alle specifiche <https://www.phildev.net/ssl/creating_ca.html>`_

source: `How to generate ECC private keys <https://dev.to/benjaminblack/obtaining-an-elliptic-curve-dsa-certificate-with-lets-encrypt-51bc>`_
it: `Come generare chiavi private ECC <https://dev.to/benjaminblack/obtaining-an-elliptic-curve-dsa-certificate-with-lets-encrypt-51bc>`_

source: `How to find the PCKS11 URI from your HSM <https://www.infradead.org/openconnect/pkcs11.html>`_
it: `Come trovare l'URI PCKS11 dal vostro HSM <https://www.infradead.org/openconnect/pkcs11.html>`_

source: `Troubleshooting (forum) <https://support.nitrokey.com/t/pki-ca-nitrokey-hsm-does-not-support-signing/2598/14>`_
it: ` Risoluzione dei problemi (forum) <https://support.nitrokey.com/t/pki-ca-nitrokey-hsm-does-not-support-signing/2598/14>`_

source: This document was originally `written by lyntux <https://gist.github.com/lyntux/f02c6c3414ce48bc8ea8ab6dcdba1623>`_
it: Questo documento è stato originariamente ` scritto da lyntux <https://gist.github.com/lyntux/f02c6c3414ce48bc8ea8ab6dcdba1623>`_

source: **Q:** Which Operating Systems are supported?
it: **Q:** Quali sistemi operativi sono supportati?

source: Windows, Linux, and Mac OS X.
it: Windows, Linux e Mac OS X.

source: **Q:** What can I use the Nitrokey for?
it: **Q:** Per cosa posso usare la Nitrokey?

source: See the `frontpage`_ for an overview of supported use cases.
it: Vedere la `frontpage`_ per una panoramica dei casi d'uso supportati.

source: **Q:** What is the maximum length of the PIN?
it: **Q:** Qual è la lunghezza massima del PIN?

source: Nitrokey uses PINs instead of passwords. The main difference is that the hardware limits the amount of tries to three while a limit doesn't exist for passwords. Because of this, a short PIN is still secure and there is not need to choose a long and complex PIN.
it: Nitrokey usa i PIN invece delle password. La differenza principale è che l'hardware limita la quantità di tentativi a tre mentre un limite non esiste per le password. Per questo motivo, un PIN breve è ancora sicuro e non è necessario scegliere un PIN lungo e complesso.

source: Nitrokey PINs can be up to 16 digits long and can consist of numbers, characters and special characters. Note: When using GnuPG or OpenSC, 32 character long PINs can be used but aren't supported by Nitrokey App.
it: I PIN di Nitrokey possono essere lunghi fino a 16 cifre e possono essere composti da numeri, caratteri e caratteri speciali. Nota: Quando si usa GnuPG o OpenSC, si possono usare PIN lunghi 32 caratteri ma non sono supportati da Nitrokey App.

source: **Q:** What is the User PIN for?
it: **Q:** A cosa serve il PIN utente?

source: The PIN is at least 6-digits long and is used to get access to the contect of the Nitrokey. This is the PIN you will use a lot in every day use
it: Il PIN è lungo almeno 6 cifre e serve per accedere al contenuto della Nitrokey. Questo è il PIN che userete molto nell'uso quotidiano

source: The PIN can have up to 16 digits and other characters (e.g. alphabetic and special characters). But as the PIN is blocked as soon three wrong PIN attempts were done, it is sufficiently secure to only have a 6 digits PIN.
it: Il PIN può avere fino a 16 cifre e altri caratteri (per esempio alfabetici e speciali). Ma siccome il PIN viene bloccato non appena vengono fatti tre tentativi di PIN sbagliati, è sufficientemente sicuro avere solo un PIN di 6 cifre.

source: **Q:** What is the SO PIN for?
it: **Q:** A cosa serve il PIN SO?

source: The SO PIN is used in the Nitrokey HSM only and is something like a "master" PIN with special properties. Please read this instructions carefully to understand the SO PIN of the Nitrokey HSM.
it: Il SO PIN è usato solo nel Nitrokey HSM ed è qualcosa come un "master" PIN con proprietà speciali. Leggi attentamente queste istruzioni per capire il SO PIN di Nitrokey HSM.

source: The SO PIN has to be exactly 16 digits long.
it: Il PIN SO deve essere esattamente di 16 cifre.

source: **Q:** How many data objects (DF, EF) can be stored?
it: **Q:** Quanti oggetti di dati (DF, EF) possono essere memorizzati?

source: 76 KB EEPROM total, max. 150 x ECC-521 keys, max. 300 x ECC/AES-256 keys, max. 19 x RSA-4096 keys, max. 38 x RSA-2048 keys
it: 76 KB EEPROM totale, max. 150 x chiavi ECC-521, max. 300 x chiavi ECC/AES-256, max. 19 chiavi RSA-4096, max. 38 x RSA-2048 chiavi

source: **Q:** How many keys can I store?
it: **Q:** Quante chiavi posso memorizzare?

source: Nitrokey HSM can store 20 RSA-2048 and 31 ECC-256 key pairs.
it: Nitrokey HSM può memorizzare 20 coppie di chiavi RSA-2048 e 31 ECC-256.

source: **Q:** How fast is encryption and signing?
it: **Q:** Quanto è veloce la crittografia e la firma?

source: Key generation on-card: RSA 2048: 2 per minute
it: Generazione di chiavi sulla scheda: RSA 2048: 2 al minuto

source: Key generation on-card: ECC 256: 10 per minute.
it: Generazione della chiave sulla scheda: ECC 256: 10 al minuto.

source: Signature creation with off-card hash: RSA 2048; 100 per minute
it: Creazione della firma con hash fuori scheda: RSA 2048; 100 al minuto

source: Signature creation with off-card hash: ECDSA 256: 360 per minute
it: Creazione della firma con hash fuori scheda: ECDSA 256: 360 al minuto

source: Signature creation with on-card SHA-256 and 1 kb data: RSA 2048; 68 per minute
it: Creazione della firma con on-card SHA-256 e 1 kb di dati: RSA 2048; 68 al minuto

source: Signature creation with on-card SHA-256 and 1 kb data: ECDSA 256: 125 per minute
it: Creazione della firma con SHA-256 sulla scheda e 1 kb di dati: ECDSA 256: 125 al minuto

source: **Q:** How can I distinguish a Nitrokey HSM1 from an Nitrokey HSM2?
it: **Q:** Come posso distinguere un Nitrokey HSM1 da un Nitrokey HSM2?

source: Use ``opensc-tool --list-algorithms`` and compare with the table below. Please also see `this thread`_ for the factsheets and more details.
it: Usate ``opensc-tool --list-algorithms`` e confrontate con la tabella sottostante. Vedi anche `questo thread`_ per le schede informative e maggiori dettagli.

source: **Q:** Which algorithms and maximum key length are supported?
it: **Q:** Quali algoritmi e la lunghezza massima della chiave sono supportati?

source: See the following table:
it: Vedere la seguente tabella:

source: Start
it: Iniziare

source: curve25519
it: curva25519

source: **Q:** How good is the Random Number Generator (RNG)?
it: **Q:** Quanto è buono il generatore di numeri casuali (RNG)?

source: Nitrokey HSM uses the TRNG of JCOP 2.4.1r3 which has a quality of DRNG.2 (according to AIS 31 of the BSI).
it: Nitrokey HSM usa il TRNG di JCOP 2.4.1r3 che ha una qualità di DRNG.2 (secondo AIS 31 del BSI).

source: **Q:** Which API can I use?
it: **Q:** Quale API posso usare?

source: OpenSC: Comprehensive instructions exist for OpenSC framework. There is nitrotool as a more comfortable frontend to OpenSC.
it: OpenSC: esistono istruzioni complete per il framework OpenSC. C'è nitrotool come frontend più comodo per OpenSC.

source: Embedded Systems: For systems with minimal memory footprint a read/only PKCS#11 module is provided by the sc-hsm-embedded project. This PKCS#11 module is useful for deployments where key generation at the user's workplace is not required. The PKCS#11 module also supports major electronic signature cards available in the German market.
it: Sistemi embedded: Per sistemi con un minimo ingombro di memoria, il progetto sc-hsm-embedded fornisce un modulo PKCS#11 in sola lettura. Questo modulo PKCS#11 è utile per implementazioni in cui non è richiesta la generazione di chiavi sul posto di lavoro dell'utente. Il modulo PKCS#11 supporta anche le principali carte di firma elettronica disponibili sul mercato tedesco.

source: OpenSCDP: The SmartCard-HSM is fully integrated with OpenSCDP, the open smart card development platform. See the public support scripts for details. To import existing keys you can use its SCSH or NitroKeyWrapper.
it: OpenSCDP: La SmartCard-HSM è completamente integrata con OpenSCDP, la piattaforma aperta di sviluppo di smart card. Vedi gli script di supporto pubblici per i dettagli. Per importare chiavi esistenti puoi usare il suo SCSH o NitroKeyWrapper.

source: **Q:** Is the Nitrokey Pro Common Criteria or FIPS certified?
it: **Q:** Nitrokey Pro è certificato Common Criteria o FIPS?

source: The security controler's hardware and operating system are Common Criteria certified (`Security Target`_; `HSM2 Report`_; See `here`_, click "ICs, Smart Cards and Smart Card-Related Devices and Systems" and search for "NXP JCOP 3 P60").
it: L'hardware e il sistema operativo del controllore di sicurezza sono certificati Common Criteria (`Security Target`_; `HSM2 Report`_; Vedi `qui`_, clicca "ICs, Smart Cards and Smart Card-Related Devices and Systems" e cerca "NXP JCOP 3 P60").

source: Importing Keys and Certificates
it: Importare chiavi e certificati

source: Generally the concept to import key-pairs and/or certificates is the following:
it: Generalmente il concetto per importare coppie di chiavi e/o certificati è il seguente:

source: Create a DKEK (Device Key Encryption Key) share
it: Creare una condivisione DKEK (Device Key Encryption Key)

source: Initialize device and enable DKEK as "Device Encryption Scheme"
it: Inizializzare il dispositivo e abilitare DKEK come "Device Encryption Scheme"

source: Import DKEK share into device
it: Importare la quota DKEK nel dispositivo

source: Import PKCS#12 container(s) into DKEK
it: Importare i contenitori PKCS#12 in DKEK

source: This documentation covers only one specific use-case and should serve as an example for the overall workflow. For further information please read `this thread`_ and `this blog post`_.
it: Questa documentazione copre solo un caso d'uso specifico e dovrebbe servire come esempio per il flusso di lavoro complessivo. Per ulteriori informazioni si prega di leggere `questo thread`_ e `questo post sul blog`_.
