Repository: DamienCassou/nitrokey-documentation
Catalog: locales/*/LC_MESSAGES/hsm.po
Languages: it

source: If you do not have a S/MIME key-certificate pair installed on your Nitrokey yet, please look at `this page <smime.html>`_ first.
it: Se non avete ancora una coppia chiave-certificato S/MIME installata sulla vostra Nitrokey, guardate prima `questa pagina <smime.html>`_.

source: You need to have OpenSC installed on your System. Please have a look at the `wiki page of the OpenSC project <https://github.com/OpenSC/OpenSC/wiki>`_.
it: Devi avere OpenSC installato sul tuo sistema. Dai un'occhiata alla ` pagina wiki del progetto OpenSC <https://github.com/OpenSC/OpenSC/wiki>`_.

source: Settings in Outlook
it: Impostazioni in Outlook

source: Before you can use the Nitrokey in Outlook you have to activate S/MIME encryption. You can achieve this by clicking on to ‘Start’ -> ‘Options’ and clicking on ‘Trust Center’ in the options window. In section ‘Email Security’ you can choose your S/MIME identity. Your certificate should already be recognized by Outlook.
it: Prima di poter usare Nitrokey in Outlook devi attivare la crittografia S/MIME. Puoi ottenere questo cliccando su 'Start' -> 'Opzioni' e cliccando su 'Trust Center' nella finestra delle opzioni. Nella sezione 'Email Security' puoi scegliere la tua identità S/MIME. Il tuo certificato dovrebbe già essere riconosciuto da Outlook.

source: When composing a mail you can now choose to encrypt and sign the message in the ‘Options’ ribbon of the compose window.
it: Quando si compone una mail si può ora scegliere di criptare e firmare il messaggio nel nastro 'Opzioni' della finestra di composizione.

source: Outlook will only encrypt message to mail addresses which are saved in your address book. So make sure, that the persons you want to write an encrypted mail to have an entry in Outlook’s contacts. You can ask the person to write you a signed mail, so that you can import the certificate information.
it: Outlook cripta solo i messaggi agli indirizzi di posta che sono salvati nella vostra rubrica. Assicuratevi quindi che le persone a cui volete scrivere un messaggio criptato abbiano una voce nei contatti di Outlook. Puoi chiedere alla persona di scriverti un messaggio firmato, in modo da poter importare le informazioni del certificato.

source: Depending on your certificate or the certificate of your partners you may have to import a so-called root certificate. This is the certificate of the party which issued the certificate you or your partner uses. You should usually got informed if this is necessary.
it: A seconda del tuo certificato o di quello dei tuoi partner potresti dover importare un cosiddetto certificato di root. Questo è il certificato della parte che ha emesso il certificato che voi o il vostro partner usate. Di solito dovresti essere informato se questo è necessario.

source: S/MIME Email Encryption with Thunderbird
it: Crittografia e-mail S/MIME con Thunderbird

source: If you do not have a S/MIME key-certificate pair installed on your Nitrokey yet or if you did not installed OpenSC, please look at `this page <smime.html>`_ first.
it: Se non avete ancora una coppia chiave-certificato S/MIME installata sulla vostra Nitrokey o se non avete installato OpenSC, guardate prima ` questa pagina <smime.html>`_.

source: You need to have `OpenSC installed <https://github.com/OpenSC/OpenSC/wiki>`_ on your System. While GNU/Linux users usually can install OpenSC over the package manager (e.g. ``sudo apt update && sudo apt install opensc`` on Ubuntu), macOS and Windows users can download the installation files from OpenSC directly.
it: Dovete avere `OpenSC installato <https://github.com/OpenSC/OpenSC/wiki>`_ sul vostro sistema. Mentre gli utenti GNU/Linux di solito possono installare OpenSC tramite il gestore di pacchetti (ad esempio ``sudo apt update && sudo apt install opensc`` su Ubuntu), gli utenti macOS e Windows possono scaricare direttamente i file di installazione da OpenSC.

source: Settings in Thunderbird
it: Impostazioni in Thunderbird

source: Before you can use the Nitrokey in Thunderbird you have to activate S/MIME encryption in the account settings. You can achieve this by clicking on the menu and go to ‘Preferences’ -> ‘Account Settings’ and clicking on ‘Security’ in the account settings window.
it: Prima di poter usare Nitrokey in Thunderbird devi attivare la crittografia S/MIME nelle impostazioni dell'account. Puoi ottenerlo cliccando sul menu e andando su 'Preferenze' -> 'Impostazioni account' e cliccando su 'Sicurezza' nella finestra delle impostazioni dell'account.

source: Click on “Security Devices” to import the right PCKS11 module. Click on “Load” on the right-hand side. Now give the Module a name (like “OpenSC Module”) and click on “Browse” to choose the location of the Module (see below).
it: Cliccate su "Dispositivi di sicurezza" per importare il modulo PCKS11 giusto. Cliccate su "Load" sul lato destro. Ora dai un nome al modulo (come "OpenSC Module") e clicca su "Browse" per scegliere la posizione del modulo (vedi sotto).

source: On Windows the right file lays under “C:\Windows\System32\opensc-pkcs11.dll”. On macOS and GNU/Linux the file should be in “/lib/pkcs11/opensc-pkcs11.so” or “/usr/lib/pkcs11/opensc-pkcs11.so” or alike. Press “OK” twice and you are back in security section of the account settings. Now you can actually choose a certificate on the upper part of the window. You should get asked for a PIN to unlock your Nitrokey. Please type in your User PIN.
it: Su Windows il file giusto si trova sotto "C:\Windows\System32\opensc-pkcs11.dll". Su macOS e GNU/Linux il file dovrebbe essere in "/lib/pkcs11/opensc-pkcs11.so" o "/usr/lib/pkcs11/opensc-pkcs11.so" o simili. Premi due volte "OK" e sei di nuovo nella sezione sicurezza delle impostazioni dell'account. Ora puoi effettivamente scegliere un certificato nella parte superiore della finestra. Ti dovrebbe essere chiesto un PIN per sbloccare la tua Nitrokey. Digita il tuo PIN utente.

source: When composing an email you can now choose to encrypt and sign the message.
it: Quando si compone un'e-mail è ora possibile scegliere di crittografare e firmare il messaggio.

source: Nitrokey HSM with macOS
it: Nitrokey HSM con macOS

source: Install `OpenSC <https://github.com/OpenSC/OpenSC/wiki>`_. Alternatively, install `this <https://www.cardcontact.de/download/sc-hsm-starterkit.zip>`_ driver (`source <https://github.com/CardContact/sc-hsm-embedded>`_).
it: Installare `OpenSC <https://github.com/OpenSC/OpenSC/wiki>`_. In alternativa, installate ` questo <https://www.cardcontact.de/download/sc-hsm-starterkit.zip>`_ driver (`source <https://github.com/CardContact/sc-hsm-embedded>`_).

source: Nitrokey HSM with Windows
it: Nitrokey HSM con Windows

source: Login to Windows Domain Computers With MS Active Directory
it: Accedere ai computer di dominio di Windows con MS Active Directory

source: Download and install the latest `OpenSC <https://github.com/OpenSC/OpenSC/wiki>`_.
it: Scaricare e installare l'ultima ` OpenSC <https://github.com/OpenSC/OpenSC/wiki>`_.

source: Use a text editor to add the following settings to *C:\Program Files:\OpenSC Project\OpenSC\opensc.conf*.
it: Usa un editor di testo per aggiungere le seguenti impostazioni a *C:\Program Files:\OpenSC Project\OpenSC\opensc.conf*.

source: Open a command terminal and enter “regedit”. Use regedit to import `this file <https://www.nitrokey.com/sites/default/files/nk-hsm.reg>`_.
it: Aprite un terminale di comando e digitate "regedit". Usate regedit per importare ` questo file <https://www.nitrokey.com/sites/default/files/nk-hsm.reg>`_.

source: Now you can enroll Nitrokeys for your users managed in Microsoft Active Directory. You may either use Microsoft PKI, `gpgsm <https://www.gnupg.org/documentation/manuals/gnupg/Howto-Create-a-Server-Cert.html>`_, or `Smart Policy <https://www.mysmartlogon.com/products/smart-policy.html>`_. The following steps describe the usage of Smart Policy.
it: Ora potete iscrivere Nitrokeys per i vostri utenti gestiti in Microsoft Active Directory. Potete usare Microsoft PKI, `gpgsm <https://www.gnupg.org/documentation/manuals/gnupg/Howto-Create-a-Server-Cert.html>`_, o `Smart Policy <https://www.mysmartlogon.com/products/smart-policy.html>`_. I seguenti passi descrivono l'uso di Smart Policy.

source: `Download <http://download.mysmartlogon.com/SmartPolicyv2/SmartPolicy%20-%20Stage%203.exe>`_ and install Smart Policy.
it: `Scaricate <http://download.mysmartlogon.com/SmartPolicyv2/SmartPolicy%20-%20Stage%203.exe>`_ e installate Smart Policy.

source: Select “Read a smart card”
it: Selezionare "Leggere una smart card".

source: Select the certificate, mapping, and user.
it: Seleziona il certificato, la mappatura e l'utente.

source: Verify the device status via CRL.
it: Verificare lo stato del dispositivo tramite CRL.

source: Choose a Group Policy Object (GPO).
it: Scegliete un oggetto dei criteri di gruppo (GPO).

source: Confirm applying the mapping.
it: Confermare l'applicazione della mappatura.

source: From now on, when logging on to your Windows computer you need to connect the Nitrokey and enter your PIN.
it: D'ora in poi, quando ti connetti al tuo computer Windows devi collegare la Nitrokey e inserire il tuo PIN.
