Repository: DamienCassou/nitrokey-documentation
Catalog: locales/*/LC_MESSAGES/hsm.po
Languages: it

source: This procedure will reset your Nitrokey HSM 2 device and all data on it will be deleted!
it: Questa procedura resetterà il vostro dispositivo Nitrokey HSM 2 e tutti i dati su di esso saranno cancellati!

source: make sure all the keys you would like to import are available as PKCS#12 containers (`.p12`) and you know the password, if needed
it: assicurarsi che tutte le chiavi che si desidera importare siano disponibili come contenitori PKCS#12 (`.p12`) e si conosce la password, se necessario

source: be sure that nothing on the used Nitrokey HSM 2 is needed, it will be deleted during this procedure
it: si assicuri che non ci sia nulla di necessario sul Nitrokey HSM 2 usato, sarà cancellato durante questa procedura

source: download the latest `Smart Card Shell`_ and unpack it into your work-directory
it: scarica l'ultima `Smart Card Shell`_ e scompattala nella tua directory di lavoro

source: Importing via the SCSH3 GUI
it: Importazione tramite la GUI di SCSH3

source: Inside the unpacked directory you will find ``scsh3gui``, which can be started using ``bash scsh3gui`` (for windows double-click on: ``scsh3gui.cmd``).
it: All'interno della directory scompattata troverete ``scsh3gui``, che può essere avviato utilizzando ``bash scsh3gui`` (per windows doppio clic su: ``scsh3gui.cmd``).

source: Once the SCSH3 Tool is open, you should see your Nitrokey HSM 2 inside the tree view. Please follow these steps to import:
it: Una volta che SCSH3 Tool è aperto, dovreste vedere il vostro Nitrokey HSM 2 all'interno della vista ad albero. Seguite questi passi per importare:

source: Start key-manager (File -> Keymanager)
it: Avviare key-manager (File -> Keymanager)

source: Right-click "Smartcard-HSM" -> create DKEK share
it: Cliccate con il tasto destro del mouse su "Smartcard-HSM" -> create DKEK share

source: Choose file location
it: Scegliere la posizione del file

source: Choose DKEK share password
it: Scegliere la password di condivisione DKEK

source: Right-click "Smartcard-HSM" -> Initialize device
it: Fare clic con il tasto destro del mouse su "Smartcard-HSM" -> Inizializzare il dispositivo

source: Enter SO-PIN
it: Inserisci SO-PIN

source: (optional) Enter label and enter URL/Host
it: (opzionale) Inserisci l'etichetta e inserisci l'URL/Host

source: Select authentication method: "User PIN"
it: Selezionare il metodo di autenticazione: "PIN utente"

source: Allow RESET RETRY COUNTER: "Resetting and unblocking PIN with SO-PIN not allowed"
it: Permettere RESET RETRY COUNTER: "Reset e sblocco PIN con SO-PIN non permesso"

source: Enter and confirm User PIN
it: Inserire e confermare il PIN utente

source: Enter number of DKEK shares: 1
it: Inserire il numero di azioni DKEK: 1

source: Right-click DKEK set-up in progress -> "Import DKEK share"
it: Cliccare con il tasto destro del mouse su DKEK set-up in corso -> "Import DKEK share"

source: Choose DKEK share file location
it: Scegliere la posizione del file di condivisione di DKEK

source: Password for DKEK share
it: Password per la condivisione DKEK

source: Right-click "SmartCard-HSM" -> "Import from PKCS#12"
it: Cliccate con il tasto destro del mouse su "SmartCard-HSM" -> "Importa da PKCS#12"

source: Enter number of shares -> 1
it: Inserisci il numero di azioni -> 1

source: Enter file location of DKEK share
it: Inserisci la posizione del file della condivisione DKEK

source: Enter Password for DKEK share
it: Inserisci la password per la quota DKEK

source: Select PKCS#12 container for import (Enter password, if set)
it: Selezionare il contenitore PKCS#12 per l'importazione (inserire la password, se impostata)

source: Select Key
it: Seleziona il tasto

source: Select Name to be used (This is the Label used for the key on the device)
it: Seleziona il nome da usare (Questa è l'etichetta usata per la chiave sul dispositivo)

source: Import more keys, if needed
it: Importare altre chiavi, se necessario

source: Once this is done, you can check that the keys have been successfully imported using:
it: Una volta fatto questo, potete controllare che le chiavi siano state importate con successo usando:

source: In the resulting output you will find the imported keys labeled by the name you chose previously.
it: Nell'output risultante troverete le chiavi importate etichettate con il nome che avete scelto in precedenza.

source: First check the:
it: Prima controlla il:

source: or choose your operating system:
it: o scegliete il vostro sistema operativo:

source: Automatic Screen Lock at Removal
it: Blocco automatico dello schermo alla rimozione

source: This guide will walk you through the configuration of your computer, to automatically lock your session when you remove the Nitrokey.
it: Questa guida ti guiderà attraverso la configurazione del tuo computer, per bloccare automaticamente la tua sessione quando rimuovi la Nitrokey.

source: The configuration requires the creation of two files under two different directories.
it: La configurazione richiede la creazione di due file in due diverse directory.

source: Requirements
it: Requisiti

source: Ubuntu 20.04 or Debian 10 (Buster), both with `Gnome Display Manager <https://wiki.gnome.org/Projects/GDM>`_ installed.
it: Ubuntu 20.04 o Debian 10 (Buster), entrambi con ` Gnome Display Manager <https://wiki.gnome.org/Projects/GDM>`_ installato.

source: Nitrokey Pro 2, Nitrokey Storage 2, or Nitrokey HSM 2
it: Nitrokey Pro 2, Nitrokey Storage 2 o Nitrokey HSM 2

source: Configuration
it: Configurazione

source: Create the ``.rules`` file
it: Creare il file ``.rules``

source: With your favorite text editor create a file called ``85-nitrokey.rules``
it: Con il vostro editor di testo preferito create un file chiamato ``85-nitrokey.rules``

source: Add the following line to the file
it: Aggiungere la seguente linea al file

source: Save the file and quit the editor.
it: Salvate il file e uscite dall'editor.

source: This file sets up a new hardware rule that executes the ``gnome-screensaver-lock`` at removal of the Nitrokey device.
it: Questo file imposta una nuova regola hardware che esegue il ``gnome-screensaver-lock`` alla rimozione del dispositivo Nitrokey.

source: You should change the configuration according to the device you are using as following:
it: Dovreste cambiare la configurazione secondo il dispositivo che state usando come segue:

source: Create the ``gnome-screensaver-lock`` script
it: Creare lo script ``gnome-screensaver-lock``

source: With your favorite text editor create a file called ``gnome-screensaver-lock``
it: Con il vostro editor di testo preferito create un file chiamato ``gnome-screensaver-lock``

source: Add the following text
it: Aggiungere il seguente testo

source: In the first step, this script looks for the user-name of the gnome session, i.e. ``user``.
it: Nel primo passo, questo script cerca il nome utente della sessione gnome, cioè ``user``.

source: When it is called at Nitrokey removal, the script queries ``user``, switches to its session, and locks the screen by prompting the screen-saver screen.
it: Quando viene chiamato alla rimozione della Nitrokey, lo script interroga ``user``, passa alla sua sessione, e blocca lo schermo richiedendo la schermata del salvaschermo.

source: Execute the script
it: Eseguire lo script

source: Once all set up, execute the script once, and it will lock the screen. It does not matter if the Nitrokey is plugged or not for this first execution.
it: Una volta impostato tutto, eseguite lo script una volta, e bloccherà lo schermo. Non importa se la Nitrokey è collegata o meno per questa prima esecuzione.

source: Usage
it: Uso

source: By now you can log back to your session by entering your password, and (re)plug you Nitrokey if you did not do it before.
it: A questo punto puoi accedere nuovamente alla tua sessione inserendo la tua password, e (ri)inserire la tua Nitrokey se non l'hai fatto prima.

source: The next time(s) you unplug your Nitrokey from the computer, it will automatically lock the screen.
it: La prossima volta che staccherete la vostra Nitrokey dal computer, essa bloccherà automaticamente lo schermo.

source: Setup with Gnu Privacy Assistant (GPA)
it: Impostazione con Gnu Privacy Assistant (GPA)

source: This document describes how to use Gnu Privacy Assistant (GPA) to set up the Nitrokey for its first usage.
it: Questo documento descrive come usare Gnu Privacy Assistant (GPA) per impostare la Nitrokey per il suo primo utilizzo.

source: First you need to install Gnu Privacy Assistant (GPA). For Windows you should download and install the `GPG4Win <https://www.gpg4win.org/>`_ package which contains GPA. For Linux you should install the GPA package of your distribution (e.g. on Ubuntu: sudo apt-get install gpa ).
it: Per prima cosa è necessario installare Gnu Privacy Assistant (GPA). Per Windows dovreste scaricare e installare il pacchetto `GPG4Win <https://www.gpg4win.org/>`_ che contiene GPA. Per Linux dovreste installare il pacchetto GPA della vostra distribuzione (ad esempio su Ubuntu: sudo apt-get install gpa ).

source: Start GPA and select the Card Manager; either by pressing the icon at the top or by choosing Card Manager in the Windows menu.
it: Avvia la GPA e seleziona Card Manager; premendo l'icona in alto o scegliendo Card Manager nel menu di Windows.

source: The window of the Card Manager will appear. Enter your salutation, name and optional other information. While doing so you might be asked to enter the admin PIN.
it: Apparirà la finestra del Card Manager. Inserisci il tuo saluto, il tuo nome e altre informazioni opzionali. Mentre lo fai potrebbe esserti chiesto di inserire il PIN dell'amministratore.

source: Confirm this window and enter the admin PIN in the next window.
it: Confermate questa finestra e inserite il PIN dell'amministratore nella finestra successiva.

source: In the Card Manager window you might need to scroll down until you see the buttons to change the PINs. The term PIN is used interchangeable with "password". Press the first button "Change PIN" in order to change the user password. Read and confirm the following information window.
it: Nella finestra Card Manager potrebbe essere necessario scorrere verso il basso fino a vedere i pulsanti per cambiare i PIN. Il termine PIN è usato in modo intercambiabile con "password". Premi il primo pulsante "Cambia PIN" per cambiare la password utente. Leggere e confermare la seguente finestra informativa.

source: Choose and enter your own PIN with a minimum length of six characters. This PIN is required for the daily usage of the Nitrokey.
it: Scegli e inserisci il tuo PIN con una lunghezza minima di sei caratteri. Questo PIN è necessario per l'uso quotidiano della Nitrokey.

source: Go back to the Card Manager window in step three. This time you choose the third button Change PIN in order to change the admin PIN. The admin PIN is required to change the information on the Nitrokey and to change the cryptographic keys. Proceed as described in steps four and five.
it: Torna alla finestra Card Manager al punto tre. Questa volta scegli il terzo pulsante Change PIN per cambiare il PIN dell'amministratore. Il PIN amministratore è necessario per cambiare le informazioni sulla Nitrokey e per cambiare le chiavi crittografiche. Procedi come descritto nei passi quattro e cinque.

source: After changing both the user and the admin PIN, you are back in the Card Manager window. Select "Generate key" in the "Card" menu.
it: Dopo aver cambiato sia il PIN dell'utente che quello dell'amministratore, sei di nuovo nella finestra Card Manager. Seleziona "Genera chiave" nel menu "Carta".

source: Enter your name and e-mail address. You should keep "backup" enabled in order to create a backup file of your cryptographic keys. Optionally you might select an expiration date for your cryptographic keys.
it: Inserisci il tuo nome e il tuo indirizzo e-mail. Dovresti tenere "backup" abilitato per creare un file di backup delle tue chiavi crittografiche. Opzionalmente puoi selezionare una data di scadenza per le tue chiavi crittografiche.

source: Wait until the keys are generated successfully.
it: Aspettate che le chiavi siano generate con successo.

source: Enter a strong passphrase for your backup keys. We strongly recommend to store the backup file on a separate storage(e.g. CD-ROM) and on a safe location.
it: Inserisci una passphrase forte per le tue chiavi di backup. Raccomandiamo vivamente di memorizzare il file di backup su una memoria separata (ad esempio un CD-ROM) e in un luogo sicuro.

source: Congratulations, your Nitrokey is now ready to use. Please see the `applications <https://www.nitrokey.com/documentation/applications>`_ section for further information of its usage.
it: Congratulazioni, la vostra Nitrokey è ora pronta all'uso. Si prega di consultare la sezione `applicazioni <https://www.nitrokey.com/documentation/applications>`_ per ulteriori informazioni sul suo utilizzo.

source: Nitrokey HSM with GNU/Linux
it: Nitrokey HSM con GNU/Linux

source: Install `OpenSC <https://github.com/OpenSC/OpenSC/wiki>`_. You need at least version 0.19. You can find recent builds for debian-based systems like Ubuntu `here <https://github.com/Nitrokey/opensc-build>`_ if your system does not have the newest version of OpenSC. Alternatively, install `this <https://www.cardcontact.de/download/sc-hsm-starterkit.zip>`_ driver (`source <https://github.com/CardContact/sc-hsm-embedded>`_).
it: Installare `OpenSC <https://github.com/OpenSC/OpenSC/wiki>`_. Avete bisogno almeno della versione 0.19. Potete trovare build recenti per sistemi basati su debian come Ubuntu `qui <https://github.com/Nitrokey/opensc-build>`_ se il vostro sistema non ha la versione più recente di OpenSC. In alternativa, installate ` questo <https://www.cardcontact.de/download/sc-hsm-starterkit.zip>`_ driver (`source <https://github.com/CardContact/sc-hsm-embedded>`_).

source: Define SO-PIN and PIN of your own choices. See `these instructions <https://github.com/OpenSC/OpenSC/wiki/SmartCardHSM#initialize-the-device>`_. Afterwards you can begin to `generate new keys <https://github.com/OpenSC/OpenSC/wiki/SmartCardHSM#generate-key-pair>`_.
it: Definite SO-PIN e PIN di vostra scelta. Vedi ` queste istruzioni <https://github.com/OpenSC/OpenSC/wiki/SmartCardHSM#initialize-the-device>`_. Dopo si può iniziare a `generare nuove chiavi <https://github.com/OpenSC/OpenSC/wiki/SmartCardHSM#generate-key-pair>`_.

source: Your Nitrokey is now ready to use. `Checkout <https://www.nitrokey.com/documentation/applications>`_ the various use cases and supported applications.
it: La vostra Nitrokey è ora pronta all'uso. ` Guarda <https://www.nitrokey.com/documentation/applications>`_ i vari casi d'uso e le applicazioni supportate.

source: PKCS#11 URL Generation
it: Generazione di URL PKCS#11

source: Various applications use openssl to handle e.g., TLS certificates. This concept mostly allows simply replacing a file-path (for the secret) with a so-called **PKCS#11 URL** to use a secret from a e.g., Nitrokey.
it: Varie applicazioni usano openssl per gestire, ad esempio, i certificati TLS. Questo concetto permette per lo più di sostituire semplicemente un file-path (per il segreto) con un cosiddetto **PKCS#11 URL** per usare un segreto da un, ad esempio, Nitrokey.

source: ensure ``openssl`` is installed
it: assicurarsi che ``openssl`` sia installato

source: ensure ``openssl`` can use the PKCS#11 engine by installing ``libengine-pkcs11-openssl``
it: assicurarsi che ``openssl`` possa usare il motore PKCS#11 installando ``libengine-pkcs11-openssl``

source: install ``opensc`` and ``gnutls-bin`` for necessary tools
it: installare ``opensc`` e ``gnutls-bin`` per gli strumenti necessari

source: verify that your needed keys and/or certificates are available on your Nitrokey using ``pkcs15-tool -D``
it: verifica che le chiavi e/o i certificati necessari siano disponibili sulla tua Nitrokey usando ``pkcs15-tool -D``

source: if you want to use ECC keys/mechanisms through ``libengine-pkcs11-openssl``, you'll have to ensure its version is at least 0.4.10
it: se volete usare chiavi/meccanismi ECC attraverso ``libengine-pkcs11-openssl``, dovrete assicurarvi che la sua versione sia almeno 0.4.10

source: List and Generate PKCS#11 URLs
it: Elencare e generare URL PKCS#11

source: Use the following command to get a list of available tokens (Nitrokeys):
it: Usate il seguente comando per ottenere una lista di token disponibili (Nitrokeys):

source: Choose the token (Nitrokey) URL you want to generate URL tokens for and use it like this:
it: Scegliete l'URL token (Nitrokey) per cui volete generare token URL e usatelo in questo modo:

source: If you inspect the tail of the URL you'll recognize: ``label``, ``id`` and more, these can be partly removed as long as the necessary objects can be uniquely identified using the resulting URL, see :doc:`TLS Apache2 Configuration<apache2-tls>` for an example using ``id`` only.
it: Se si ispeziona la coda dell'URL si riconosce: ``label``, ``id`` e altri, questi possono essere parzialmente rimossi a patto che gli oggetti necessari possano essere identificati in modo univoco usando l'URL risultante, vedi :doc:`TLS Apache2 Configuration<apache2-tls>` per un esempio usando solo ``id``.

source: S/MIME Email Encryption
it: Crittografia e-mail S/MIME

source: Prerequisites
it: Prerequisiti

source: There are two widely used standards for email encryption.
it: Ci sono due standard ampiamente utilizzati per la crittografia delle e-mail.

source: OpenPGP/GnuPG is popular among individuals,
it: OpenPGP/GnuPG è popolare tra gli individui,

source: S/MIME/X.509 is mostly used by enterprises.
it: S/MIME/X.509 è usato soprattutto dalle imprese.

source: If you are in doubt which one to choose, you should use OpenPGP, see `here <openpgp.html>`_. This page describes the usage of S/MIME email encryption.
it: Se sei in dubbio su quale scegliere, dovresti usare OpenPGP, vedi ` qui <openpgp.html>`_. Questa pagina descrive l'uso della crittografia e-mail S/MIME.

source: You need to purchase a S/MIME certificate or may already got one by your company. Furthermore, you need to install `OpenSC <https://github.com/OpenSC/OpenSC/wiki>`_ on your System. While GNU/Linux users usually can install OpenSC over the package manager (e.g. ``sudo apt install opensc`` on Ubuntu), macOS and Windows users can download the installation files from the `OpenSC <https://github.com/OpenSC/OpenSC/wiki>`_ page.
it: Dovete acquistare un certificato S/MIME o potreste già averne uno dalla vostra azienda. Inoltre, è necessario installare ` OpenSC <https://github.com/OpenSC/OpenSC/wiki>`_ sul vostro sistema. Mentre gli utenti GNU/Linux di solito possono installare OpenSC tramite il gestore dei pacchetti (ad esempio ``sudo apt install opensc`` su Ubuntu), gli utenti macOS e Windows possono scaricare i file di installazione dalla pagina `OpenSC <https://github.com/OpenSC/OpenSC/wiki>`_.

source: Windows users with 64-bit system (standard) need to install both, the 32-bit and the 64-bit version of OpenSC!
it: Gli utenti di Windows con sistema a 64 bit (standard) devono installare entrambe le versioni, quella a 32 bit e quella a 64 bit di OpenSC!

source: Import Existing Key and Certificate
it: Importare la chiave e il certificato esistenti

source: The following instructions are based on the `wiki of OpenSC <https://github.com/OpenSC/OpenSC/wiki/OpenPGP-card>`_. We will assume, that you already got a key-certificate pair as a .p12 file. Please have a look at the wiki page, if you got a separate key and certificate file.
it: Le seguenti istruzioni sono basate sul `wiki di OpenSC <https://github.com/OpenSC/OpenSC/wiki/OpenPGP-card>`_. Assumiamo che abbiate già una coppia chiave-certificato come file .p12. Per favore date un'occhiata alla pagina del wiki, se avete un file chiave e certificato separati.

source: To open the Windows command line please push the Windows-key and R-key. Now type ‘cmd.exe’ in the text field and hit enter. To open a Terminal on macOS or GNU/Linux please use the application search (e.g. spotlight on macOS).
it: Per aprire la riga di comando di Windows premete il tasto Windows e il tasto R. Ora scrivi 'cmd.exe' nel campo di testo e premi invio. Per aprire un terminale su macOS o GNU/Linux usa la ricerca delle applicazioni (ad esempio Spotlight su macOS).

source: To make these commands as simple as possible, the .p12 file needs to be in your home folder. On Windows this is usually ‘C:\Users\yourusername’ and on macOS and GNU/Linux system it will be ‘/home/yourusername’. If you do not store the .p12 file there, you have to adapt the path in the commands below. Please plug in the Nitrokey before submitting the commands.
it: Per rendere questi comandi il più semplice possibile, il file .p12 deve essere nella tua cartella home. Su Windows questa è di solito 'C:\Users\yourusername' e su macOS e GNU/Linux sarà '/home/yourusername'. Se non memorizzi il file .p12 lì, devi adattare il percorso nei comandi qui sotto. Inserisci la Nitrokey prima di inviare i comandi.

source: Assuming that your key-certificate file reads ‘myprivate.p12’ the commands for Windows looks like this:
it: Supponendo che il vostro file di certificato-chiave sia 'myprivate.p12', i comandi per Windows sono questi:

source: and on macOS and GNU/Linux it will be
it: e su macOS e GNU/Linux sarà

source: The two commands copy the key-certificate pair to the slot 2 (needed for decrypting emails) and slot 3 (needed for signing). The output looks on both systems something like this:
it: I due comandi copiano la coppia chiave-certificato nello slot 2 (necessario per decifrare le email) e nello slot 3 (necessario per la firma). L'output appare su entrambi i sistemi qualcosa di simile a questo:

source: Please note that there will be error messages that can be safely ignored (see output example above). You now have the key-certificate pair loaded on the Nitrokey.
it: Notate che ci saranno dei messaggi di errore che possono essere tranquillamente ignorati (vedi l'esempio di output qui sopra). Ora avete la coppia chiave-certificato caricata sulla Nitrokey.

source: You can find further information about the usage on these pages:
it: Potete trovare ulteriori informazioni sull'uso in queste pagine:

source: for using `S/MIME encryption on Thunderbird <smime-thunderbird.html>`_
it: per usare la crittografia `S/MIME su Thunderbird <smime-thunderbird.html>`_

source: for using `S/MIME encryption on Outlook <smime-outlook.html>`_
it: per usare la crittografia `S/MIME su Outlook <smime-outlook.html>`_

source: for using `Evolution <https://help.gnome.org/users/evolution/stable/mail-encryption.html.en>`_, an email client for the Gnome Desktop on Linux systems
it: per l'utilizzo di `Evolution <https://help.gnome.org/users/evolution/stable/mail-encryption.html.en>`_, un client di posta elettronica per il desktop Gnome su sistemi Linux

source: Troubleshooting
it: Risoluzione dei problemi

source: On Windows: Did you install **both**, the 32-bit and the 64-bit version of OpenSC?
it: Su Windows: Avete installato **entrambi**, la versione a 32-bit e quella a 64-bit di OpenSC?

source: Nitrokey Storage 2: You need to install OpenSC in version 0.18 or higher. You can find the files on the `OpenSC website <https://github.com/OpenSC/OpenSC/releases>`_ for Windows and macOS user or `here <https://github.com/Nitrokey/opensc-build>`_ for Debian/Ubuntu users.
it: Nitrokey Storage 2: è necessario installare OpenSC nella versione 0.18 o superiore. Potete trovare i file sul ` sito web di OpenSC <https://github.com/OpenSC/OpenSC/releases>`_ per utenti Windows e macOS o ` qui <https://github.com/Nitrokey/opensc-build>`_ per utenti Debian/Ubuntu.

source: S/MIME Email Encryption with Outlook
it: Crittografia e-mail S/MIME con Outlook
