Repository: DamienCassou/nitrokey-documentation
Catalog: locales/*/LC_MESSAGES/nethsm.po
Languages: it

source: Accessing a NetHSM using the REST API
it: Accedere a un NetHSM usando l'API REST

source: This tutorial demonstrates how to access the NetHMS via REST API. The interface is `documented here <https://nethsmdemo.nitrokey.com/api_docs/index.html#docs/summary/summary>`_ and it's specification is available as `RAML <https://nethsmdemo.nitrokey.com/api_docs/nethsm-api.raml>`_ and as `OpenAPI (Swagger) <https://nethsmdemo.nitrokey.com/api_docs/gen_nethsm_api_oas20.json>`_.
it: Questo tutorial dimostra come accedere al NetHMS via REST API. L'interfaccia è `documentata qui <https://nethsmdemo.nitrokey.com/api_docs/index.html#docs/summary/summary>`_ ed è disponibile come `RAML <https://nethsmdemo.nitrokey.com/api_docs/nethsm-api.raml>`_;è disponibile come `RAML <https://nethsmdemo.nitrokey.com/api_docs/nethsm-api.raml>`_ e come `OpenAPI (Swagger) <https://nethsmdemo.nitrokey.com/api_docs/gen_nethsm_api_oas20.json>`_.

source: Before we start, we store the host name of the NetHSM instance in the ``NETHSM_HOST`` environment variable. You can use the public NetHSM demo instance ``nethsmdemo.nitrokey.com`` or run a local demo instance using the NetHSM docker image, see the `Development and Testing </index.html#development-and-testing>`_ section of the NetHSM documentation.
it: Prima di iniziare, memorizziamo il nome dell'host dell'istanza di NetHSM nella variabile d'ambiente ``NETHSM_HOST``. È possibile utilizzare l'istanza demo pubblica di NetHSM ``nethsmdemo.nitrokey.com`` o eseguire un'istanza demo locale utilizzando l'immagine docker di NetHSM, vedere la sezione `Sviluppo e test </index.html#development-and-testing>`_ della documentazione di NetHSM.

source: If you use a NetHSM demo instance with a self-signed certificate, for example using the Docker image, you will have to use the ``--insecure``/``-k`` option for ``curl`` to skip the certificate check.
it: Se usate un'istanza demo di NetHSM con un certificato autofirmato, per esempio usando l'immagine Docker, dovrai usare l'opzione ``--insecure``/``-k`` per ``curl`` per saltare il controllo del certificato.

source: First, let’s see what we have here:
it: Per prima cosa, vediamo cosa abbiamo qui:

source: The ``-i``/``--include`` option causes ``curl`` to print the HTTP status code and the response headers. The ``-w '\n'``/``--write-out '\n'`` option adds a newline after the response body.
it: L'opzione ``-i``/``--include`` fa sì che ``curl`` stampi il codice di stato HTTP e gli header della risposta. L'opzione ``-w '\n'``/``--write-out '\n'`` aggiunge una newline dopo il corpo della risposta.

source: See what the device’s status is:
it: Vedere qual è lo stato del dispositivo:

source: Initialization
it: Inizializzazione

source: A new NetHSM needs to be provisioned first with passphrases and the current time. The *Admin Passphrase* is the *Administrator*’s passphrase, which is the super user of the NetHSM. The *Unlock Passphrase* is used to encrypt NetHSM’s confidential data store.
it: Un nuovo NetHSM deve essere prima approvvigionato con le passphrase e l'ora corrente. La *Admin Passphrase* è la passphrase dell'*Administrator*, che è il super utente del NetHSM. La *Passphrase di sblocco* è usata per criptare l'archivio di dati riservati del NetHSM.

source: The NetHSM demo instance at ``nethsmdemo.nitrokey.com`` is already provisioned.
it: L'istanza demo di NetHSM a ``nethsmdemo.nitrokey.com`` è già fornita.

source: NetHSM can be used in *Attended Boot* mode and *Unattended Boot* mode.
it: NetHSM può essere usato in modalità *Attended Boot* e *Unattended Boot*.

source: In *Attended Boot* mode the *Unlock Passphrase* needs to be entered during each start which is used to encrypt the data store. For security reasons this mode is recommended.
it: In modalità *Attended Boot* è necessario inserire la *Unlock Passphrase* durante ogni avvio, che è usata per crittografare l'archivio dati. Per ragioni di sicurezza questa modalità è raccomandata.

source: In *Unattended Boot* mode no Unlock Passphrase is required, therefore the NetHSM can start unattended and the data store is stored unencrypted. Use this mode if your availability requirements can’t be fulfilled with *Attended Boot* mode.
it: Nella modalità *Unattended Boot* non è richiesta alcuna Passphrase di sblocco, quindi il NetHSM può avviarsi senza sorveglianza e l'archivio dati è memorizzato in modo non criptato. Usa questa modalità se i tuoi requisiti di disponibilità non possono essere soddisfatti con la modalità *Attended Boot*.

source: Retrieve the current mode:
it: Recupera la modalità corrente:

source: Switch to *Unattended Boot* mode:
it: Passare alla modalità *Avvio non assistito*:

source: Or switch back to *Attended Boot* mode:
it: Oppure tornare alla modalità *Attended Boot*:

source: User Management
it: Gestione degli utenti

source: Roles
it: Ruoli

source: Separation of duties can be implemented by using the available Roles. Each user account configured on the NetHSM has one of the following Roles assigned to it. Following is a high-level description of the operations allowed by individual Roles, for endpoint-specific details please refer to the REST API documentation.
it: La separazione dei compiti può essere implementata utilizzando i Ruoli disponibili. Ogni account utente configurato sul NetHSM ha uno dei seguenti Ruoli assegnati ad esso. Di seguito è riportata una descrizione di alto livello delle operazioni consentite dai singoli Ruoli, per i dettagli specifici dell'endpoint si rimanda alla documentazione REST API.

source: *R-Administrator*: A user account with this Role has access to all operations provided by the REST API, with the exception of key usage operations, i.e. message signing and decryption.
it: *R-Administrator*: Un account utente con questo ruolo ha accesso a tutte le operazioni fornite dall'API REST, ad eccezione delle operazioni di utilizzo delle chiavi, cioè la firma e la decrittazione dei messaggi.

source: *R-Operator*: A user account with this Role has access to all key usage operations, a read-only subset of key management operations and user management operations allowing changes to their own account only.
it: *R-Operatore*: Un account utente con questo ruolo ha accesso a tutte le operazioni di utilizzo delle chiavi, a un sottoinsieme di operazioni di gestione delle chiavi in sola lettura e alle operazioni di gestione degli utenti che consentono modifiche solo al proprio account.

source: *R-Metrics*: A user account with this Role has access to read-only metrics operations only.
it: *R-Metriche*: Un account utente con questo ruolo ha accesso solo alle operazioni di metrica in sola lettura.

source: *R-Backup*: A user account with this Role has access to the operations required to initiate a system backup only.
it: *R-Backup*: Un account utente con questo ruolo ha accesso solo alle operazioni necessarie per avviare un backup del sistema.

source: Note: In a future release another Role will be implemented which is allowed to /keys/ POST, /keys/generate POST, /keys/{KeyID} PUT & DELETE, /keys/{KeyID}/cert PUT & DELETE in addition to what R-Operator is allowed to do.
it: Nota: in una versione futura sarà implementato un altro ruolo che è autorizzato a /keys/ POST, /keys/generate POST, /keys/{KeyID} PUT & DELETE, /keys/{KeyID}/cert PUT & DELETE in aggiunta a ciò che R-Operator è autorizzato a fare.

source: Create a User
it: Creare un utente

source: Now create a new user with the operator role that can be used to sign and decrypt data. Note that the NetHSM assigns a random user ID if we don’t specify it.
it: Ora create un nuovo utente con il ruolo di operatore che può essere usato per firmare e decifrare i dati. Notate che il NetHSM assegna un ID utente casuale se non lo specifichiamo.

source: Key Management
it: Gestione delle chiavi

source: The NetHSM supports RSA, ED25519 and ECDSA keys. When creating a key, you have to select both the key algorithm and the key mechanisms to use. RSA keys can be used for decryption (with the modes raw, PKCS #1 and OAEP with MD5, SHA1, SHA224, SHA256, SHA384 or SHA512) and for signatures (with the modes PKCS #1 and PSS with MD5, SHA1, SHA224, SHA256, SHA384 or SHA512). The other algorithms only support the signature mechanism.
it: Il NetHSM supporta le chiavi RSA, ED25519 e ECDSA. Quando si crea una chiave, è necessario selezionare sia l'algoritmo di chiave che i meccanismi di chiave da utilizzare. Le chiavi RSA possono essere usate per la decrittazione (con le modalità raw, PKCS #1 e OAEP con MD5, SHA1, SHA224, SHA256, SHA384 o SHA512) e per la firma (con le modalità PKCS #1 e PSS con MD5, SHA1, SHA224, SHA256, SHA384 o SHA512). Gli altri algoritmi supportano solo il meccanismo di firma.

source: For a complete list of available key algorithms and key mechanisms, see the API documentation for the KeyAlgorithm_ and KeyMechanism_ types.
it: Per una lista completa di algoritmi e meccanismi di chiavi disponibili, vedere la documentazione API per i tipi KeyAlgorithm_ e KeyMechanism_.

source: Generate Keys
it: Generare le chiavi

source: In this guide, we want to use an RSA key to decrypt data using PKCS #1 and to sign data with PSS using SHA256. So let’s generate a new key on the NetHSM. Make sure to use the ``RSA`` algorithm and to select the ``RSA_Signature_PSS_SHA256`` and ``RSA_Decryption_PKCS1`` key mechanisms. If you don’t specify a key ID, the NetHSM will generate a random ID for the new key.
it: In questa guida, vogliamo usare una chiave RSA per decifrare i dati usando PKCS #1 e per firmare i dati con PSS usando SHA256. Quindi generiamo una nuova chiave sul NetHSM. Assicuratevi di usare l'algoritmo ``RSA`` e di selezionare i meccanismi di chiave ``RSA_Signature_PSS_SHA256`` e ``RSA_Decryption_PKCS1``. Se non si specifica un ID chiave, NetHSM genererà un ID casuale per la nuova chiave.

source: Import Keys
it: Importazione di chiavi

source: Instead of generating a key on the NetHSM, you can also import existing private keys into the NetHSM:
it: Invece di generare una chiave sul NetHSM, potete anche importare chiavi private esistenti nel NetHSM:

source: List Keys
it: Chiavi dell'elenco

source: To make sure that the key has been created and has the correct algorithm and mechanism settings, we can query all keys on the NetHSM:
it: Per assicurarsi che la chiave sia stata creata e che abbia le impostazioni corrette dell'algoritmo e del meccanismo, possiamo interrogare tutte le chiavi sul NetHSM:

source: Show Key Details
it: Mostra dettagli chiave

source: We can also query the public key of the generated key pair:
it: Possiamo anche interrogare la chiave pubblica della coppia di chiavi generata:

source: To be able to use the key with ``openssl``, we export it as a PEM file and store it as ``public.pem``:
it: Per poter utilizzare la chiave con ``openssl``, la esportiamo come file PEM e la memorizziamo come ``public.pem``:

source: We can inspect the key with ``openssl`` and use it for encryption or signature verification (as described in the next section):
it: Possiamo ispezionare la chiave con ``openssl`` e usarla per la crittografia o la verifica della firma (come descritto nella prossima sezione):

source: Key Certificates
it: Certificati chiave

source: It is possible to set and query certificates for the keys stored on a NetHSM instance:
it: È possibile impostare e interrogare i certificati per le chiavi memorizzate su un'istanza di NetHSM:

source: Key Certificate Signing Requests
it: Richieste di firma di certificati chiave

source: The NetHSM supports generating Certificate Signing Requests (CSR) for the stored keys:
it: Il NetHSM supporta la generazione di Certificate Signing Requests (CSR) per le chiavi memorizzate:

source: Key Operations
it: Operazioni chiave

source: Decryption
it: Decrittazione

source: We can encrypt data for the key stored on the NetHSM using ``openssl``. (``public.pem`` is the public key file that we created in the `Show Key Details`_ section.)
it: Possiamo criptare i dati per la chiave memorizzata sul NetHSM usando ``openssl``. (``public.pem`` è il file della chiave pubblica che abbiamo creato nella sezione `Show Key Details`_).

source: Now we can use the NetHSM to decrypt the data:
it: Ora possiamo usare il NetHSM per decifrare i dati:

source: Signing
it: Firma

source: Similarily, we can sign data using the key on the NetHSM. For RSA and ECDSA, we have to calculate a digest first:
it: Allo stesso modo, possiamo firmare i dati usando la chiave sul NetHSM. Per RSA e ECDSA, dobbiamo prima calcolare un digest:

source: Then we can create a signature from this digest using the NetHSM:
it: Poi possiamo creare una firma da questo digest usando il NetHSM:

source: And then use ``openssl`` to verify the signature:
it: E poi usare ``openssl`` per verificare la firma:

source: It is possible to crate a backup of the NetHSM that captures both the configuration and the stored keys. In order to create a backup, you first have to set a backup passphrase that is used to encrypt the backup file:
it: È possibile creare un backup del NetHSM che cattura sia la configurazione che le chiavi memorizzate. Per creare un backup, devi prima impostare una passphrase di backup che viene utilizzata per crittografare il file di backup:

source: Now you have to create a user with the *R-Backup* role:
it: Ora dovete creare un utente con il ruolo *R-Backup*:

source: Then can you generate the backup and write it to a file:
it: Poi può generare il backup e scriverlo su un file:

source: This backup file can be restored on an unprovisioned NetHSM instance:
it: Questo file di backup può essere ripristinato su un'istanza NetHSM non provvista:

source: Updates
it: Aggiornamenti

source: Updates for the NetHSM can be installed in a two-step process. First you have to upload the update image to the NetHSM. The image is then checked and validated. If the validation is successful, the release notes for the update are returned by the NetHSM:
it: Gli aggiornamenti per il NetHSM possono essere installati in un processo in due fasi. Prima devi caricare l'immagine di aggiornamento sul NetHSM. L'immagine viene poi controllata e convalidata. Se la convalida ha successo, le note di rilascio per l'aggiornamento sono restituite dal NetHSM:

source: If you want to continue with the installation, you can now commit the update:
it: Se volete continuare con l'installazione, potete ora impegnare l'aggiornamento:

source: Alternatively, you can cancel the update:
it: In alternativa, è possibile annullare l'aggiornamento:

source: Accessing a NetHSM with the nitropy command line tool
it: Accedere a un NetHSM con lo strumento a riga di comando nitropy

source: This tutorial demonstrates how to access the NetHMS via `nitropy <https://github.com/Nitrokey/pynitrokey>`_ command line tool, which you need to download and install.
it: Questo tutorial dimostra come accedere al NetHMS tramite `nitropia <https://github.com/Nitrokey/pynitrokey>`_ strumento a riga di comando, che è necessario scaricare e installare.

source: If you use a NetHSM demo instance with a self-signed certificate, for example using the Docker image, you will have to use the ``--no-verify-tls`` option for ``nitropy`` to skip the certificate check.
it: Se usate un'istanza demo di NetHSM con un certificato autofirmato, per esempio usando l'immagine Docker, dovrete usare l'opzione ``--no-verify-tls`` per ``nitropy`` per saltare il controllo del certificato.

source: Getting Started
it: Come iniziare

source: Connect the NetHSM's ETH3 port with the network. Don't use the ETH0 port because it allows wider system access.
it: Collegate la porta ETH3 del NetHSM con la rete. Non usate la porta ETH0 perché permette un accesso più ampio al sistema.

source: The NetHSM appliance is available at address 192.168.1.1. Access and initialize the NetHSM using `nitropy command line tool <cli.html>`_. Alternatively, the `REST API <api.html>`_ and `PKCS#11 driver <pkcs11.html>`_ can be used.
it: Il dispositivo NetHSM è disponibile all'indirizzo 192.168.1.1. Accedere e inizializzare il NetHSM usando ` lo strumento della linea di comandonitropia <cli.html>`_. In alternativa, è possibile utilizzare le `REST API <api.html>`_ e `il driver <pkcs11.html>`_ PKCS#11.

source: Development and Testing
it: Sviluppo e test

source: A public NetHSM demo instance is available at `nethsmdemo.nitrokey.com <https://nethsmdemo.nitrokey.com>`_.
it: Un'istanza demo pubblica di NetHSM è disponibile su `nethsmdemo.nitrokey.com <https://nethsmdemo.nitrokey.com>`_.

source: Alternatively you can run the `NetHSM Docker container <https://hub.docker.com/r/nitrokey/nethsm>`_ locally. The NetHSM container requires nested virtualization for strong separation with other containers. Thus, to start a NetHSM container you need a Linux host with /dev/kvm available. Execute this command:
it: In alternativa potete eseguire il contenitore Docker `NetHSM <https://hub.docker.com/r/nitrokey/nethsm>`_ localmente. Il contenitore NetHSM richiede una virtualizzazione annidata per una forte separazione con altri contenitori. Quindi, per avviare un contenitore NetHSM hai bisogno di un host Linux con /dev/kvm disponibile. Esegui questo comando:

source: Integration to Custom Application
it: Integrazione all'applicazione personalizzata

source: To integrate the NetHSM into own custom applications client libraries are available for almost all programming languages, including JavaScript, C++ and Python for example. Therefore we recommend using `OpenAPI Generator <https://github.com/OpenAPITools/openapi-generator>`_.
it: Per integrare il NetHSM nelle proprie applicazioni personalizzate sono disponibili librerie client per quasi tutti i linguaggi di programmazione, inclusi JavaScript, C++ e Python per esempio. Pertanto si consiglia di utilizzare ` OpenAPI Generator <https://github.com/OpenAPITools/openapi-generator>`_.

source: To list all the available languages, you enter
it: Per elencare tutte le lingue disponibili, si inserisce

source: Then you can generate the NetHSM client for your programming language like this:
it: Poi potete generare il client NetHSM per il vostro linguaggio di programmazione in questo modo:

source: The generated client code, in this example JavaScript, will be created in the ``./out/`` directory. This folder also contains the necessary documentation how to use it.
it: Il codice client generato, in questo esempio JavaScript, sarà creato nella cartella ``./out/``. Questa cartella contiene anche la documentazione necessaria al suo utilizzo.

source: This driver is still an early Proof of Concept implementation that only implements the functions that are necessary for operating TLS servers like for example an HTTPS server.
it: Questo driver è ancora una prima implementazione Proof of Concept che implementa solo le funzioni che sono necessarie per far funzionare i server TLS come per esempio un server HTTPS.

source: Accessing a NetHSM using the PKCS#11 driver
it: Accedere a un NetHSM usando il driver PKCS#11

source: Download the `PKCS#11 driver <https://github.com/Nitrokey/nethsm-pkcs11>`_ for NetHSM.
it: Scarica il driver `PKCS#11 <https://github.com/Nitrokey/nethsm-pkcs11>`_ per NetHSM.

source: Modify the configuration file ``p11nethsm.conf`` according to your setup (e.g. address, operator name) and store it in ``$HOME/.nitrokey``, ``/etc/nitrokey/``, or in the folder where your application is executed.
it: Modificate il file di configurazione ``p11nethsm.conf`` secondo la vostra configurazione (es. indirizzo, nome dell'operatore) e memorizzarlo in ``$HOME/.nitrokey``, ``/etc/nitrokey/``, o nella cartella dove viene eseguita la vostra applicazione.

source: Decrypting
it: Decifrare

source: After creating a key (here: ID 42) with the according mechanism, you can use it for decryption:
it: Dopo aver creato una chiave (in questo caso: ID 42) con il meccanismo indicato, è possibile utilizzarla per la decrittazione:

source: After creating a key (here: ID 23) with the according mechanism, you can use it for decryption:
it: Dopo aver creato una chiave (in questo caso: ID 23) con il meccanismo corrispondente, è possibile utilizzarla per la decrittazione:
