Repository: DamienCassou/nitrokey-documentation
Catalog: locales/*/LC_MESSAGES/nextbox.po
Languages: it

source: Factory Reset
it: Reset di fabbrica

source: Factory Resetting your NextBox will inevitably **delete all your files** on the NextBox and any configuration settings.
it: Il reset di fabbrica di NextBox inevitabilmente **cancellerà tutti i tuoi file** su NextBox e tutte le impostazioni di configurazione.

source: **To factory reset your NextBox simply press the hardware button for 5 seconds.**
it: **Per resettare di fabbrica il suo NextBox, prema semplicemente il pulsante hardware per 5 secondi.

source: The NextBox LED will change to *blue* once you press the button, after the 5 seconds have passed the color will change to blinking red (see :doc:`LED documentation <led-colors>`). Once the LED has finally reached *green* again your NextBox is ready for the initial setup as described in :doc:`Getting Started <../gettingstarted>`
it: Il LED di NextBox cambierà in *blu* una volta premuto il pulsante, dopo che sono passati i 5 secondi il colore cambierà in rosso lampeggiante (vedi :doc:`Documentazione LED <led-colors>`). Una volta che il LED ha finalmente raggiunto di nuovo il *verde* il tuo NextBox è pronto per la configurazione iniziale come descritto in :doc:`Getting Started <../gettingstarted>`

source: The hardware button is a pinhole-style button similar to other embedded devices. In order to press it, it is recommended to use a thin (~1mm) needle-like pin. E.g., the pin to remove a sim-card from a smartphone is working great. **Further take care to not press the button too hard, be careful, there should be a recognizable haptic feedback (button click) with minimal applied force.**
it: Il pulsante hardware è un pulsante di tipo pinhole simile ad altri dispositivi incorporati. Per premerlo, si raccomanda di usare uno spillo sottile (~1mm) tipo ago. Ad esempio, lo spillo per rimuovere una sim-card da uno smartphone funziona benissimo. **Fate attenzione a non premere il pulsante troppo forte, fate attenzione, ci dovrebbe essere un feedback aptico riconoscibile (click del pulsante) con una forza minima applicata.

source: Technical Documentation
it: Documentazione tecnica

source: LED Colors and Patterns
it: Colori e motivi dei LED

source: Color
it: Colore

source: Pattern
it: Modello

source: Description
it: Descrizione

source: Dimmed-out-Blue
it: Oscurato-Blu

source: None
it: Nessuno

source: NextBox is booting
it: NextBox si sta avviando

source: Green
it: Verde

source: NextBox Daemon active and in regular operating mode
it: NextBox Daemon attivo e in modalità operativa regolare

source: Nextcloud is starting up (docker starting)
it: Nextcloud si sta avviando (docker in partenza)

source: Blue
it: Blu

source: (Reset) button is currently being pressed
it: Il pulsante (Reset) è attualmente premuto

source: Yellow
it: Giallo

source: Initializing NextBox Daemon
it: Inizializzazione del demone NextBox

source: NextBox Daemon update check/apply
it: Controllo/applicazione degli aggiornamenti del demone NextBox

source: Red
it: Rosso

source: Factory-Reset is ongoing
it: Il ripristino della fabbrica è in corso

source: Purple
it: Viola

source: Nextcloud Maintenance mode active
it: Nextcloud Modalità di manutenzione attiva

source: **Fast-Blink** means 0,5secs on and 0,5secs off
it: **Fast-Blink** significa 0,5secs on e 0,5secs off

source: **Blink** means 2secs on and 2secs off
it: **Blink** significa 2 secondi di accensione e 2 secondi di spegnimento

source: If the LED is *purple*, the Nextcloud instance is in maintenance mode, you can force exit the maintenance mode by pushing the hardware button **shortly, once**. The NextBox will then switch-off the maintenance mode.
it: Se il LED è *viola*, l'istanza Nextcloud è in modalità di manutenzione, è possibile forzare l'uscita dalla modalità di manutenzione premendo il pulsante hardware **brevemente, una volta**. Il NextBox spegnerà quindi la modalità di manutenzione.

source: As of today if the maintenance mode is switched using the button press, the "mail" app will in addition be disabled as the version 1.11.0 together with Nextcloud version 21.0.0.x will never exit the maintenance mode.
it: A partire da oggi, se la modalità di manutenzione viene commutata tramite la pressione del pulsante, l'app "mail" sarà inoltre disabilitata poiché la versione 1.11.0 insieme alla versione 21.0.0.x di Nextcloud non uscirà mai dalla modalità di manutenzione.

source: Replace Internal Hard-Drive
it: Sostituire il disco rigido interno

source: Please do this only, if you know what you are doing. By modifying the NextBox you void your warranty for at least the hardware of the NextBox. These steps are generally not covered by the support, you are modifying your NextBox at your own risk!
it: Si prega di farlo solo se si sa cosa si sta facendo. Modificando il NextBox si annulla la garanzia almeno per l'hardware del NextBox. Questi passaggi non sono generalmente coperti dal supporto, si sta modificando il NextBox a proprio rischio e pericolo!

source: Prerequisites
it: Prerequisiti

source: Linux(-like) operating system
it: Sistema operativo Linux(-like)

source: 2.5'' hard-drive with a max height of 15mm, most are 7mm
it: 2.5'' hard-drive con un'altezza massima di 15mm, la maggior parte sono 7mm

source: A user which can acquire root-rights using ``sudo``
it: Un utente che può acquisire i diritti di root usando ``sudo``

source: The following commands must be available: ``sudo``, ``parted``, ``mkfs.ext4``, ``bash``
it: I seguenti comandi devono essere disponibili: ``sudo``, ``parted``, ``mkfs.ext4``, ``bash``

source: At least a basic understanding about mounting / unmounting and shell-scripts (execution)
it: Almeno una comprensione di base su montaggio/smontaggio e shell-scripts (esecuzione)

source: Phillips Screwdriver
it: Cacciavite a croce

source: Set up the ssh-access on your NextBox
it: Impostare l'accesso ssh sul tuo NextBox

source: The script which is used will acquire root rights to wipe the hard-drive you pass to the script. **Be extremely careful to pass the correct device to the script, if you pass your system partition, this script will destroy your runnning OS!** Any data on the passed hard-drive will inevitably be deleted!
it: Lo script che viene utilizzato acquisirà i diritti di root per cancellare l'hard disk che gli passerete. **Fate molta attenzione a passare il dispositivo corretto allo script, se passate la vostra partizione di sistema, questo script distruggerà il vostro sistema operativo in esecuzione!

source: Read the following steps completely and thoroughly **before executing them**, if you do not understand what a certain step means this might be an indication that you should not do this by yourself.
it: Leggete i seguenti passi completamente e accuratamente **prima di eseguirli**, se non capite cosa significa un certo passo potrebbe essere un'indicazione che non dovreste farlo da soli.

source: Prepare New Hard-Disk
it: Preparare il nuovo disco fisso

source: Get your ``nextbox.conf`` file from your original hard-disk using ssh, it is located on your NextBox inside the ``/srv/nextbox`` directory
it: Prendi il tuo ``nextbox.conf`` file dal tuo hard-disk originale usando ssh, si trova sul tuo NextBox dentro la ``/srv/nextbox`` directory

source: Save your ``nextbox.conf`` on your computer
it: Salva il tuo ``nextbox.conf`` sul tuo computer

source: Get the following script: https://raw.githubusercontent.com/Nitrokey/nextbox/master/simple_prepare_harddrive.sh
it: Prendi il seguente script: https://raw.githubusercontent.com/Nitrokey/nextbox/master/simple_prepare_harddrive.sh

source: Make the script executable: ``chmod +x simple_prepare_harddrive.sh``
it: Rendere lo script eseguibile: ``chmod +x simple_prepare_harddrive.sh``

source: Connect your new hard-disk to your computer
it: Collegare il nuovo hard-disk al computer

source: Determine your hard-disk's device name (e.g., ``/dev/sdb``) and make sure none of its partitions are mounted
it: Determinate il nome del vostro hard-disk (ad esempio, ``/dev/sdb``) e assicuratevi che nessuna delle sue partizioni sia montata

source: **Again: think at least twice about the following step. Make sure you are referring to the correct hard-drive device (and NOT a partition, means** ``/dev/sdb1`` **is wrong).** The script will decline to do the operation on ``/dev/sda`` as there are good chances this might be your system hard-disk, if you really need this you can comment out lines 23-26 inside the script.
it: **Di nuovo: pensate almeno due volte al passo seguente. Assicuratevi che vi state riferendo al dispositivo hard-drive corretto (e NON ad una partizione, significa** ``/dev/sdb1`` **è sbagliato).** Lo script rifiuterà di fare l'operazione su ``/dev/sda`` poiché ci sono buone probabilità che questo possa essere il vostro hard-disk di sistema, se ne avete davvero bisogno potete commentare le linee 23-26 all'interno dello script.

source: Run the script using the device name you have determined. Once prompted for your sudo-password please provide it to allow r/w access to the hard-drive:
it: Eseguite lo script usando il nome del dispositivo che avete determinato. Una volta richiesta la tua password sudo, forniscila per permettere l'accesso r/w al disco rigido:

source: Watch the script's output for any errors, there should be none
it: Guarda l'output dello script per eventuali errori, non ce ne dovrebbero essere

source: At the end of the script you will be asked to mount the created partition and copy over the ``nextbox.conf`` (to ``/nextbox``) you copied in step 1. and 2., unmount the partition and you have successfully prepared your new hard-drive.
it: Alla fine dello script ti verrà chiesto di montare la partizione creata e copiare il ``nextbox.conf`` (a ``/nextbox``) che hai copiato nei passi 1. e 2., smonta la partizione e hai preparato con successo il tuo nuovo hard-drive.

source: Replacement Guide
it: Guida alla sostituzione

source: Inside the NextBox Nextcloud App go to "System Settings" and switch it off your NextBox using the "Poweroff" button
it: All'interno dell'App NextBox Nextcloud vai a "Impostazioni di sistema" e spegni il tuo NextBox usando il pulsante "Poweroff".

source: Once the Status LED is shortly off (not entirely, thus very dark) and the Ethernet port LEDs are off you can unplug all cables from your NextBox
it: Una volta che il LED di stato è brevemente spento (non completamente, quindi molto scuro) e i LED della porta Ethernet sono spenti, è possibile scollegare tutti i cavi dal NextBox

source: Unscrew all 8 Phillips screws
it: Svitare tutte le 8 viti a croce

source: Carefully remove the top-cover (as vertical as possible) first
it: Rimuovere con attenzione la copertura superiore (il più verticale possibile) prima

source: Again carefully, vertically remove the bottom cover, now you see the so-called bridge
it: Di nuovo con attenzione, rimuovere verticalmente il coperchio inferiore, ora si vede il cosiddetto ponte

source: Unfold the USB-to-SATA cable and put the NextBox bridge upside down onto a electronics friendly surface like a desk as shown in the following image
it: Dispiegare il cavo USB-SATA e mettere il ponte NextBox a testa in giù su una superficie adatta all'elettronica come una scrivania, come mostrato nella seguente immagine

source: Unscrew the Phillips screws holding the hard-disk in position (the amount of screws may differ, depending on your hard-disk type) shown in the following image:
it: Svita le viti Phillips che tengono l'hard-disk in posizione (la quantità di viti può essere diversa, a seconda del tipo di hard-disk) mostrate nell'immagine seguente:

source: Once the screws are removed, push the hard-disk carefully towards the direction shown in the image above. Do not push it towards the other direction, you might damage the USB cable.
it: Una volta rimosse le viti, spingete l'hard-disk con attenzione verso la direzione mostrata nell'immagine qui sopra. Non spingerlo verso l'altra direzione, potresti danneggiare il cavo USB.

source: Remove the USB-to-SATA cable from the hard-drive
it: Rimuovere il cavo USB-SATA dal disco rigido

source: Avoid disconnecting the male-female USB connector to not change the position and bending of the cable. If you have to: be careful to keep the force as small as possible onto the 90° part of the USB extension cable.
it: Evitare di scollegare il connettore USB maschio-femmina per non cambiare la posizione e la piegatura del cavo. Se è necessario: fate attenzione a mantenere la forza più piccola possibile sulla parte a 90° del cavo di prolunga USB.

source: Connect your previously prepared new hard-drive
it: Collegate il vostro nuovo hard-drive precedentemente preparato

source: Carefully slide your new hard-drive into the bridge and fix it into the right position using the previously removed screws
it: Fate scivolare con attenzione il vostro nuovo hard-drive nel ponte e fissatelo nella giusta posizione usando le viti rimosse in precedenza

source: Fold the USB-to-SATA cable (in circles) into the open space behind the hard-disk.
it: Piegare il cavo USB-SATA (in cerchio) nello spazio aperto dietro l'hard-disk.

source: Finally assemble your NextBox again in reverse order using steps 5. to 3.
it: Infine, assemblate di nuovo il vostro NextBox in ordine inverso seguendo i passi da 5. a 3.

source: On first boot after the assembly, give the NextBox enough time to boot and get all necessary packages from the internet. **Make sure you have ethernet connected**. You should expect a changing status LED (yellow shall be first) quite fast (less than 2 minutes). If the status LED does not change at all, it is likely that there is something wrong with your hard-drive wiring or contents.
it: Al primo avvio dopo l'assemblaggio, dare al NextBox abbastanza tempo per avviarsi e ottenere tutti i pacchetti necessari da internet. **Assicurarsi di avere la connessione ethernet**. Ci si dovrebbe aspettare un LED di stato che cambia (il giallo deve essere il primo) abbastanza velocemente (meno di 2 minuti). Se il LED di stato non cambia affatto, è probabile che ci sia qualcosa di sbagliato nel cablaggio o nel contenuto dell'hard disk.

source: Troubleshooting
it: Risoluzione dei problemi
