Repository: DamienCassou/nitrokey-documentation
Catalog: locales/*/LC_MESSAGES/nextbox.po
Languages: it

source: Both USB Type-C ports are exclusively for power supply and can not be used for data transfer. Do not connect two power supplies, please just use one of both to power your NextBox.
it: Entrambe le porte USB Type-C sono esclusivamente per l'alimentazione e non possono essere utilizzate per il trasferimento dei dati. Non collegare due alimentatori, si prega di utilizzare solo uno dei due per alimentare il NextBox.

source: **Q:** Which fan should I install?
it: **Q:** Quale ventilatore dovrei installare?

source: **There is absolutely no need for a fan, the NextBox is designed to work without an active cooling**. Although if the NextBox is used for additional tasks (it's still a Linux), we have prepared a fan mount for a 30mm x 12mm fan at 5V connected to the shield. More details (connector, used pins) can be taken from `NextBox' GitHub`_. Currently we *do not* recommend adding a fan as the outputs are not controlled yet by the NextBox daemon, so this is also something you would have to do by yourself.
it: **Non c'è assolutamente bisogno di una ventola, il NextBox è progettato per funzionare senza un raffreddamento attivo**. Anche se se il NextBox viene utilizzato per compiti aggiuntivi (è ancora un Linux), abbiamo preparato un supporto per una ventola 30mm x 12mm a 5V collegata allo scudo. Maggiori dettagli (connettore, pin utilizzati) possono essere presi da `NextBox' GitHub`_. Attualmente *non* raccomandiamo di aggiungere una ventola poiché le uscite non sono ancora controllate dal demone di NextBox, quindi anche questo è qualcosa che dovreste fare da soli.

source: **Q:**: Can I upgrade the NextBox' RAM size?
it: **Q:**: Posso aggiornare la dimensione della RAM di NextBox?

source: No, the Raspberry PI 4B has the RAM component soldered onto the mainboard, thus it cannot be replaced/extended.
it: No, il Raspberry PI 4B ha il componente RAM saldato sulla scheda madre, quindi non può essere sostituito/esteso.

source: NextBox FAQ
it: FAQ di NextBox

source: **Q:** Why does Nitrokey currently not recommend to use OnlyOffice or Collabora Office on the NextBox?
it: **Q:** Perché Nitrokey attualmente non raccomanda di usare OnlyOffice o Collabora Office sul NextBox?

source: The state of these Nextcloud apps is not yet mature (for ARM platforms). Although it is (partly) possible to install them we do not recommend doing so currently.
it: Lo stato di queste app Nextcloud non è ancora maturo (per le piattaforme ARM). Anche se è (parzialmente) possibile installarle, non raccomandiamo di farlo attualmente.

source: **Q:** Why does updating Nextcloud from inside Nextcloud not work?
it: **Q:** Perché l'aggiornamento di Nextcloud da dentro Nextcloud non funziona?

source: The Nextcloud version is rolled out by us. Thus the option to update from inside Nextcloud is not working.
it: La versione Nextcloud viene distribuita da noi. Quindi l'opzione per aggiornare da dentro Nextcloud non funziona.

source: **Q:** Can I add apps to the Nextcloud instance?
it: **Q:** Posso aggiungere applicazioni all'istanza Nextcloud?

source: Yes, the Nextcloud app store is available and any app available there can be installed through the Nextcloud web frontend.
it: Sì, l'app store di Nextcloud è disponibile e qualsiasi app disponibile lì può essere installata attraverso il frontend web di Nextcloud.

source: **Q:** My Nextcloud instance is stuck in "Maintenance Mode", how can I switch it off?
it: **Q:** La mia istanza Nextcloud è bloccata in "Modalità manutenzione", come posso spegnerla?

source: To *force exit* the Nextcloud "Maintenance Mode", you can push the hardware button **shortly, once**. The NextBox will then switch-off the maintenance mode. Please avoid this, if possible.
it: Per *forzare l'uscita* dalla Nextcloud "Modalità di manutenzione", è possibile premere il pulsante hardware **brevemente, una volta**. Il NextBox spegnerà quindi la modalità di manutenzione. Si prega di evitare questo, se possibile.

source: **Q:** Why am I getting a permission warning for ``/var/www/html/custom_apps/nextbox`` inside the Nextcloud settings overview?
it: **Q:** Perché sto ricevendo un avviso di autorizzazione per ``/var/www/html/custom_apps/nextbox`` dentro la panoramica delle impostazioni Nextcloud?

source: This is a "feature". The NextBox Nextcloud App is installed on the system with the Debian nextbox package. To avoid an accidental deletion of the NextBox Nextcloud App from within the Nextcloud app management, the stated directory can not be written by Nextcloud, this is what Nextcloud is complaining about here.
it: Questa è una "caratteristica". La NextBox Nextcloud App è installata sul sistema con il pacchetto Debian nextbox. Per evitare una cancellazione accidentale della NextBox Nextcloud App dall'interno della gestione delle app Nextcloud, la directory indicata non può essere scritta da Nextcloud, questo è ciò di cui Nextcloud si lamenta qui.

source: **Q:** How can I run Nextcloud's `occ`?
it: **Q:** Come posso eseguire Nextcloud's `occ`?

source: As Nextcloud is running inside a Docker container, you need to be root and execute the following: ``docker exec -it -u www-data nextbox-compose_app_1 /var/www/html/occ``
it: Poiché Nextcloud è in esecuzione all'interno di un contenitore Docker, è necessario essere root ed eseguire quanto segue: ``docker exec -it -u www-data nextbox-compose_app_1 /var/www/html/occ``

source: **Q:** What to do about missing php-modules like `imagemagick`?
it: **Q:** Cosa fare per i moduli php mancanti come `imagemagick`?

source: Similar to Apache, PHP is also provided by the Nextcloud container, therefore as we are using the stock Nextcloud container this will also only be resolved once this is resolved by the Nextcloud Team.
it: Simile ad Apache, anche PHP è fornito dal contenitore Nextcloud, quindi dato che stiamo usando il contenitore Nextcloud stock anche questo sarà risolto solo una volta che questo sarà risolto dal Nextcloud Team.

source: **Q:** Why is my Nextcloud not loading properly, instead I get a white page and a `.htaccess` error?
it: **Q:** Perché il mio Nextcloud non si carica correttamente, invece ottengo una pagina bianca e un errore `.htaccess`?

source: This usually is an indication that the OS has unmounted/detached the internal hard-drive due to an low-power-incident. Please make sure you read and understood :ref:`USB power<faq-nextbox-hardware-usb-power-supply>`. In most cases doing a power-cycle (unplug the USB-C connector, wait 5secs and plug it in again) should resolve this. **Make sure no additional USB devices are connected during this procedure.**
it: Questo di solito è un'indicazione che il sistema operativo ha smontato/disconnesso l'hard-drive interno a causa di un incidente di bassa potenza. Assicurati di aver letto e compreso :ref:`USB power<faq-nextbox-hardware-usb-power-supply>`. Nella maggior parte dei casi fare un power-cycle (scollegare il connettore USB-C, aspettare 5sec e collegarlo di nuovo) dovrebbe risolvere il problema. **Assicurarsi che nessun altro dispositivo USB sia collegato durante questa procedura.

source: Remote Access FAQ
it: FAQ sull'accesso remoto

source: **Q:** What is the correct WebDAV URL?
it: **Q:** Qual è l'URL corretto di WebDAV?

source: The full URL to use for WebDAV is: ``https://my.domain.tld/remote.php/webdav/``, there have been reports that for native Windows WebDAV you might need: ``https://my.domain.tld/remote.php/dav/files/USERNAME`` with *USERNAME* being the username you would like to use.
it: L'URL completo da usare per WebDAV è: ``https://my.domain.tld/remote.php/webdav/``, ci sono stati rapporti che per il WebDAV nativo di Windows potrebbe essere necessario: ``https://my.domain.tld/remote.php/dav/files/USERNAME`` con *USERNAME* che è il nome utente che vorresti usare.

source: **Q:** Can I access my Nextcloud instance using WebDAV?
it: **Q:** Posso accedere alla mia istanza Nextcloud usando WebDAV?

source: Yes, please see `Nextcloud WebDAV documentation`_ for a complete overview. A simple mount for unix-like systems might look like this: ``mount -t davfs https://my.domain.tld/remote.php/webdav/ /mnt/target/path`` while making sure that the ``davfs2`` package is installed. For Windows please additionally read these :doc:`docs <../clients/windows>`.
it: Sì, si prega di vedere `la documentazione WebDAV di Nextcloud`_ per una panoramica completa. Un semplice montaggio per sistemi unix-like potrebbe assomigliare a questo: ``mount -t davfs https://my.domain.tld/remote.php/webdav/ /mnt/target/path`` assicurandosi che il pacchetto ``davfs2`` sia installato. Per Windows leggete anche questi :doc:`docs <../clients/windows>`.

source: **Q:**: Why does my Android smartphone's browser not open: ``http://nextbox.local``
it: **Q:**: Perché il browser del mio smartphone Android non si apre: ``http://nextbox.local``

source: As of today the technology needed to use ``.local`` URLs is not supported by various (stock) Android browser(s). The mechanism is based on ``mDNS``. One possible workaround is to use a 3rd party app like BonjourBrowser to discover all mDNS services in your network.
it: Ad oggi la tecnologia necessaria per utilizzare gli URL ``.local`` non è supportata da vari browser (stock) Android. Il meccanismo è basato su ``mDNS``. Un possibile workaround è quello di utilizzare un'applicazione di terze parti come BonjourBrowser per scoprire tutti i servizi mDNS nella vostra rete.

source: **Q:**: Why does accessing my NextBox using: ``http://nextbox.local`` not work?
it: **Q:**: Perché l'accesso al mio NextBox usando: ``http://nextbox.local`` non funziona?

source: There are several other reasons why the access using ``http://nextbox.local`` may not work, further known scenarios are:
it: Ci sono diverse altre ragioni per cui l'accesso usando ``http://nextbox.local`` potrebbe non funzionare, altri scenari conosciuti sono:

source: Using a Fritz!Box with the NextBox being connected via a LAN port and the client/browser is connected to the network via WiFI (WLAN), the Fritz!Box will block mDNS.
it: Utilizzando un Fritz!Box con il NextBox collegato tramite una porta LAN e il client/browser collegato alla rete tramite WiFI (WLAN), il Fritz!Box bloccherà mDNS.

source: **Q:**: I followed all guides and still cannot acquire the TLS certificate, what can I do?
it: **Q:**: Ho seguito tutte le guide e ancora non riesco ad acquisire il certificato TLS, cosa posso fare?

source: The reason a TLS certificate cannot be acquired is nearly always the fact that your NextBox is not reachable from the internet. Make sure you have followed the :doc:`../remote/walkthrough`. If you followed the step-by-step instructions and it still does not work, very likely something is blocking the connection, typical candidates are router web administration features like: ``MyFritz!``, ``Fritz Web Services`` or similar services, which are running on your router and thus blocking the traffic on port(s) 80 and/or 443. Switch them off and retry acquiring your TLS certificate.
it: La ragione per cui un certificato TLS non può essere acquisito è quasi sempre il fatto che il tuo NextBox non è raggiungibile da internet. Assicurati di aver seguito il :doc:`../remote/walkthrough`. Se hai seguito le istruzioni passo dopo passo e ancora non funziona, molto probabilmente qualcosa sta bloccando la connessione, i candidati tipici sono le funzioni di amministrazione web del router come: ``MyFritz!``, ``Fritz Web Services`` o servizi simili, che sono in esecuzione sul vostro router e quindi bloccano il traffico sulle porte 80 e/o 443. Spegneteli e riprovate ad acquisire il vostro certificato TLS.

source: **Q:** Why is my reachability with IPv4 not working?
it: **Q:** Perché la mia raggiungibilità con IPv4 non funziona?

source: If you have properly set up :doc:`port forwarding <../remote/port-forwarding>` and IPv4 connections (reachability test) are still not working there are good chances that your Internet-Service-Provider (ISP) does not provide a proper (public) IPv4 address to you. There are several (end-customer) internet technologies, which do not allow incoming traffic for the IPv4, which was assigned to you. An incomplete list is: *private IPv4 address*, *DS-Lite connection* or *CarrierGrade-NAT (CG-NAT)*. All these essentially share one IPv4 address accross multiple users, thus block (incoming) traffic from the internet to you. Some ISPs allow upgrading to so-called **full-stack connections**, which should enable full bi-directional traffic for IPv4 and IPv6.
it: Se avete impostato correttamente :doc:`port forwarding <../remote/port-forwarding>` e le connessioni IPv4 (test di raggiungibilità) non funzionano ancora ci sono buone possibilità che il vostro Internet-Service-Provider (ISP) non vi fornisca un indirizzo IPv4 adeguato (pubblico). Ci sono diverse tecnologie internet (clienti finali) che non permettono il traffico in entrata per l'IPv4 che ti è stato assegnato. Una lista incompleta è: *indirizzo IPv4 privato*, *connessione DS-Lite* o *CarrierGrade-NAT (CG-NAT)*. Tutti questi essenzialmente condividono un indirizzo IPv4 tra più utenti, bloccando così il traffico (in entrata) da internet verso di te. Alcuni ISP permettono di passare alle cosiddette **connessioni full-stack**, che dovrebbero permettere un traffico bidirezionale completo per IPv4 e IPv6.

source: **Q:** Why do some devices fail to connect for my IPv6 configured NextBox?
it: **Q:** Perché alcuni dispositivi non riescono a connettersi al mio NextBox configurato con IPv6?

source: Sadly, still not all ISPs and mobile-network providers (smartphones) do have full IPv6 support activated. This means, if your NextBox is configured for IPv6 only access, devices inside these networks will not be able to connect. The **backwards-proxy does work as a workaround here**, as it provides an IPv4 entrypoint to your NextBox independant of your other remote access configuration.
it: Purtroppo, non tutti gli ISP e i fornitori di reti mobili (smartphone) hanno ancora il pieno supporto IPv6 attivato. Ciò significa che se il tuo NextBox è configurato per l'accesso solo IPv6, i dispositivi all'interno di queste reti non saranno in grado di connettersi. Il **backwards-proxy funziona come un workaround qui**, in quanto fornisce un entrypoint IPv4 al tuo NextBox indipendentemente dalla tua altra configurazione di accesso remoto.

source: Software FAQ
it: FAQ sul software

source: **Q:** What kind of public key is expected for SSH access?
it: **Q:** Che tipo di chiave pubblica è prevista per l'accesso SSH?

source: An openssh style (public) key is expected. Depending on your operating system there are different ways to determine your public key. One might be ``ssh-add -L``, another might be ``cat ~/.ssh/id_rsa.pub``. If you are using Putty, please see the `Putty documentation`_.
it: Ci si aspetta una chiave (pubblica) in stile openssh. A seconda del sistema operativo ci sono diversi modi per determinare la chiave pubblica. Uno potrebbe essere ``ssh-add -L``, un altro potrebbe essere ``cat ~/.ssh/id_rsa.pub``. Se state usando Putty, consultate la `documentazione di Putty`_.

source: **Q:** Can the operating system be extended or configured manually?
it: **Q:** Il sistema operativo può essere esteso o configurato manualmente?

source: Yes, you can set up ssh access through the NextBox Nextcloud app. Afterwards you can access your NextBox using ssh and you can do with the system whatever you want. Obviously we will only provide support for the NextBox stock configuration.
it: Sì, è possibile impostare l'accesso ssh attraverso l'applicazione NextBox Nextcloud. In seguito potrai accedere al tuo NextBox usando ssh e potrai fare con il sistema quello che vuoi. Ovviamente forniremo supporto solo per la configurazione stock di NextBox.

source: **Q:** Where can I see a changelog for the NextBox versions?
it: **Q:** Dove posso vedere un changelog per le versioni di NextBox?

source: Currently only here: `Launchpad NextBox`_
it: Attualmente solo qui: `Launchpad NextBox`_

source: **Q:** How can I update the Operating System?
it: **Q:** Come posso aggiornare il sistema operativo?

source: There is no need to update the NextBox OS by hand. This is done using ``unattended-upgrades`` and on top the *nextbox-daemon* will check for upgrades manually (as a redundant fallback solution) on every start. You are free to update your OS by hand using ``apt``, if you know what you are doing.
it: Non c'è bisogno di aggiornare il sistema operativo NextBox a mano. Questo viene fatto usando ``unattended-upgrades`` e sopra il *nextbox-daemon* controllerà gli aggiornamenti manualmente (come soluzione di ripiego ridondante) ad ogni avvio. Siete liberi di aggiornare il vostro sistema operativo a mano usando ``apt``, se sapete cosa state facendo.

source: **Q:** Is the NextBox running a 32bit or 64bit operating system?
it: **Q:** Il NextBox ha un sistema operativo a 32bit o 64bit?

source: The used OS is a 64bit system. The ``arch`` output: `aarch64`.
it: Il sistema operativo usato è un sistema a 64 bit. L'output ``arch``: `aarch64`.

source: **Q:** Which users and default passwords are created by default on the NextBox's operating system?
it: **Q:** Quali utenti e password di default sono creati di default sul sistema operativo di NextBox's?

source: There is not one single default password set on any (system) user. The only non-system user created is named ``nextuser``, without a default password. The only way to access the NextBox is using ``ssh`` with a public key, which can be set via the NextBox App.
it: Non c'è una sola password di default impostata su nessun utente (di sistema). L'unico utente non di sistema creato si chiama ``nextuser``, senza una password predefinita. L'unico modo per accedere a NextBox è usare ``ssh`` con una chiave pubblica, che può essere impostata tramite la NextBox App.

source: Getting Started
it: Come iniziare

source: Connect NextBox to your Internet router via network cable.
it: Collegare NextBox al router Internet tramite il cavo di rete.

source: Connect the power cable to the NextBox, you can use any of the two USB-C ports.
it: Collegare il cavo di alimentazione al NextBox, è possibile utilizzare una qualsiasi delle due porte USB-C.

source: Once powered the NextBox will start
it: Una volta alimentato, NextBox si avvia

source: Wait approx. 5 minutes and open "http://nextbox.local" in your web browser - this duration may vary. The NextBox is ready once the LED is constantly green (see :doc:`LEDs <technical/led-colors>`).
it: Attendere circa 5 minuti e aprire "http://nextbox.local" nel browser web - questa durata può variare. Il NextBox è pronto quando il LED è costantemente verde (vedi :doc:`LEDs <technical/led-colors>`).

source: External storage drives without an external power supply must NOT be connected to the USB sockets. Otherwise, this can lead to data loss on the internal hard disk. **Always use external storage drives with a seperate power supply together with the NextBox.**
it: Le unità di memorizzazione esterne senza alimentazione esterna NON devono essere collegate alle prese USB. In caso contrario, questo può portare alla perdita di dati sull'hard disk interno. **Utilizzare sempre unità di archiviazione esterne con un'alimentazione separata insieme al NextBox.

source: Create Admin Account
it: Creare un account Admin

source: Enter your desired username and password. Remember to choose a strong password for your admin account.
it: Inserisci il tuo nome utente e la password desiderati. Ricordati di scegliere una password forte per il tuo account di amministratore.

source: Press "Finish Setup". This process may take a few minutes.
it: Premi "Finish Setup". Questo processo può richiedere alcuni minuti.

source: Configure NextBox Related Features
it: Configurare le caratteristiche di NextBox

source: The NextBox comes with Nextcloud App to realize various configurations (e.g., :doc:`backup-restore` or :doc:`Remote Access<remote/index>`) and operations for your NextBox.
it: La NextBox viene fornita con Nextcloud App per realizzare varie configurazioni (ad esempio, :doc:`backup-restore` o :doc:`Remote Access<remote/index>`) e operazioni per la tua NextBox.

source: Your can find the NextBox-App in Nextcloud's top level navigation, as shown in this figure:
it: Puoi trovare la NextBox-App in Nextcloud nella navigazione di livello superiore, come mostrato in questa figura:

source: Ready To Go
it: Pronto a partire

source: This is all it takes to get started with your NextBox. From this point you are free to choose how you would like to make the best use of your personal Nextcloud-powered cloud. To get you started, here is a collection of ideas to continue on:
it: Questo è tutto ciò che serve per iniziare con il tuo NextBox. Da questo punto sei libero di scegliere come utilizzare al meglio il tuo cloud personale alimentato da Nextcloud. Per iniziare, ecco una raccolta di idee per continuare:

source: **Set up remote access for your NextBox** to allow access to your private cloud from the internet. Our :doc:`guide <remote/index>` covers various approaches.
it: **Impostare l'accesso remoto per il tuo NextBox** per consentire l'accesso al tuo cloud privato da internet. La nostra :doc:`guida <remote/index>` copre vari approcci.

source: We prepared a *one-click* remote access method, allowing you to set up basic remote access in seconds.
it: Abbiamo preparato un metodo di accesso remoto *one-click*, che vi permette di impostare l'accesso remoto di base in pochi secondi.

source: **Connect your devices to your NextBox.** For smartphones the official `Android App`_ and `iOS App`_ are both great additions for your personal cloud. Apart from these there are also `Windows, macOS, Linux clients`_ available, which integrate seamlessly into the OS of your choice. For Android smartphones you might want to read our pictured :doc:`guide <clients/android>`.
it: **Per gli smartphone l'applicazione ufficiale `Android App`_ e `iOS App`_ sono entrambe ottime aggiunte per il tuo cloud personale. Oltre a questi ci sono anche `client Windows, macOS, Linux`_ disponibili, che si integrano perfettamente nel sistema operativo di vostra scelta. Per gli smartphone Android potresti voler leggere la nostra illustrata :doc:`guida <clients/android>`.

source: **Browse the vast amount of apps** for your Nextcloud at the `official store`_ for Nextcloud apps. Alternatively, just browse, find and install directly from within your NextBox via the built-in app manager and browser.
it: **Sfogliate la vasta quantità di app** per il vostro Nextcloud al ` negozio ufficiale`_ per le app Nextcloud. In alternativa, basta sfogliare, trovare e installare direttamente dall'interno del tuo NextBox tramite l'app manager e il browser integrati.

source: **Extend your Dashboard** using the various `Dashboard Integrations`_ to create your personal information hub.
it: **Estendi la tua Dashboard** utilizzando le varie `Integrazioni Dashboard`_ per creare il tuo hub di informazioni personali.

source: **Share photos, documents, any files, bookmarks and much more with your family and friends**, or become part of a `Federation`_ and share, communicate and collaborate with other Nextcloud users.
it: **Condividi foto, documenti, qualsiasi file, segnalibri e molto altro con la tua famiglia e gli amici**, o diventa parte di una `Federazione`_ e condividi, comunica e collabora con altri utenti Nextcloud.
