Repository: DamienCassou/nitrokey-documentation
Catalog: locales/*/LC_MESSAGES/nextbox.po
Languages: it

source: Backup and Restore
it: Backup e ripristino

source: The NextBox can be backupped and restored from within the NextBox Nextcloud App. In order to execute a backup or restore operation you need to have a storage device attached to your NextBox.
it: È possibile eseguire il backup e il ripristino di NextBox dall'App Nextcloud di NextBox. Per eseguire un'operazione di backup o di ripristino, è necessario disporre di un dispositivo di memorizzazione collegato al NextBox.

source: To enable backup and restore onto a storage device please follow these steps:
it: Per abilitare il backup e il ripristino su un dispositivo di archiviazione, segui questi passi:

source: Make sure your storage device contains at least one partition formatted with a supported file-system (currently *ext* and *xfs* are supported).
it: Assicurati che il tuo dispositivo di archiviazione contenga almeno una partizione formattata con un file system supportato (attualmente sono supportati *ext* e *xfs*).

source: Attach the storage device to your NextBox to any of the USB ports and *remember to use an external power supply* (:ref:`more information<usb-power-supply>`)
it: Collega il dispositivo di archiviazione al tuo NextBox a una qualsiasi delle porte USB e *ricordati di usare un alimentatore esterno* (:ref:`più informazioni<usb-power-supply>`)

source: Once attached you will see the storage(s) inside "Storage Management" below "Available Storages"
it: Una volta collegato, vedrai il/i magazzino/i all'interno di "Storage Management" sotto "Available Storages"

source: Click on the plus-symbol on the right side to *mount* your storage and make it available for backup and restore operations. The added storage is now listed inside "Mounted Storages".
it: Fai clic sul simbolo più a destra per *montare* il tuo archivio e renderlo disponibile per le operazioni di backup e ripristino. Lo spazio di archiviazione aggiunto è ora elencato in "Archivi montati".

source: To backup your NextBox including all Nextcloud settings apps and data please follow these steps:
it: Per eseguire il backup di NextBox, comprese tutte le app e i dati delle impostazioni Nextcloud, segui questi passi:

source: Make sure you have a storage mounted as described above
it: Assicuratevi di avere un magazzino montato come descritto sopra

source: Inside "Backup / Restore" below "Full System Backup" select the storage device for backup from the drop-down menu named: "Select Backup Device"
it: All'interno di "Backup / Restore" sotto "Full System Backup" seleziona il dispositivo di archiviazione per il backup dal menu a discesa chiamato: "Select Backup Device"

source: Now you have the option to incrementally update an existing backup from the drop-down menu named: "Select Backup Location" **or** create a entirely new backup by entering a name into the "Name of the new backup" entry field.
it: Ora hai l'opzione di aggiornare incrementalmente un backup esistente dal menu a discesa chiamato: "Select Backup Location" **o** creare un backup completamente nuovo inserendo un nome nel campo di inserimento "Name of the new backup".

source: Click "Start Backup now", the backup process will begin immediately.
it: Clicca su "Start Backup now", il processo di backup inizierà immediatamente.

source: The resulting backup is not encrypted so take care who has access to the used storage.
it: Il backup risultante non è criptato, quindi fate attenzione a chi ha accesso all'archivio utilizzato.

source: Restore
it: Ripristinare

source: The restore operation replaces the Nextcloud internals entirely and depending on the version combination this might lead to undefined behavior of the Nextcloud frontend. If this happens, please be patient and reload the page using ``F5`` or ``ctrl-r`` and check, if the restore operation was successful.
it: L'operazione di ripristino sostituisce interamente gli interni di Nextcloud e a seconda della combinazione di versioni questo potrebbe portare a un comportamento non definito del frontend di Nextcloud. Se questo accade, sii paziente e ricarica la pagina usando ``F5`` o ``ctrl-r`` e controlla se l'operazione di ripristino ha avuto successo.

source: Make sure your have a storage mounted as described above and it contains a backup to be restored
it: Assicuratevi di avere una memoria montata come descritto sopra e che contenga un backup da ripristinare

source: Inside "Backup / Restore" below "Restore System from Backup" use the "Select Backup to Restore" drop-down menu to select a backup to be restored
it: All'interno di "Backup / Restore" sotto "Restore System from Backup" usa il menu a discesa "Select Backup to Restore" per selezionare un backup da ripristinare

source: Click "Start Restoring now", the restore process will begin immediately.
it: Clicca su "Start Restoring now", il processo di ripristino inizierà immediatamente.

source: Depending on the backupped Nextcloud version after the restore process you will be asked to run the upgrade process for Nextcloud.
it: A seconda della versione di Nextcloud backuppata, dopo il processo di ripristino ti verrà chiesto di eseguire il processo di aggiornamento per Nextcloud.

source: All configurations and settings of the NextBox and the Nextcloud instance will be restored, thus there might be changes on how you access your NextBox, if the restored Remote Access configuration is not identical to the current one.
it: Tutte le configurazioni e le impostazioni della NextBox e dell'istanza Nextcloud saranno ripristinate, quindi potrebbero esserci dei cambiamenti su come si accede alla NextBox, se la configurazione di accesso remoto ripristinata non è identica a quella attuale.

source: Connect Your Android or iOS Smartphone
it: Collega il tuo smartphone Android o iOS

source: Connect the NextBox with your smartphone
it: Collega il NextBox con il tuo smartphone

source: Download the Nextcloud app from the app store or play store.
it: Scarica l'app Nextcloud dall'app store o dal play store.

source: Cick on "Sign in".
it: Clicca su "Accedi".

source: Enter your domain.
it: Inserisci il tuo dominio.

source: Enter your username and password and click "Log in".
it: Inserisci il tuo nome utente e la tua password e clicca su "Log in".

source: Now you have access to your NextBox with your smartphone!
it: Ora puoi accedere alla tua NextBox con il tuo smartphone!

source: Connect Devices
it: Collegare i dispositivi

source: Choose your operating system or device:
it: Scegli il tuo sistema operativo o dispositivo:

source: Connect Your Linux Computer
it: Collegare il computer Linux

source: Connect using the Nextcloud App
it: Connettersi usando l'App Nextcloud

source: Download the client application from: https://nextcloud.com/install/
it: Scarica l'applicazione client da: https://nextcloud.com/install/

source: Most distributions do provide the Nextcloud client via their package managers. (e.g., Ubuntu, Arch Linux, Mint, ...)
it: La maggior parte delle distribuzioni forniscono il client Nextcloud tramite i loro gestori di pacchetti. (ad esempio, Ubuntu, Arch Linux, Mint, ...)

source: After starting the ``nextcloud`` application, you will find it as a tray icon.
it: Dopo aver avviato l'applicazione ``nextcloud``, la troverete come icona nella barra delle applicazioni.

source: Add an account using your public server url, username and password. Further you can choose the target directory the files should be synced to.
it: Aggiungi un account utilizzando l'url del tuo server pubblico, il nome utente e la password. Inoltre puoi scegliere la directory di destinazione su cui sincronizzare i file.

source: Connect using WebDAV
it: Connettersi usando WebDAV

source: Mounting Nextcloud using WebDAV can be done directly via most file managers, by adding a "remote server".
it: Il montaggio di Nextcloud usando WebDAV può essere fatto direttamente tramite la maggior parte dei file manager, aggiungendo un "server remoto".

source: Additionally you can mount your Nextcloud files using WebDAV via commandline and `/etc/fstab` by installing the `davfs2` package.
it: Inoltre potete montare i vostri file Nextcloud usando WebDAV via riga di comando e `/etc/fstab` installando il pacchetto `davfs2`.

source: To mount use:
it: Per montare usare:

source: Connect your Mac Commputer
it: Collega il tuo computer Mac

source: Download the Nextcloud client application: https://nextcloud.com/install/
it: Scarica l'applicazione client Nextcloud: https://nextcloud.com/install/

source: After installation, click "Log in to your Nextcloud". Afterwards please provide your Nextcloud's domain.
it: Dopo l'installazione, clicca su "Accedi al tuo Nextcloud". In seguito si prega di fornire il vostro Nextcloud'dominio.

source: Provide your username and password and click "Log in".
it: Fornisci il tuo nome utente e la tua password e clicca su "Log in".

source: Inside the menu bar there will be a Nextcloud icon to open the Nextcloud application settings.
it: All'interno della barra dei menu ci sarà un'icona Nextcloud per aprire le impostazioni dell'applicazione Nextcloud.

source: Inside *Finder* below "favorites" you will find a "Nextcloud" directory with the user's files.
it: All'interno di *Finder* sotto i "preferiti" troverete una "Nextcloud" directory con i file dell'utente.

source: Inside *Finder*, open *Go* and choose *Connect to Server*
it: In *Finder*, apri *Go* e scegli *Connetti al server*

source: Provide the WebDAV URL `https://yourdomain.xyz/remote.php/webdav`
it: Fornire l'URL WebDAV `https://yourdomain.xyz/remote.php/webdav`.

source: In the next step, provide the username and password to login to your Nextcloud instance.
it: Nel passo successivo, fornisci il nome utente e la password per accedere alla tua istanza Nextcloud.

source: Once finished you can find your Nextcloud files in *Locations*.
it: Una volta finito, puoi trovare i tuoi file Nextcloud in *Locazioni*.

source: Inside the tray there will be a Nextcloud icon to open the Nextcloud application settings.
it: Nel vassoio ci sarà un'icona Nextcloud per aprire le impostazioni dell'applicazione Nextcloud.

source: Inside the file-explorer you can now find your Nextcloud instance files.
it: All'interno del file-explorer puoi ora trovare i file della tua istanza Nextcloud.

source: There have been reports that the native WebDAV support in Windows is not performing well. We recommend using the Nextcloud App (as described above) for the best user experience. Additionally please read `Nextcloud's Windows WebDAV Known Problems`_.
it: Ci sono state segnalazioni che il supporto WebDAV nativo in Windows non funziona bene. Raccomandiamo di usare l'App Nextcloud (come descritto sopra) per la migliore esperienza utente. Inoltre si prega di leggere `Nextcloud's Windows WebDAV Known Problems`_.

source: Add a WebDAV drive using the file explorer's "Add a network location" icon. (You can also use "Map network drive" to bind your Nextcloud to a drive, like *Z:*).
it: Aggiungete un'unità WebDAV usando l'icona "Aggiungi una posizione di rete" di File Explorer. (Puoi anche usare "Mappa unità di rete" per legare il tuo Nextcloud a un'unità, come *Z:*).

source: In the following dialog please enter the full WebDAV address of your NextBox: ``https://my.domain.tld/remote.php/dav/files/USERNAME``. Replace *my.domain.tld* with your NextBox's public domain and *USERNAME* with the username you would like to connect.
it: Nella seguente finestra di dialogo inserisci l'indirizzo WebDAV completo del tuo NextBox: ``https://my.domain.tld/remote.php/dav/files/USERNAME``. Sostituire *my.domain.tld* con il dominio pubblico di NextBox e *USERNAME* con il nome utente che si desidera collegare.

source: In the following window insert your full Nextcloud credentials, means your username and password you use to login into your Nextcloud.
it: Nella finestra seguente inserisci le tue credenziali complete di Nextcloud, cioè il tuo nome utente e la password che usi per accedere al tuo Nextcloud.

source: Now your files from your Nextcloud instance are accessible via the file-explorer.
it: Ora i tuoi file dalla tua istanza Nextcloud sono accessibili tramite il file-explorer.

source: Generic FAQ
it: FAQ generiche

source: **Q:** How can I factory-reset my NextBox?
it: **Q:** Come posso resettare in fabbrica il mio NextBox?

source: Press the hardware button for 5 seconds, see :doc:`../technical/factory-reset`. To press the button use a thin (~1mm) pin like a smartphone sim-card tray removal device.
it: Premere il pulsante hardware per 5 secondi, vedi :doc:`../tecnico/factory-reset`. Per premere il pulsante usa un perno sottile (~1mm) come un dispositivo di rimozione del vassoio della sim-card di uno smartphone.

source: **Q:** What do the different LED colors mean?
it: **Q:** Cosa significano i diversi colori del LED?

source: The detailed document can be found here: :doc:`../technical/led-colors`
it: Il documento dettagliato può essere trovato qui: :doc:`../technical/led-colors`.

source: **Q:** Can the inital setup be done using a monitor & keyboard?
it: **Q:** Il setup iniziale può essere fatto usando un monitor e una tastiera?

source: No, this is not possible as the regular login is disabled on delivery. Please connect the the NextBox to a network and access the NextBox using `nextbox.local`_ or the IP directly.
it: No, questo non è possibile in quanto il normale login è disabilitato alla consegna. Si prega di collegare la NextBox a una rete e accedere alla NextBox utilizzando `nextbox.local`_ o direttamente l'IP.

source: **Q:** What is the typical power consumption?
it: **Q:** Qual è il tipico consumo di energia?

source: The minimum of 0,6A (3W) is rarely reached, in idle mostly around 1A (5W) and more than 2A (10W) under higher loads.
it: Il minimo di 0,6A (3W) è raramente raggiunto, in idle per lo più intorno a 1A (5W) e più di 2A (10W) sotto carichi più elevati.

source: **Q:** How secure is the NextBox?
it: **Q:** Quanto è sicuro il NextBox?

source: Debian with frequent `unattended-upgrades` based security updates, a minimal attack surface by ensuring that not a single unneccessary port is open are the main contributors to system security. **Make sure your Nextcloud users and passwords are on a high level, either with long-random passwords or a 2-Factor-Authentification supported login method with e.g., a Nitrokey FIDO2.**
it: Debian con frequenti aggiornamenti di sicurezza basati su `unattended-upgrades`, una superficie di attacco minima assicurando che non una singola porta non necessaria sia aperta sono i principali contributi alla sicurezza del sistema. **Assicuratevi che i vostri utenti e le password di Nextcloud siano di alto livello, sia con password lunghe e casuali, sia con un metodo di login supportato da 2 fattori di autenticazione, ad esempio Nitrokey FIDO2.

source: **Q:** What do all the ssh-related "warnings" mean?
it: **Q:** Cosa significano tutti gli "avvertimenti" relativi a ssh?

source: Once you set up your ssh-access, you make yourself technically responsible for your NextBox. We do provide help as good as we can as goodwill, but under the line we cannot provide generic Linux-administration support outside of the intended NextBox use-cases.
it: Una volta impostato l'accesso ssh, ti rendi tecnicamente responsabile del tuo NextBox. Forniamo aiuto per quanto possibile come buona volontà, ma sotto la linea non possiamo fornire supporto generico di amministrazione di Linux al di fuori dei casi d'uso previsti per NextBox.

source: **Q:** Can I mirror my NextBox onto another NextBox?
it: **Q:** Posso fare il mirroring del mio NextBox su un altro NextBox?

source: This translates to a cluster setup, which is considered an (paid) enterprise solution by Nextcloud. The details, especially data consistency and collision handling, are far from trivial to realize. Nevertheless, we also see demand for more sophisticated backup solutions and will address this issue.
it: Questo si traduce in una configurazione di cluster, che è considerata una soluzione enterprise (a pagamento) da Nextcloud. I dettagli, in particolare la consistenza dei dati e la gestione delle collisioni, sono tutt'altro che banali da realizzare. Tuttavia, vediamo anche la domanda di soluzioni di backup più sofisticate e affronteremo questo problema.

source: **Q:** What to do to run/install/fix Nextcloud App "XYZ"? Why does Nextcloud feature XYZ not work?
it: **Q:** Cosa fare per eseguire/installare/riparare Nextcloud App "XYZ"? Perché la funzione XYZ di Nextcloud non funziona?

source: Generally we cannot help in detail for these topics. Nextcloud internals and apps are out-of-scope for the NextBox development as we use the stock Docker images provided by Nextcloud. Ultimately, if some NextBox/OS configuration is blocking an app to run properly we for sure will look into fixing it.
it: Generalmente non possiamo aiutare in dettaglio per questi argomenti. Gli interni di Nextcloud e le app sono fuori portata per lo sviluppo di NextBox, poiché usiamo le immagini Docker stock fornite da Nextcloud. In definitiva, se qualche configurazione di NextBox/OS sta bloccando l'esecuzione corretta di un'app, di sicuro cercheremo di risolverla.

source: **Q:** Can I connect/use the NextBox using WiFi?
it: **Q:** Posso collegare/utilizzare il NextBox usando il WiFi?

source: No, currently this is not (easily) possible, only wired ethernet using RJ-45 is available.
it: No, attualmente questo non è (facilmente) possibile, solo l'ethernet cablato con RJ-45 è disponibile.

source: **Q:** Is the WiFi on the Raspberry PI 4B physically available and working?
it: **Q:** Il WiFi sul Raspberry PI 4B è fisicamente disponibile e funzionante?

source: Yes, physically the WiFi is available and working, but not used/managed by the NextBox App. If you know what you are doing you can configure and use it, if works although being inside the NextBox casing.
it: Sì, fisicamente il WiFi è disponibile e funzionante, ma non utilizzato/gestito dall'App NextBox. Se sai cosa stai facendo puoi configurarlo e usarlo, se funziona pur essendo all'interno dell'involucro NextBox.

source: Hardware FAQ
it: FAQ sull'hardware

source: **Q:** Why must I not connect external hard-drives without an external power-supply to my NextBox?
it: **Q:** Perché non devo collegare al mio NextBox degli hard-drive esterni senza un'alimentazione esterna?

source: The Raspberry Pi 4 Model B can only supply 1.2A of power through USB (see `RPi Power Supply`_). The internal hard-drive is already connected and powered via USB and pulls ~1.0A. Thus connecting another hard-drive without an external power supply can lead to an unreliable power supply for the internal hard-drive, thus potential data loss.
it: Il Raspberry Pi 4 Model B può fornire solo 1.2A di potenza tramite USB (vedi `RPi Power Supply`_). L'hard-drive interno è già collegato e alimentato via USB e tira ~1.0A. Quindi collegare un altro hard-drive senza un'alimentazione esterna può portare ad un'alimentazione inaffidabile per l'hard-drive interno, quindi ad una potenziale perdita di dati.

source: **Q:** Where can I find an external hard-drive with its own power supply?
it: **Q:** Dove posso trovare un hard-drive esterno con un proprio alimentatore?

source: The smaller form factors (2.5'' and smaller) for external hard-drives mostly come without an additional power supply. For these, *a USB Hub with an additional power supply can be considered the "external power-supply"* for the hard-drive. Although the latter is it not 100% sure for powered USB hubs, thus we recommend external 3.5'' hard-drives, which are nearly always externally powered.
it: I fattori di forma più piccoli (2.5'' e più piccoli) per gli hard-drive esterni vengono per lo più senza un'alimentazione addizionale. Per questi, *un hub USB con un'alimentazione addizionale può essere considerato l'"alimentazione esterna"* per l'hard-drive. Anche se quest'ultimo non è sicuro al 100% per gli hub USB alimentati, quindi raccomandiamo gli hard-drive esterni da 3.5'', che sono quasi sempre alimentati esternamente.

source: **Q:** Why does my USB device / hub not work, if connected to the NextBox?
it: **Q:** Perché il mio dispositivo/ hub USB non funziona, se collegato a NextBox?

source: There are some devices and especially USB3 hubs that are known to not work properly with the Raspberry PI 4B, please see this `USB Documentation`_ from Raspberry. On top of that also make sure the USB device is working in general by connecting it to another computer (best case: Linux) and verify that it works.
it: Ci sono alcuni dispositivi e soprattutto hub USB3 che sono noti per non funzionare correttamente con il Raspberry PI 4B, si prega di vedere questa `Documentazione USB`_ di Raspberry. Oltre a questo assicuratevi anche che il dispositivo USB stia funzionando in generale collegandolo ad un altro computer (caso migliore: Linux) e verificate che funzioni.

source: **Q:** Why does my hard-drive not show up after plugging it in?
it: **Q:** Perché il mio hard-drive non appare dopo averlo collegato?

source: Please make sure that you are using one of the supported filesystems (e.g., ext, xfs) and you have mounted your hard-drive within *Storage Management*.
it: Assicurati di usare uno dei filesystem supportati (per esempio, ext, xfs) e di aver montato il tuo hard-drive in *Storage Management*.

source: **Q:** Can I generally extend the NextBox using a USB hard-drive?
it: **Q:** Posso generalmente estendere il NextBox usando un hard-drive USB?

source: Yes, this is possible, please make sure you are using a hard-drive, which has an external power supply. Once connected you can mount the hard-drive using the NextBox *Storage Management* and include it into Nextcloud file-management using the `External storage support`_ app.
it: Sì, questo è possibile, assicurati di usare un hard-drive che abbia un'alimentazione esterna. Una volta collegato, è possibile montare l'hard-drive usando il NextBox *Storage Management* e includerlo nel Nextcloud file-management usando l'applicazione `External storage support`_.

source: **Q:** What functions does the additional "shield" provide?
it: **Q:** Quali funzioni fornisce lo "scudo"aggiuntivo?

source: As of now the shield does provide a :doc:`status LED <../technical/led-colors>`, a hardware button to :doc:`factory reset <../technical/factory-reset>` and an additional USB Type-C connector on the same side as the Ethernet port for power supply exclusively.
it: Per ora lo shield fornisce un :doc:`LED di stato <../technical/led-colors>`, un pulsante hardware per :doc:`ripristino di fabbrica <../technical/factory-reset>` e un ulteriore connettore USB Type-C sullo stesso lato della porta Ethernet per l'alimentazione esclusivamente.

source: **Q:** Is the NextBox hardware extendable/replaceable?
it: **Q:** L'hardware di NextBox è estendibile/sostituibile?

source: Yes, all NextBox components can be easily replaced. None of the components are glued or somehow permanently assembled. Using a Phillips screwdriver you can disassemble and re-assemble the NextBox easily. Keep in mind that you are doing this at your own risk.
it: Sì, tutti i componenti di NextBox possono essere facilmente sostituiti. Nessuno dei componenti è incollato o in qualche modo assemblato in modo permanente. Usando un cacciavite Phillips è possibile smontare e rimontare NextBox facilmente. Tieni presente che lo stai facendo a tuo rischio e pericolo.

source: **Q:** What are the two USB Type-C ports used for?
it: **Q:** A cosa servono le due porte USB Type-C?
