Repository: DamienCassou/nitrokey-documentation
Catalog: locales/*/LC_MESSAGES/nextbox.po
Languages: it

source: Provides transport encryption between your clients and your NextBox. But with the drawback that it is not End-To-End encrypted, means the traffic will be decrypted at the Nitrokey Proxy Server and passed onward with another encryption. Thus a compromised proxy server might allow access to your traffic to the potential attacker.
it: Fornisce la crittografia di trasporto tra i tuoi clienti e il tuo NextBox. Ma con l'inconveniente che non è crittografato End-To-End, significa che il traffico sarà decifrato al Proxy Server Nitrokey e passato avanti con un'altra crittografia. Così un server proxy compromesso potrebbe permettere l'accesso al vostro traffico al potenziale attaccante.

source: The proxy server is a bottleneck and all traffic has to go through the proxy server, even if you are in a local network together with the NextBox the traffic has to go through the proxy server.
it: Il server proxy è un collo di bottiglia e tutto il traffico deve passare attraverso il server proxy, anche se sei in una rete locale insieme al NextBox il traffico deve passare attraverso il server proxy.

source: Data path (local client): [NextBox] ⟷ [Router]⟷ [Proxy Server] ⟷ [Router] ⟷ [Client]
it: Percorso dati (client locale): [NextBox] ⟷ [Router]⟷ [Proxy Server] ⟷ [Router] ⟷ [Client]

source: Data path (remote client): [NextBox] ⟷ [Router]⟷ [Proxy Server] ⟷ [Client]
it: Percorso dati (client remoto): [NextBox] ⟷ [Router]⟷ [Proxy Server] ⟷ [Client]

source: **Pro:** easy to setup, good transport security
it: **Pro:** facile da configurare, buona sicurezza nel trasporto

source: **Contra:** not strictly end-to-end encrypted, potentially slow (all traffic through the proxy)
it: **Contra:** non strettamente crittografato end-to-end, potenzialmente lento (tutto il traffico attraverso il proxy)

source: Non end-to-end encrypted does still mean all your traffic is indeed encrypted, but within the proxy server, in order to be forwarded the traffic will be decrypted once and encrypted again before being passed to the client or NextBox
it: Non end-to-end encrypted significa ancora che tutto il tuo traffico è effettivamente criptato, ma all'interno del server proxy, per essere inoltrato il traffico sarà decriptato una volta e criptato di nuovo prima di essere passato al client o a NextBox

source: Port Forwarding & Firewall Configuration
it: Port Forwarding & configurazione del firewall

source: You have your dynamic DNS correctly set up, but your NextBox is not reachable using the domain.
it: Hai impostato correttamente il tuo DNS dinamico, ma il tuo NextBox non è raggiungibile utilizzando il dominio.

source: Before looking into this topic, make sure your domain correctly resolves to your IP.
it: Prima di approfondire questo argomento, assicurati che il tuo dominio si risolva correttamente al tuo IP.

source: For both IPv4 and IPv6 you need to properly configure your internet router to allow access to your NextBox. While most internet routers will refer to this configuration as *port forwarding*, in fact IPv4 based (dynamic) DNS will resolve to your router's IP. But IPv6 in contrast will resolve to a (globally) unique IP, which refers to your NextBox.
it: Sia per IPv4 che per IPv6 è necessario configurare correttamente il router internet per consentire l'accesso a NextBox. Mentre la maggior parte dei router internet si riferisce a questa configurazione come *port forwarding*, in realtà il DNS basato su IPv4 (dinamico) si risolverà all'IP del router. Ma IPv6 al contrario si risolverà a un IP unico (a livello globale), che si riferisce al tuo NextBox.

source: Therefore in technical terms IPv4 needs port forwarding to be enabled and for IPv6 you need to open the firewall to allow access to your NextBox. But in reality most routers do not differentiate between those and just name it *port sharing* for either IPv4 or IPv6.
it: Quindi in termini tecnici IPv4 ha bisogno che il port forwarding sia abilitato e per IPv6 è necessario aprire il firewall per permettere l'accesso al NextBox. Ma in realtà la maggior parte dei router non fa differenza tra questi e lo chiama semplicemente *port sharing* sia per IPv4 che per IPv6.

source: **The port-forwarding and/or firewall rules have to be configured to allow traffic on ports 80 (HTTP-Server) and 443 (HTTPS-Server).**
it: **Il port-forwarding e/o le regole del firewall devono essere configurate per permettere il traffico sulle porte 80 (HTTP-Server) e 443 (HTTPS-Server).

source: On a recent *Fritz!Box* you will find this configuration inside: "Internet -> Permit Access -> Port Sharing"
it: Su un *Fritz!Box* recente troverete questa configurazione all'interno: "Internet -> Permit Access -> Port Sharing"

source: Backwards Proxy Remote Access
it: Accesso remoto con proxy all'indietro

source: **This is the fastest and easiest way to make your NextBox available for remote access.**
it: **Questo è il modo più semplice e veloce per rendere il tuo NextBox disponibile per l'accesso remoto.

source: The only information to provide is the (sub)domain your NextBox should be available at. There is also no need for a port forwarding configuration or any other setting to be done at your internet router. Although this method is recommended, please be aware that this method also comes with some drawbacks:
it: L'unica informazione da fornire è il (sotto)dominio su cui NextBox dovrebbe essere disponibile. Non c'è nemmeno bisogno di una configurazione di port forwarding o di qualsiasi altra impostazione da fare sul tuo router internet. Anche se questo metodo è raccomandato, si prega di essere consapevoli che questo metodo viene anche con alcuni svantaggi:

source: All traffic is passed through our (backwards) proxy server, thus is not end-to-end encrypted. *In particular, if this server is compromised, your traffic might be readable.*
it: Tutto il traffico passa attraverso il nostro server proxy (all'indietro), quindi non è criptato end-to-end. *In particolare, se questo server è compromesso, il vostro traffico potrebbe essere leggibile.*

source: The same reason also introduces a bandwith bottleneck, if you are connecting to your NextBox from within your local area network (LAN). As all traffic has to be send to our proxy server and from there to your NextBox, the available bandwidth is limited to roughly 50% of your upload or download bandwidth (whichever is smaller).
it: Lo stesso motivo introduce anche un collo di bottiglia, se ci si connette a NextBox dall'interno della propria rete locale (LAN). Poiché tutto il traffico deve essere inviato al nostro server proxy e da lì al tuo NextBox, la larghezza di banda disponibile è limitata a circa il 50% della tua larghezza di banda di upload o download (il più piccolo dei due).

source: In order to not be affected by these drawbacks you can set up a :doc:`dynamic DNS provider <dynamic-dns>` or a :doc:`static domain <static>`.
it: Per non essere colpiti da questi inconvenienti si può impostare un :doc:`dynamic DNS provider <dynamic-dns>` o un :doc:`static domain <static>`.

source: IPv6 to IPv4 Translation
it: Traduzione da IPv6 a IPv4

source: If your NextBox is only available through IPv6 (e.g., DS-Lite internet connection) the backwards proxy might be the only way to access your NextBox using a non-IPv6 enabled device. As of today e.g., various mobile network providers do not support IPv6 yet.
it: Se il tuo NextBox è disponibile solo tramite IPv6 (ad esempio, connessione internet DS-Lite) il proxy all'indietro potrebbe essere l'unico modo per accedere al tuo NextBox utilizzando un dispositivo non IPv6 abilitato. Ad oggi, ad esempio, vari fornitori di rete mobile non supportano ancora IPv6.

source: Static DNS Configuration
it: Configurazione statica del DNS

source: This configuration shall be used, if you configured DNS and thus a domain for your NextBox in e.g., your internet router.
it: Questa configurazione deve essere utilizzata, se si è configurato il DNS e quindi un dominio per il NextBox, ad esempio, nel router internet.

source: In order to use the configured domain with your NextBox and its Nextcloud instance you must provide the full domain here to trust this domain inside your Nextcloud instance.
it: Al fine di utilizzare il dominio configurato con il tuo NextBox e la sua istanza Nextcloud è necessario fornire il dominio completo qui per fidarsi di questo dominio all'interno della tua istanza Nextcloud.

source: For instance inside a "Fritz!Box" this can be done by navigating to: "Internet -> Permit Access -> DynDNS" and configuring a dynamic DNS provider of your choice.
it: Per esempio all'interno di un "Fritz!Box" questo può essere fatto navigando a: "Internet -> Permettere l'accesso -> DynDNS" e configurando un provider DNS dinamico di vostra scelta.

source: Remote Access Walkthrough
it: Guida all'accesso remoto

source: This documentation aims to give you a thorough introduction into the Remote Access topic, including a decision helper **why to choose a particular method**. If you are familiar with this topic you might want to jump directly to :doc:`method-comparison`.
it: Questa documentazione ha lo scopo di darvi un'introduzione approfondita all'argomento Accesso remoto, incluso un aiuto alla decisione **perché scegliere un particolare metodo**. Se hai familiarità con questo argomento potresti voler saltare direttamente a :doc:`method-comparison`.

source: What? Why?
it: Cosa? Perché?

source: You want to access your NextBox from everywhere, this means you want to access your NextBox from the internet through your internet router.
it: Vuoi accedere al tuo NextBox da qualsiasi luogo, questo significa che vuoi accedere al tuo NextBox da internet attraverso il tuo router internet.

source: On top of that you want to make sure that your data (traffic) is not readable by anyone else despite you. Nowadays this is accomplished by using `HTTPS`_, which is driven by `TLS`_.
it: Oltre a questo, volete assicurarvi che i vostri dati (traffico) non siano leggibili da nessun altro, nonostante voi. Al giorno d'oggi questo si ottiene usando `HTTPS`_, che è guidato da `TLS`_.

source: Right next to the URL (*nitrokey.com*) you see this small padlock, which translates to: This website provides an encrypted connection and all your traffic is not readable by anyone between your browser (client) and the Nitrokey server.
it: Proprio accanto all'URL (*nitrokey.com*) si vede questo piccolo lucchetto, che si traduce in: Questo sito web fornisce una connessione criptata e tutto il vostro traffico non è leggibile da nessuno tra il vostro browser (client) e il server Nitrokey.

source: Once your NextBox is set up properly and you see the dashboard the first time your URL bar in your browser might look like this:
it: Una volta che il tuo NextBox è impostato correttamente e vedi la dashboard per la prima volta, la tua barra degli URL nel tuo browser potrebbe essere come questa:

source: In this case the local IP has been used (``192.168.10.50``), this is specific to your local network and equal to ``nextbox.local``. The *not secure* and the warning sign transports the information that your connection is **not encrypted**, thus using *http* instead of *https*. For more you can read: `HTTP vs. HTTPS`_.
it: In questo caso è stato usato l'IP locale (``192.168.10.50``), questo è specifico della tua rete locale e uguale a ``nextbox.local``. Il *non sicuro* e il segno di avvertimento trasportano l'informazione che la vostra connessione non è **crittografata**, quindi usate *http* invece di *https*. Per saperne di più potete leggere: `HTTP vs. HTTPS`_.

source: Obviously, access to the NextBox should be secure, thus encrypted using *https*. This guide covers the different approaches to reach this goal, depending on your specific needs.
it: Ovviamente, l'accesso a NextBox deve essere sicuro, quindi criptato utilizzando *https*. Questa guida copre i diversi approcci per raggiungere questo obiettivo, a seconda delle vostre esigenze specifiche.

source: Use The Nitrokey Backwards Proxy
it: Usare il proxy di Nitrokey Backwards

source: This method is by far the easiest to set up and use to get an encrypted to your NextBox from everywhere, the only think to do is to go to *Remote Access* and *Backwards Proxy* inside the NextBox-App, insert a sub-domain you want to use and click *Enable Quickstart Remote Access*. From now on you can access your NextBox using a URL like this:
it: Questo metodo è di gran lunga il più semplice da impostare e utilizzare per ottenere un criptato al tuo NextBox da qualsiasi luogo, l'unica cosa da fare è andare su *Accesso remoto* e *Proxy all'indietro* all'interno della NextBox-App, inserire un sottodominio che si desidera utilizzare e fare clic su *Abilita accesso remoto rapido*. D'ora in poi è possibile accedere a NextBox utilizzando un URL come questo:

source: The padlock is there---your data (if you are using your ``[subdomain].nextbox.link`` URL) is now encrypted!
it: Il lucchetto è lì - i tuoi dati (se stai usando il tuo ``[subdomain].nextbox.link`` URL) sono ora criptati!

source: So far so good, but wait, this works, but has two major drawbacks: Performance and a chained end-to-end encryption.
it: Fin qui tutto bene, ma aspetta, questo funziona, ma ha due grandi svantaggi: Le prestazioni e una crittografia end-to-end a catena.

source: The backwards proxy works like this: Your NextBox connects to the Nitrokey Proxy server and opens up a (backwards) channel. So even though your NextBox is maybe standing right next to your computer, the traffic goes all the way from your computer, into the internet, to the Nitrokey server and all the way back to your NextBox.
it: Il proxy all'indietro funziona così: Il tuo NextBox si connette al server Proxy di Nitrokey e apre un canale (all'indietro). Così, anche se il tuo NextBox è forse accanto al tuo computer, il traffico va dal tuo computer, in internet, al server Nitrokey e torna al tuo NextBox.

source: Simplified, one could say all the traffic has to travel a long way towards the NextBox instead of talking directly to the NextBox. This essentially is a drawback of all proxies. The effect for you as a user is that data transfers will be slower, than a direct connection.
it: Semplificando, si potrebbe dire che tutto il traffico deve fare un lungo viaggio verso la NextBox invece di parlare direttamente con la NextBox. Questo è essenzialmente uno svantaggio di tutti i proxy. L'effetto per te come utente è che i trasferimenti di dati saranno più lenti, rispetto a una connessione diretta.

source: Chained End-to-End Encryption
it: Crittografia concatenata end-to-end

source: Another drawback is that your traffic is not fully end-to-end encrypted. To be clear: Your data is still encrypted, but only on the path from your client (browser) to the Nitrokey server, there the data will be decrypted and encrypted again to be sent to the NextBox.
it: Un altro svantaggio è che il tuo traffico non è completamente criptato end-to-end. Per essere chiari: i tuoi dati sono ancora criptati, ma solo sul percorso dal tuo client (browser) al server Nitrokey, lì i dati saranno decifrati e criptati di nuovo per essere inviati al NextBox.

source: Essentially this means you have to trust Nitrokey, because technically whoever is controlling this server might read the traffic that goes through it using this proxy. Nitrokey would never do such a thing, but there is a certain remaining risk that someone could compromise this server and read your traffic.
it: Essenzialmente questo significa che dovete fidarvi di Nitrokey, perché tecnicamente chiunque stia controllando questo server potrebbe leggere il traffico che lo attraversa usando questo proxy. Nitrokey non farebbe mai una cosa del genere, ma c'è un certo rischio residuo che qualcuno possa compromettere questo server e leggere il vostro traffico.

source: Obviously this can be done in a better way, but still this might be enough depending on your personal usage scenario.
it: Ovviamente questo può essere fatto in un modo migliore, ma comunque questo potrebbe essere sufficiente a seconda del vostro scenario di utilizzo personale.

source: Acquire Your Own Certificate
it: Acquisire il proprio certificato

source: This is clearly the best and most secure method to remote access your NextBox as it will give your the best performance and true end-to-end encryption, but it comes with some additional configuration needs. We start first with a very quick introduction what encryption with an own certificate means and what is needed.
it: Questo è chiaramente il metodo migliore e più sicuro per accedere in remoto al tuo NextBox, in quanto ti darà le migliori prestazioni e una vera crittografia end-to-end, ma viene con alcune esigenze di configurazione aggiuntive. Iniziamo prima con un'introduzione molto veloce su cosa significa la crittografia con un certificato proprio e cosa è necessario.

source: The Certificate Authority
it: L'autorità di certificazione

source: A `CA`_, as the name suggests, is *someone* who is able to provide you with a digital certificate, which will allow you to use `TLS`_, thus encrypt the your traffic, enabling you to use *https*.
it: Un `CA`_, come suggerisce il nome, è *qualcuno* che è in grado di fornirvi un certificato digitale, che vi permetterà di usare `TLS`_, criptando così il vostro traffico, permettendovi di usare *https*.

source: By definition, a `CA`_ is only allowed to issue a certificate, if they can verify that your are the **owner of a public internet (sub)domain**. This ownership is a very important property as this, despite the encryption, additionally allows the client (browser) to verify that the traffic that is sent by a certain website is really originating from this (sub)domain and no man-in-the-middle has injected some data, which could compromise your client.
it: Per definizione, una `CA`_ può emettere un certificato solo se può verificare che sei il **proprietario di un (sotto)dominio** internet pubblico. Questa proprietà è una proprietà molto importante in quanto, nonostante la crittografia, permette inoltre al client (browser) di verificare che il traffico inviato da un certo sito web provenga realmente da questo (sotto)dominio e che nessun man-in-the-middle abbia iniettato dei dati, che potrebbero compromettere il vostro client.

source: This being said, obviously it is not possible to acquire an certificate for *nextbox.local* or even a local IP, as these are neither public nor unique.
it: Detto questo, ovviamente non è possibile acquisire un certificato per *nextbox.local* o anche un IP locale, poiché questi non sono né pubblici né unici.

source: Acquire a public (sub)domain for your NextBox
it: Acquisire un (sotto)dominio pubblico per il tuo NextBox

source: The NextBox comes with a feature (:doc:`dynamic-dns`), which allows you to easily register a public sub-domain for your NextBox using a so-called *dynamic DNS provider*, here namely `deSEC`_. This particular service is totally free and a non-profit organization.
it: Il NextBox viene fornito con una caratteristica (:doc:`dynamic-dns`), che consente di registrare facilmente un sottodominio pubblico per il tuo NextBox utilizzando un cosiddetto *dynamic DNS provider*, qui cioè `deSEC`_. Questo particolare servizio è totalmente gratuito ed è un'organizzazione no-profit.

source: This is a very important step prior to acquiring a certificate, as this sub-domain registered through `deSEC`_ will be public and unique, whose as we learned are needed to acquire a certificate.
it: Questo è un passo molto importante prima di acquisire un certificato, poiché questo sottodominio registrato attraverso `deSEC`_ sarà pubblico e unico, i cui come abbiamo imparato sono necessari per acquisire un certificato.

source: Step-by-Step DNS & TLS
it: DNS passo dopo passo & TLS

source: This may sound complex, but the NextBox comes with all you need to get through this process:
it: Questo può sembrare complesso, ma il NextBox viene fornito con tutto il necessario per superare questo processo:

source: Navigate to the Nextcloud NextBox-App
it: Navigare alla Nextcloud NextBox-App

source: Click on "Guided Dynamic DNS"
it: Cliccate su "Guided Dynamic DNS"

source: Insert a valid e-mail address you have access to into the first input field
it: Inserisci un indirizzo e-mail valido a cui hai accesso nel primo campo di input

source: Insert the full sub-domain your NextBox shall be available through. As `deSEC`_ is used here, your sub-domain always has to end with *dedyn.io*, so something like: ``mynextbox.dedyn.io``
it: Inserisci il sottodominio completo attraverso il quale NextBox deve essere disponibile. Poiché `deSEC`_ è usato qui, il tuo sottodominio deve sempre finire con *dedyn.io*, quindi qualcosa come: ``mynextbox.dedyn.io``

source: Click "Register at deSEC" and the NextBox will try to register your domain and e-mail at `deSEC`_. This may fail, if the sub-domain you chose is already taken, please choose another one in this case.
it: Clicca su "Registrati a deSEC" e il NextBox proverà a registrare il tuo dominio e la tua e-mail a `deSEC`_. Questo può fallire, se il sottodominio che hai scelto è già occupato, per favore scegline un altro in questo caso.

source: You will receive an e-mail in which you should verify that this is your e-mail by clicking on the provided link
it: Riceverai un'e-mail in cui dovrai verificare che questa è la tua e-mail cliccando sul link fornito

source: In step two, you will have to input a *token*, which you received after you clicked the verification link and completed the captcha.
it: Nel secondo passo, dovrai inserire un *token*, che hai ricevuto dopo aver cliccato sul link di verifica e completato il captcha.

source: Now you are the owner of your very own sub-domain. You can try and visit this subdomain now, but you will see that it will only (best case) end up on your internet router. This is because your router is your door to the internet and it has to be made aware that you want specific traffic to be forwarded to your NextBox. Please set up :doc:`port-forwarding` on your internet router now, once this is done, visiting your registered sub-domain in the browser will show you your NextBox' Nextcloud instance.
it: Ora sei il proprietario del tuo sottodominio personale. Ora puoi provare a visitare questo sottodominio, ma vedrai che finirà solo (nel migliore dei casi) sul tuo router internet. Questo perché il tuo router è la tua porta verso Internet e deve essere informato che vuoi che il traffico specifico sia inoltrato al tuo NextBox. Si prega di impostare :doc:`port-forwarding` sul vostro router internet ora, una volta che questo è fatto, visitando il vostro sottodominio registrato nel browser vi mostrerà il vostro NextBox' istanza Nextcloud.

source: Great from here there is just one step remaining:
it: Grande da qui rimane solo un passo:

source: Click on "HTTPS / TLS"
it: Clicca su "HTTPS / TLS"

source: Click the button "Enable TLS"
it: Fare clic sul pulsante "Enable TLS"

source: Please wait some moments to acquire your certificate
it: Attenda qualche istante per acquisire il suo certificato

source: Shortly after you will be automatically redirected to your now encrypted NextBox sub-domain, which might look similar to this:
it: Poco dopo sarai automaticamente reindirizzato al tuo sottodominio NextBox ora criptato, che potrebbe essere simile a questo:

source: There we are, your very own sub-domain, certificate and fully end-to-end encrypted Nextcloud.
it: Ecco qui, il tuo sottodominio personale, il certificato e Nextcloud completamente crittografato end-to-end.

source: If you encounter problems, please read the other articles inside the :doc:`Remote Access Section<index>`.
it: Se incontrate problemi, leggete gli altri articoli all'interno del :doc:`Sezione accesso remoto<indice>`.
