Repository: DamienCassou/nitrokey-documentation
Catalog: locales/*/LC_MESSAGES/nextbox.po
Languages: it

source: **Your communications under your control** - use Nextcloud's powerful `groupware apps`_ like *Mail*, *Contacts*, *Calendar* or even *Deck* to have all your personal data under your control or to organize and work together with others.
it: **Le tue comunicazioni sotto il tuo controllo** - usa Nextcloud'le potenti app `groupware come *Mail*, *Contacts*, *Calendar* o anche *Deck* per avere tutti i tuoi dati personali sotto il tuo controllo o per organizzare e lavorare insieme ad altri.

source: More interested in :doc:`technical details <technical/index>`? Or in Open-Source in general? Then head over to the NextBox `repositories`_ at GitHub, leave a star, contribute or discuss latest ideas and plans with us.
it: Più interessato a :doc:`dettagli tecnici <technical/index>`? O all'Open-Source in generale? Allora vai sui `repository di NextBox`_ su GitHub, lascia una stella, contribuisci o discuti le ultime idee e progetti con noi.

source: Hardware Overview
it: Panoramica dell'hardware

source: Summary
it: Riassunto

source: A NextBox consists of the following hardware components:
it: Un NextBox è composto dai seguenti componenti hardware:

source: Raspberry PI 4 Type B
it: Raspberry PI 4 Tipo B

source: Nitrokey NextBox (aluminum) case
it: Custodia Nitrokey NextBox (alluminio)

source: Internal hard-drive (SSD or HDD)
it: Disco rigido interno (SSD o HDD)

source: Various smaller parts (internal wiring, connectors)
it: Varie parti più piccole (cablaggio interno, connettori)

source: The casing is made out of aluminum and a passive thermal design. There are no glued components and the case can easily be opened using a Phillips screwdriver. Please keep in mind that opening the case will void your warranty and it is generally not recommended to open the case for the non-professional user, especially as this might damage the thermal conductivity and therefore the heat dissipating capabilities of the NextBox might suffer.
it: L'involucro è fatto di alluminio e di un design termico passivo. Non ci sono componenti incollati e il case può essere facilmente aperto usando un cacciavite a croce. Tieni presente che l'apertura del case invaliderà la garanzia ed è generalmente sconsigliato all'utente non professionista aprire il case, soprattutto perché questo potrebbe danneggiare la conduttività termica e quindi le capacità di dissipazione del NextBox potrebbero soffrire.

source: Connectors and Interfaces
it: Connettori e interfacce

source: In general the NextBox exposes all ports, which are available on the Raspberry PI 4 and one additional USB Type C port for a better accessible power supply connector. In the following a short description of the different connectors and interfaces is given.
it: In generale il NextBox espone tutte le porte che sono disponibili sul Raspberry PI 4 e una porta USB Type C aggiuntiva per un connettore di alimentazione più accessibile. Di seguito viene data una breve descrizione dei diversi connettori e interfacce.

source: Hardware button for :doc:`Factory-Reset<technical/factory-reset>`
it: Pulsante hardware per :doc:`Factory-Reset<technical/factory-reset>`

source: **USB Type-C / Power Supply** connector is designated as a replacement for the stock connector on the front side and is exclusively for supplying power to the NextBox and cannot transfer data.
it: Il connettore **USB Type-C / Power Supply** è designato come un sostituto del connettore stock sul lato anteriore ed è esclusivamente per fornire alimentazione al NextBox e non può trasferire dati.

source: The right side of the NextBox is designed so that all mandatory interfaces can be accessed from this side.
it: Il lato destro di NextBox è progettato in modo che tutte le interfacce obbligatorie siano accessibili da questo lato.

source: The **RJ45 - 1GbE Ethernet** connector connects your NextBox with your home network and shall stay connected at all times.
it: Il connettore **RJ45 - 1GbE Ethernet** collega il tuo NextBox con la tua rete domestica e deve rimanere sempre connesso.

source: **Free USB 3 - Type A Slot**, please see :ref:`Hardware FAQ<usb-power-supply>`
it: **Free USB 3 - Type A Slot**, vedi :ref:`Hardware FAQ<usb-power-supply>`

source: **Reserved USB 3 - Type A Slot**, used for the internal hard-disk. *Never remove this connector!*
it: **Slot USB 3 - Tipo A riservato**, usato per l'hard-disk interno. *Non rimuovere mai questo connettore!

source: **2x Free USB 2 - Type A Slots**, please see :ref:`Hardware FAQ<usb-power-supply>`
it: **2x Free USB 2 - Type A Slots**, si prega di vedere :ref:`Hardware FAQ<usb-power-supply>`

source: Using a hard-drive with an external power supply you can use any of the available USB slots. Keep in mind that the data transfer bandwidth for the USB 2 slots is less compared to the USB 3 slot.
it: Usando un hard-drive con un'alimentazione esterna si può usare uno qualsiasi degli slot USB disponibili. Tenete presente che la larghezza di banda di trasferimento dati per gli slot USB 2 è inferiore rispetto allo slot USB 3.

source: **USB Type-C / Power Supply** (stock) connector, can be used as **[3]**
it: Connettore **USB Type-C / Alimentazione** (stock), può essere usato come **[3]**

source: **Micro HDMI 1 slot**, usable but not needed.
it: **Micro HDMI 1 slot**, utilizzabile ma non necessario.

source: **Micro HDMI 2 slot**, usable but not needed.
it: **Slot Micro HDMI 2**, utilizzabile ma non necessario.

source: **Headphone Jack**, usable but not needed.
it: **Jack per cuffie**, utilizzabile ma non necessario.

source: The front interfaces are all optional and not necessary for NextBox usage in general. While the **USB Type-C/Power Supply** may be used, the alternative on the right side of the NextBox can be used to have all wiring convenient on one side.
it: Le interfacce frontali sono tutte opzionali e non necessarie per l'uso di NextBox in generale. Mentre la **USB Type-C/alimentazione** può essere usata, l'alternativa sul lato destro della NextBox può essere usata per avere tutto il cablaggio comodo su un lato.

source: DNS Rebind Protection
it: Protezione DNS Rebind

source: Issue
it: Emissione

source: You have your dynamic DNS correctly set up, but IPv6 resolving does not work for your domain.
it: Avete impostato correttamente il vostro DNS dinamico, ma la risoluzione IPv6 non funziona per il vostro dominio.

source: Details
it: Dettagli

source: In general DNS Rebinding protection is a safety mechanism to avoid attacks based on `DNS-Rebinding`_. Home routers include a protection mechanism for this attack by never returning a local IP (v4 & v6) address.
it: In generale la protezione DNS Rebinding è un meccanismo di sicurezza per evitare attacchi basati su `DNS-Rebinding`_. I router domestici includono un meccanismo di protezione per questo attacco, non restituendo mai un indirizzo IP locale (v4 & v6).

source: In the context of the NextBox this means that, if you are using IPv6, the IPv6 address of your NextBox is considered local by your router and thus wiull not be returned during DNS resolving of your designated domain.
it: Nel contesto di NextBox, ciò significa che, se stai usando IPv6, l'indirizzo IPv6 del tuo NextBox è considerato locale dal tuo router e quindi non sarà restituito durante la risoluzione DNS del tuo dominio designato.

source: For IPv4 this is also applies, but not a problem. In the IPv4 world (dynamic) DNS resolves to the router (WAN-IP) itself and the router will forward the traffic to your NextBox. In contrast IPv6 will not resolve to your router but to the IPv6 address of your NextBox directly and the router just has to open its firewall for the traffic to pass.
it: Anche per IPv4 questo vale, ma non è un problema. Nel mondo IPv4 (dinamico) il DNS si risolve al router (WAN-IP) stesso e il router inoltrerà il traffico al NextBox. Al contrario, l'IPv6 non si risolve al router ma all'indirizzo IPv6 del NextBox direttamente e il router deve solo aprire il suo firewall per far passare il traffico.

source: Solution
it: Soluzione

source: Most routers, which implement this DNS-Rebind protection also allow you to whitelist certain domains from this protection. **Generally, to solve this issue you have to insert your (full) domain to the DNS-Rebind Exceptions (or whitelist) of your router.**
it: La maggior parte dei router che implementano questa protezione DNS-Rebind permettono anche di inserire alcuni domini nella whitelist di questa protezione. **Generalmente, per risolvere questo problema dovete inserire il vostro dominio (completo) nelle DNS-Rebind Exceptions (o whitelist) del vostro router.

source: For instance, the setting inside a *Fritz!Box* is to be found in: "Home Network -> Network -> Network Settings -> More Settings -> DNS Rebind Protection". You need to ensure that you have the "extended/expert view" activated.
it: Per esempio, l'impostazione all'interno di un *Fritz!Box* si trova in: "Rete domestica -> Rete -> Impostazioni di rete -> Altre impostazioni -> Protezione DNS Rebind". Dovete assicurarvi di avere la "vista estesa/esperta" attivata.

source: Dynamic DNS Setup
it: Impostazione DNS dinamico

source: **There are two ways to configure a dynamic DNS provider to be used and updated by your NextBox instance.**
it: **Ci sono due modi per configurare un provider DNS dinamico da utilizzare e aggiornare dalla sua istanza NextBox.

source: In contrast to the :doc:`backwards proxy <proxy>` remote access method, this approach will ensure full end-to-end encryption using your very own TLS certificate acquired from `Let's Encrypt`_.
it: In contrasto con il metodo di accesso remoto :doc:`backwards proxy <proxy>`, questo approccio assicurerà una crittografia completa end-to-end utilizzando il proprio certificato TLS acquistato da `Let's Encrypt`_.

source: Guided Dynamic DNS
it: DNS dinamico guidato

source: The guided setup will register an account at `desec.io`_ for you. Please follow these steps to configure your NextBox using the Guided Dynamic DNS method:
it: La configurazione guidata registrerà per te un account su `desec.io`_. Seguire questi passi per configurare il NextBox utilizzando il metodo Dynamic DNS guidato:

source: In step one you need to provide an e-mail address and the domain you would like to register. Please make sure that you have access to this e-mail account and the domain ends with **.dedyn.io**. *You can continue to the next step by registering at `desec.io`_ or without (e.g., if you have already registered this domain before)*
it: Nel primo passo è necessario fornire un indirizzo e-mail e il dominio che si desidera registrare. Assicurati di avere accesso a questo account e-mail e che il dominio finisca con **.dedyn.io**. *Puoi continuare al passo successivo registrandoti a `desec.io`_ o senza (per esempio, se hai già registrato questo dominio prima)*.

source: After the registration at `desec.io`_ you will receive a verification e-mail, which will guide you through the registration process at `desec.io`_. Once completed you will be presented with a secret token, which is needed in step two.
it: Dopo la registrazione a `desec.io`_ riceverai una e-mail di verifica, che ti guiderà attraverso il processo di registrazione a `desec.io`_. Una volta completato, ti verrà presentato un token segreto, che è necessario nella fase due.

source: If you do not receive a verification e-mail try `reset password`_ (using the same e-mail address) at `desec.io`_ to set a password, which will allow you to login into your account.
it: Se non ricevi un'e-mail di verifica prova `reset password`_ (usando lo stesso indirizzo e-mail) su `desec.io`_ per impostare una password, che ti permetterà di accedere al tuo account.

source: In step two the just acquired secret token shall be inserted into the input field to complete your guided dynamic dns configuration.
it: Nel secondo passo il token segreto appena acquisito deve essere inserito nel campo di input per completare la configurazione dinamica guidata dei dns.

source: Your token will only be presented once to you (after the verification process). If you need a new token, you need to create a new one inside the `token management`_ inside your `desec.io`_ account settings.
it: Il tuo token ti sarà presentato solo una volta (dopo il processo di verifica). Se hai bisogno di un nuovo token, devi crearne uno nuovo all'interno del `token management`_ all'interno delle impostazioni del tuo `desec.io`_ account.

source: Once the 2nd step is completed you can *Continue to TLS activation* - see below...
it: Una volta che il 2° passo è completato potete *continuare all'attivazione di TLS* - vedi sotto...

source: Custom Dynamic DNS
it: DNS dinamico personalizzato

source: To update your dynamic DNS provider with your currently used IP(s), NextBox is using `ddclient`_, which can be directly configured here or via the *Guided DNS* method described before.
it: Per aggiornare il tuo provider DNS dinamico con i tuoi IP attualmente utilizzati, NextBox utilizza `ddclient`_, che può essere configurato direttamente qui o tramite il metodo *Guided DNS* descritto prima.

source: In this configuration you need the provide the *domain* this configuration is enabling and the contents of the `ddclient.conf` used by `ddclient`_. Various examples can be found at the `official documentation`_, the one used for the guided DNS configuration uses the following template:
it: In questa configurazione è necessario fornire il *dominio* che questa configurazione sta abilitando e il contenuto del `ddclient.conf` usato da `ddclient`_. Vari esempi possono essere trovati nella `documentazione ufficiale`_, quello usato per la configurazione guidata del DNS usa il seguente modello:

source: Once you actiavted this configuration, you can *Continue to TLS activation* - see below
it: Una volta che hai agito questa configurazione, puoi *Continuare l'attivazione di TLS* - vedi sotto

source: Enable TLS
it: Abilita TLS

source: On this page first wait for the status-bars to settle and mainly ensure that *reachability* of your NextBox is tested successfully. If this is the case, just click **Enable TLS** to acquire your TLS certificate.
it: In questa pagina, attendere prima che le barre di stato si assestino e soprattutto assicurarsi che la *raggiungibilità* del proprio NextBox sia testata con successo. Se questo è il caso, basta cliccare su **Enable TLS** per acquisire il tuo certificato TLS.

source: If the reachibility test fails, make sure your :doc:`port forwarding <port-forwarding>` is configured properly.
it: Se il test di raggiungibilità fallisce, assicuratevi che il vostro :doc:`port forwarding <port-forwarding>` sia configurato correttamente.

source: Managing Remote Access
it: Gestire l'accesso remoto

source: Your NextBox comes with different options on how to enable access to your NextBox from any remote location as long as you have an internet connection available.
it: Il tuo NextBox viene fornito con diverse opzioni su come abilitare l'accesso al tuo NextBox da qualsiasi posizione remota, purché tu abbia una connessione internet disponibile.

source: If you struggle with the overall topic, please read:
it: Se avete difficoltà con l'argomento generale, leggete:

source: Even though the *Backwards Proxy* remote access method is a quick way to realize remote access, we **strongly recommend** to use a :doc:`dynamic DNS setup<dynamic-dns>` or :doc:`static DNS setup<static>` to maintain the best security level for your NextBox. *In most usage scenarios the latter will also provide a better data bandwidth and user experience*
it: Anche se il metodo di accesso remoto *Backwards Proxy* è un modo rapido per realizzare l'accesso remoto, noi **raccomandiamo vivamente** di usare un :doc:`dynamic DNS setup<dynamic-dns>` o :doc:`static DNS setup<static>` per mantenere il miglior livello di sicurezza per il tuo NextBox. *Nella maggior parte degli scenari di utilizzo quest'ultimo fornirà anche una migliore larghezza di banda dei dati e un'esperienza utente*

source: Before you set up a remote access method you might want to read the :doc:`comparison<method-comparison>` in order to understand the trade-offs and capabilities of the different approaches:
it: Prima di impostare un metodo di accesso remoto potreste voler leggere il :doc:`comparison<method-comparison>` per capire i compromessi e le capacità dei diversi approcci:

source: There are different ways to make your NextBox available for remote access.
it: Ci sono diversi modi per rendere il tuo NextBox disponibile per l'accesso remoto.

source: The following topics might be of interest for you, depending on your internet service provider and the type of your internet connection:
it: I seguenti argomenti potrebbero essere interessanti per voi, a seconda del vostro fornitore di servizi internet e del tipo di connessione internet:

source: IPv6-related Settings
it: Impostazioni relative a IPv6

source: You have properly set up one of the DNS configurations, :doc:`port-forwarding` and :doc:`dns-rebind` and still your NextBox is not available / reachable.
it: Hai impostato correttamente una delle configurazioni DNS, :doc:`port-forwarding` e :doc:`dns-rebind` e ancora il tuo NextBox non è disponibile / raggiungibile.

source: This is in particular important for Fritz!Box owners and/or DS-Lite internet connections.
it: Questo è particolarmente importante per i proprietari di Fritz!Box e/o connessioni internet DS-Lite.

source: First test your (sub-)domain using a 3rd party service like `IPv6 Test`_ to test your NextBox' IPv6 reachability. If this fails this is another indicator that your IPv6 settings are not correct.
it: Per prima cosa testa il tuo (sotto)dominio usando un servizio di terze parti come `IPv6 Test`_ per testare il tuo NextBox' raggiungibilità IPv6. Se questo fallisce, questo è un altro indicatore che le tue impostazioni IPv6 non sono corrette.

source: Some routers might have a bad default configuration for IPv6. Therefore please ensure that your router is configured to pass IPv6 addresses to your network clients (called ``IA_NA``), if this not done, no IPv6 connection can be established to your NextBox from the outside, thus your NextBox is not reachable.
it: Alcuni router potrebbero avere una cattiva configurazione di default per IPv6. Pertanto, assicurarsi che il router sia configurato per passare indirizzi IPv6 ai client di rete (chiamati ``IA_NA``), se questo non viene fatto, nessuna connessione IPv6 può essere stabilita al NextBox dall'esterno, quindi il NextBox non è raggiungibile.

source: On a recent *Fritz!Box* you will find this configuration inside: "Home Network -> "Network" -> "Network Settings" -> "IPv6 Configuration" Inside this view inside the section: "DHCPv6 Server in the Home Network" activate: "Enable DHCPv6 server in the FRITZ!Box for the home network:" and below this the last radio button has to be active: "Assign DNS server, prefix (IA_PD) and IPv6 address (IA_NA)" instead of the default, which is the 1st radio button.
it: Su un *Fritz!Box* recente troverete questa configurazione all'interno di: "Rete domestica -> "Rete" -> "Impostazioni di rete" -> "Configurazione IPv6" In questa vista all'interno della sezione: "Server DHCPv6 nella rete domestica" attivate: "Abilita il server DHCPv6 nel FRITZ!Box per la rete domestica:" e sotto questo l'ultimo pulsante radio deve essere attivo: "Assegnare server DNS, prefisso (IA_PD) e indirizzo IPv6 (IA_NA)" invece del default, che è il 1° pulsante radio.

source: Comparing Methods For (Remote) Access
it: Metodi a confronto per l'accesso (remoto)

source: This is clearly the best and most secure approach and we recommend using a DNS-based remote-access method including your own TLS certificate for the best security
it: Questo è chiaramente l'approccio migliore e più sicuro e raccomandiamo di usare un metodo di accesso remoto basato su DNS che includa il proprio certificato TLS per la migliore sicurezza.

source: This denotes the :doc:`dynamic-dns` and the :doc:`static` approach.
it: Questo denota l'approccio :doc:`dynamic-dns` e :doc:`static`.

source: Clearly the *best* method, but also the one requiring some configuration work on your internet router.
it: Chiaramente il metodo *migliore*, ma anche quello che richiede un po' di lavoro di configurazione sul vostro router internet.

source: You get your *own* (sub)domain and a TLS certificate, thus all your traffic will always be end-to-end encrypted and you maintain the highest level of security for your traffic.
it: Ottieni il tuo *proprio* (sotto)dominio e un certificato TLS, quindi tutto il tuo traffico sarà sempre criptato end-to-end e manterrai il massimo livello di sicurezza per il tuo traffico.

source: Opening the right ports on your internet router is necessary, see :doc:`here<port-forwarding>`
it: È necessario aprire le porte giuste sul tuo router internet, vedi :doc:`qui<port-forwarding>`

source: Data path: [NextBox] ⟷ [Router] ⟷ [Client]
it: Percorso dei dati: [NextBox] ⟷ [Router] ⟷ [Client]

source: **Pro:** best performance, highest security, full end-to-end encryption
it: **Pro:** migliori prestazioni, massima sicurezza, crittografia completa end-to-end

source: **Contra:** needs (dynamic) DNS, needs configuration on your internet router
it: **Contra:** ha bisogno di DNS (dinamico), ha bisogno di configurazione sul tuo router internet

source: Non-encrypted
it: Non criptato

source: We strongly recommend to not use the non-encrypted setup, if you plan to make your NextBox available outside of your local area network.
it: Si consiglia vivamente di non utilizzare la configurazione non criptata, se si prevede di rendere disponibile il NextBox al di fuori della propria rete locale.

source: simple (``http``) using either ``nextbox.local`` or your local IP (e.g.: ``192.168.178.123``)
it: semplice (``http``) usando o ``nextbox.local`` o il tuo IP locale (es: ``192.168.178.123``)

source: Generally a bad idea, this will not encrypt the transported data in any way and is only useful in a setup where you do not want remote access to your NextBox (having non-encrypted traffic inside your LAN might be no problem, as long as you know what you are doing)
it: Generalmente una cattiva idea, questo non cifrerà i dati trasportati in alcun modo ed è utile solo in una configurazione in cui non si desidera l'accesso remoto al NextBox (avere traffico non cifrato all'interno della propria LAN potrebbe non essere un problema, a patto che si sappia cosa si sta facendo)

source: **Pro:** fast, no configuration
it: **Pro:** veloce, nessuna configurazione

source: **Contra:** no transport security, no remote access (or only unencrypted)
it: **Contra:** nessuna sicurezza del trasporto, nessun accesso remoto (o solo in chiaro)

source: Further, once you set up TLS and thus a DNS-based method, the unencrypted connection for your NextBox will be disabled, this is not the case for the Reverse Proxy as a problem with the proxy would then lock you out of your NextBox.
it: Inoltre, una volta impostato TLS e quindi un metodo basato su DNS, la connessione non criptata per il tuo NextBox sarà disabilitata, questo non è il caso del Reverse Proxy in quanto un problema con il proxy ti bloccherebbe dal tuo NextBox.

source: This refers to the :doc:`proxy` method.
it: Questo si riferisce al metodo :doc:`proxy`.
