Repository: DamienCassou/nitrokey-documentation
Catalog: locales/*/LC_MESSAGES/nitropad.po
Languages: de, it

source: The user PIN can have up to 20 digits and other characters (e.g. alphabetic and special characters). But as the user PIN is blocked as soon three wrong PIN attempts were done, it is sufficiently secure to only have a 6 digits PIN. The default PIN is 123456.
de: Die Benutzer-PIN kann bis zu 20 Ziffern und andere Zeichen (z. B. Buchstaben und Sonderzeichen) enthalten. Da die Benutzer-PIN jedoch gesperrt wird, sobald drei falsche PIN-Versuche unternommen wurden, ist eine 6-stellige PIN ausreichend sicher. Die Standard-PIN lautet 123456.
it: Il PIN utente può avere fino a 20 cifre e altri caratteri (per esempio alfabetici e speciali). Ma dato che il PIN utente viene bloccato non appena vengono fatti tre tentativi di PIN errati, è sufficientemente sicuro avere solo un PIN di 6 cifre. Il PIN di default è 123456.

source: Admin PIN
de: Verwaltungs-PIN
it: PIN dell'amministratore

source: The admin PIN is at least 8-digits long and is used to change contents/settings of the Nitrokey. That is to say after initializing the Nitrokey you probably won’t need this PIN too often (e.g. if you want to add another password to the password safe of the Nitrokey Pro or Nitrokey Storage).
de: Die Admin-PIN ist mindestens 8-stellig und wird verwendet, um Inhalte/Einstellungen des Nitrokey zu ändern. D.h. nach der Initialisierung des Nitrokey werden Sie diese PIN wahrscheinlich nicht allzu oft benötigen (z.B. wenn Sie ein weiteres Passwort zum Passworttresor des Nitrokey Pro oder Nitrokey Storage hinzufügen wollen).
it: Il PIN admin è lungo almeno 8 cifre e viene usato per cambiare i contenuti/impostazioni di Nitrokey. Questo significa che dopo aver inizializzato la Nitrokey probabilmente non avrete bisogno di questo PIN troppo spesso (per esempio se volete aggiungere un'altra password alla cassaforte di Nitrokey Pro o Nitrokey Storage).

source: You can change the admin PIN with the Nitrokey App if using a Nitrokey Pro or Nitrokey Storage. In the `Nitrokey App <https://www.nitrokey.com/download>`_ open ‘Menu -> Configure -> Change Admin PIN’ to open the dialog to change the PIN.
de: Sie können die Admin-PIN mit der Nitrokey App ändern, wenn Sie einen Nitrokey Pro oder Nitrokey Storage verwenden. In der `Nitrokey App <https://www.nitrokey.com/download>`_ öffnen Sie 'Menü -> Konfigurieren -> Admin PIN ändern', um den Dialog zum Ändern der PIN zu öffnen.
it: Puoi cambiare il PIN di amministrazione con la Nitrokey App se usi una Nitrokey Pro o Nitrokey Storage. Nella ` App Nitrokey <https://www.nitrokey.com/download>`_ apri 'Menu -> Configure -> Change Admin PIN' per aprire la finestra di dialogo per cambiare il PIN.

source: You can change the admin PIN in the dialog window now.
de: Sie können die Admin-PIN jetzt im Dialogfenster ändern.
it: Ora puoi cambiare il PIN dell'amministratore nella finestra di dialogo.

source: The admin PIN can have up to 20 digits and other characters (e.g. alphabetic and special characters). But as the admin PIN is blocked as soon three wrong PIN attempts were done, it is sufficiently secure to only have 8 digits PIN. The default PIN is 12345678.
de: Die Admin-PIN kann bis zu 20 Ziffern und weitere Zeichen (z.B. Buchstaben und Sonderzeichen) enthalten. Da die Admin-PIN jedoch gesperrt wird, sobald drei falsche PIN-Versuche unternommen wurden, ist es ausreichend sicher, nur eine 8-stellige PIN zu verwenden. Die Standard-PIN lautet 12345678.
it: Il PIN amministrativo può avere fino a 20 cifre e altri caratteri (per esempio alfabetici e speciali). Ma dato che il PIN amministrativo viene bloccato non appena vengono fatti tre tentativi di PIN errati, è sufficientemente sicuro avere solo 8 cifre di PIN. Il PIN di default è 12345678.

source: NitroPad with Qubes OS
de: NitroPad mit Qubes OS
it: NitroPad con Qubes OS

source: Getting Started
de: Erste Schritte
it: Come iniziare

source: After purchase, the passwords are set to a default value and must be changed by you:
de: Nach dem Kauf sind die Passwörter auf einen Standardwert gesetzt und müssen von Ihnen geändert werden:
it: Dopo l'acquisto, le password sono impostate su un valore predefinito e devono essere cambiate da voi:

source: Press Enter (“Default Boot”) after booting the system, provided the NitroPad has not shown any errors and the Nitrokey is lit green (see above).
de: Drücken Sie nach dem Hochfahren des Systems die Eingabetaste ("Default Boot"), sofern das NitroPad keine Fehler angezeigt hat und der Nitrokey grün leuchtet (siehe oben).
it: Premere Invio ("Default Boot") dopo aver avviato il sistema, a condizione che NitroPad non abbia mostrato alcun errore e che la Nitrokey sia illuminata di verde (vedi sopra).

source: Next, the system will prompt you to enter the passphrase to decrypt the hard disk. The passphrase is initially “PleaseChangeMe”.
de: Als Nächstes fordert das System Sie auf, die Passphrase zur Entschlüsselung der Festplatte einzugeben. Die Passphrase lautet zunächst "PleaseChangeMe".
it: Successivamente, il sistema vi chiederà di inserire la passphrase per decifrare il disco rigido. La passphrase è inizialmente "PleaseChangeMe".

source: The system will then guide you through the process of creating a user account. After that you should have successfully booted the system and could already use it normally.
de: Das System führt Sie dann durch den Prozess der Erstellung eines Benutzerkontos. Danach sollten Sie das System erfolgreich gebootet haben und könnten es bereits normal nutzen.
it: Il sistema vi guiderà poi attraverso il processo di creazione di un account utente. Dopo di che dovreste aver avviato con successo il sistema e potreste già usarlo normalmente.

source: Open the pre-installed Nitrokey App and change the PINs of your Nitrokey as `described here <change-pins.html>`_.
de: Öffnen Sie die vorinstallierte Nitrokey-App und ändern Sie die PINs Ihres Nitrokeys wie hier `beschrieben <change-pins.html>`_.
it: Aprite la Nitrokey App preinstallata e cambiate il PIN della vostra Nitrokey come `descritto qui <change-pins.html>`_.

source: Change the passphrase for the hard disk encryption by running “sudo cryptsetup luksChangeKey /dev/sda2” in a terminal. This passphrase is different from your user acount's passphrase.
de: Ändern Sie die Passphrase für die Festplattenverschlüsselung, indem Sie in einem Terminal "sudo cryptsetup luksChangeKey /dev/sda2" ausführen. Diese Passphrase unterscheidet sich von der Passphrase Ihres Benutzerkontos.
it: Cambiate la passphrase per la crittografia del disco rigido eseguendo "sudo cryptsetup luksChangeKey /dev/sda2" in un terminale. Questa passphrase è diversa da quella del tuo account utente.

source: In case the Network Manager icon is not shown and when starting a VM an error like “Domain sys-net has failed to start: PCI device dom0:03_00.0 does not exist” is shown, proceed as follows:
de: Falls das Netzwerk-Manager-Symbol nicht angezeigt wird und beim Starten einer VM ein Fehler wie "Domain sys-net has failed to start: PCI device dom0:03_00.0 does not exist" angezeigt wird, gehen Sie wie folgt vor:
it: Nel caso in cui l'icona Network Manager non venga mostrata e all'avvio di una VM venga mostrato un errore del tipo "Domain sys-net has failed to start: PCI device dom0:03_00.0 does not exist", procedere come segue:

source: Open menu -> Service: sys-net -> sys-net: Qube Settings
de: Menü öffnen -> Dienst: sys-net -> sys-net: Qube-Einstellungen
it: Aprire il menu -> Servizio: sys-net -> sys-net: Impostazioni Qube

source: Go to Devices tab
de: Gehen Sie zur Registerkarte Geräte
it: Vai alla scheda Dispositivi

source: Remove “Unknown device” from the right side
de: Entfernen Sie "Unbekanntes Gerät" von der rechten Seite
it: Rimuovere "Dispositivo sconosciuto" dal lato destro

source: Add “Network controler” device
de: Gerät "Netzwerk-Controller" hinzufügen
it: Aggiungere il dispositivo "Controllore di rete

source: Click “OK” and restart the system.
de: Klicken Sie auf "OK" und starten Sie das System neu.
it: Cliccate su "OK" e riavviate il sistema.

source: Enable Network Settings, e.g. Wifi
de: Netzwerkeinstellungen aktivieren, z. B. Wifi
it: Abilitare le impostazioni di rete, ad esempio Wifi

source: To be able to use Wifi, Bluetooth and other functionalities, "Settings" must be activated in "sys-net".
de: Um Wifi, Bluetooth und andere Funktionalitäten nutzen zu können, müssen in "sys-net" "Einstellungen" aktiviert werden.
it: Per poter utilizzare Wifi, Bluetooth e altre funzionalità, "Settings" deve essere attivato in "sys-net".

source: Click on the top left Qubes Icon and select Qubes:Settings under sys-net.
de: Klicken Sie auf das Qubes-Symbol oben links und wählen Sie Qubes:Settings unter sys-net.
it: Clicca sull'icona Qubes in alto a sinistra e seleziona Qubes:Settings sotto sys-net.

source: Go to Applications, select "Settings" and click ">" to move it to the right side.
de: Gehen Sie zu Anwendungen, wählen Sie "Einstellungen" und klicken Sie auf ">", um es auf die rechte Seite zu verschieben.
it: Andate su Applicazioni, selezionate "Impostazioni" e cliccate ">" per spostarlo sul lato destro.

source: Click "Apply" and after wards "Ok".
de: Klicken Sie auf "Übernehmen" und anschließend auf "Ok".
it: Cliccate su "Apply" e poi su "Ok".

source: Now you should have "Settings" visible under sys-net.
de: Nun sollten Sie unter sys-net "Einstellungen" sehen.
it: Ora dovreste avere "Settings" visibile sotto sys-net.

source: If it won't open Settings after clicking on it, please follow the instructions below.
de: Wenn sich die Einstellungen nach dem Anklicken nicht öffnen lassen, folgen Sie bitte den nachstehenden Anweisungen.
it: Se non si apre Settings dopo averci cliccato sopra, segui le istruzioni qui sotto.

source: Fix sys-net Settings
de: sys-net Einstellungen reparieren
it: Fissare le impostazioni di sys-net

source: Go to the sys-net Terminal.
de: Gehen Sie zum sys-net Terminal.
it: Andate al terminale sys-net.

source: Open the bashrc-file with ``sudo vim ~/.bashrc``.
de: Öffnen Sie die bashrc-Datei mit ``sudo vim ~/.bashrc``.
it: Aprire il file bashrc con ``sudo vim ~/.bashrc``.

source: Press "i" to enable the editing and add ``export XDG_CURRENT_DESKTOP=GNOME`` to the file.
de: Drücken Sie "i", um die Bearbeitung zu aktivieren und fügen Sie ``export XDG_CURRENT_DESKTOP=GNOME`` in die Datei ein.
it: Premi "i" per abilitare l'editing e aggiungere ``export XDG_CURRENT_DESKTOP=GNOME`` al file.

source: Save the changes with ``:wq``.
de: Speichern Sie die Änderungen mit ``:wq``.
it: Salvate le modifiche con ``:wq``.

source: Restart your NitroPad.
de: Starten Sie Ihr NitroPad neu.
it: Riavvia il tuo NitroPad.

source: Now Settings should be visible.
de: Jetzt sollten die Einstellungen sichtbar sein.
it: Ora Impostazioni dovrebbe essere visibile.

source: Nitrokey App Installation
de: Installation Nitrokey-App
it: Installazione di Nitrokey App

source: Set in the "Qubes Settings" of sys-usb "Networking" to default and "Apply" the changes.
de: Setzen Sie in den "Qubes Settings" von sys-usb "Networking" auf Standard und "Apply" die Änderungen.
it: Impostare in "Qubes Settings" di sys-usb "Networking" su default e "Apply" le modifiche.

source: Set in the "Qubes Settings" of fedora template "Networking" to default and "Apply" the changes.
de: Setzen Sie in den "Qubes Settings" der Fedora-Vorlage "Networking" auf Standard und "Apply" die Änderungen.
it: Impostare nel "Qubes Settings" di fedora template "Networking" su default e "Apply" le modifiche.

source: Open the terminal of the fedora template and run ``sudo dnf install nitrokey-app``.
de: Öffnen Sie das Terminal der Fedora-Vorlage und führen Sie ``sudo dnf install nitrokey-app`` aus.
it: Aprire il terminale del modello fedora ed eseguire ``sudo dnf install nitrokey-app``.

source: Shut down the template.
de: Schalten Sie die Vorlage ab.
it: Spegnere il modello.

source: Restart all qubes based on the template.
de: Starten Sie alle Qubes auf der Grundlage der Vorlage neu.
it: Riavvia tutte le qubes basate sul modello.

source: Go to "Application" of sys-usb and select the Nitrokey App.
de: Gehen Sie zu "Anwendung" von sys-usb und wählen Sie die Nitrokey-App aus.
it: Vai su "Applicazione" di sys-usb e seleziona l'applicazione Nitrokey.

source: Click the arrow pointing to the right side to move it to the shortcuts and "Apply" the changes.
de: Klicken Sie auf den Pfeil, der nach rechts zeigt, um ihn zu den Verknüpfungen zu verschieben, und "Übernehmen" Sie die Änderungen.
it: Cliccate sulla freccia che punta a destra per spostarla nelle scorciatoie e "Apply" le modifiche.

source: Now you can access the Nitrokey App by clicking on sys-usb.
de: Jetzt können Sie auf die Nitrokey-App zugreifen, indem Sie auf sys-usb klicken.
it: Ora potete accedere all'App Nitrokey cliccando su sys-usb.

source: Verify Sealed Hardware
de: Versiegelte Hardware überprüfen
it: Verificare l'hardware sigillato

source: If you ordered your NitroPad with sealed screws and in a sealed bag, it allows you to check if the NitroPad has been tampered with during shipping.
de: Falls Sie Ihr NitroPad mit versiegelten Schrauben und im versiegelten Beutel bestellt haben, ermöglicht es Ihnen zu überprüfen, ob das NitroPad auf dem Versandwege manipuliert wurde.
it: Se hai ordinato il tuo NitroPad con viti sigillate e in un sacchetto sigillato, ti permette di controllare se il NitroPad è stato manomesso durante la spedizione.

source: The bag and all screws on the bottom of the device have been sealed. For the bag and each of these screws you have received a photo by e-mail. The orientation of the photos is such that the battery is on top.
de: Der Beutel und alle Schrauben auf der Unterseite des Gerätes wurden versiegelt. Für den Beutel und jede einzelne dieser Schrauben haben Sie ein Foto per E-Mail erhalten. Die Orientierung der Fotos ist so, dass sich der Akku oben befindet.
it: La borsa e tutte le viti sul fondo del dispositivo sono state sigillate. Per la borsa e ciascuna di queste viti avete ricevuto una foto via e-mail. L'orientamento delle foto è tale che la batteria è in alto.

source: Check each screw individually to see if its individual appearance matches the photo. It is best to use a magnifying glass or macro lens for this purpose. The screws are numbered as follows.
de: Überprüfen Sie jede Schraube einzeln, ob deren individuelles Aussehen mit dem Foto übereinstimmt. Verwenden Sie hierzu am besten eine Lupe oder Makro-Objektiv. Die Schrauben sind wie folgt nummeriert.
it: Controlla ogni vite individualmente per vedere se il suo aspetto individuale corrisponde alla foto. È meglio usare una lente d'ingrandimento o una lente macro per questo scopo. Le viti sono numerate come segue.

source: This example shows a sealed screw whose glitter represents an individual pattern.
de: Dies Beispiel zeigt eine versiegelte Schraube, deren Glitzer ein individuelles Muster darstellt.
it: Questo esempio mostra una vite sigillata il cui scintillio rappresenta un modello individuale.

source: If the bag or the screws do not match the photos sent, an unauthorized opening of your NitroPad cannot be excluded. In this case please contact us to arrange further action.
de: Sollten der Beutel oder die Schrauben nicht mit den zugesandten Fotos übereinstimmen, kann eine unberechtigte Öffnung Ihres NitroPad nicht ausgeschlossen werden. Kontaktieren Sie uns in diesem Fall, um weitere Maßnahmen zu vereinbaren.
it: Se la borsa o le viti non corrispondono alle foto inviate, non si può escludere un'apertura non autorizzata del tuo NitroPad. In questo caso contattateci per organizzare ulteriori azioni.

source: System update
it: Aggiornamento del sistema

source: The NitroPad watches for changes to important system files to detect third-party tampering. This means that special steps are sometimes necessary when updating the system. This can often be recognized by the fact that the system prompts you to reboot.
de: Das NitroPad achtet auf Änderungen an wichtigen Systemdateien, um Manipulationen durch Dritte zu erkennen. Dies bedeutet, dass bei der Aktualisierung des Systems manchmal besondere Schritte erforderlich sind. Dies ist oft daran zu erkennen, dass das System Sie zu einem Neustart auffordert.
it: NitroPad osserva le modifiche ai file di sistema importanti per rilevare la manomissione da parte di terzi. Questo significa che a volte sono necessari passi speciali quando si aggiorna il sistema. Questo può essere spesso riconosciuto dal fatto che il sistema ti chiede di riavviare.

source: Procedure After a System Update
de: Vorgehensweise nach einem System-Update
it: Procedura dopo un aggiornamento del sistema

source: Boot Hash Mismatch
it: Mismatch di hash di avvio

source: If you restart the NitroPad after an update, the startup screen should initially appear as usual without an error message.
de: Wenn Sie das NitroPad nach einem Update neu starten, sollte der Startbildschirm zunächst wie gewohnt ohne Fehlermeldung erscheinen.
it: Se riavviate NitroPad dopo un aggiornamento, la schermata di avvio dovrebbe inizialmente apparire come al solito senza un messaggio di errore.

source: If you press Enter afterwards, you will get an error message that looks like this or similar:
de: Wenn Sie anschließend die Eingabetaste drücken, erhalten Sie eine Fehlermeldung, die so oder ähnlich aussieht:
it: Se poi premete Invio, otterrete un messaggio di errore che assomiglia a questo o simile:

source: Confirm the message with Enter to have the files changed by the system update verified. Afterwards you will be asked again for a confirmation.
de: Bestätigen Sie die Meldung mit Enter, um die durch das Systemupdate geänderten Dateien zu verifizieren. Danach werden Sie erneut um eine Bestätigung gebeten.
it: Confermate il messaggio con Invio per far verificare i file modificati dall'aggiornamento del sistema. Dopodiché vi verrà chiesta di nuovo una conferma.

source: Now insert the Nitrokey if this is not already the case and confirm with Enter. Then you must enter the User PIN of the Nitrokey (default: 123456). You will not see the characters you typed in on the screen.
de: Stecken Sie nun den Nitrokey ein, falls dies nicht bereits der Fall ist, und bestätigen Sie mit Enter. Anschließend müssen Sie die Benutzer-PIN des Nitrokeys eingeben (Standard: 123456). Sie sehen die eingegebenen Zeichen nicht auf dem Bildschirm.
it: Ora inserite la Nitrokey se non è già così e confermate con Enter. Poi dovete inserire il PIN utente della Nitrokey (default: 123456). Non vedrete sullo schermo i caratteri che avete digitato.

source: Heads expects an English keyboard layout, on which e.g. “y” and “z” are swapped in comparison to the German keyboard layout. If you agree with the default selection (which is written in capital letter) you can also simply confirm by pressing Enter.
de: Heads erwartet eine englische Tastaturbelegung, bei der z. B. "y" und "z" im Vergleich zur deutschen Tastaturbelegung vertauscht sind. Wenn Sie mit der Standardauswahl (die in Großbuchstaben geschrieben ist) einverstanden sind, können Sie auch einfach mit Enter bestätigen.
it: Heads si aspetta un layout di tastiera inglese, in cui per esempio "y" e "z" sono scambiati rispetto al layout della tastiera tedesca. Se sei d'accordo con la selezione di default (che è scritta in maiuscolo) puoi anche semplicemente confermare premendo Invio.

source: Now the NitroPad marks the files changed by the update as verified.
de: Nun markiert das NitroPad die durch das Update geänderten Dateien als verifiziert.
it: Ora NitroPad segna i file cambiati dall'aggiornamento come verificati.

source: Boot Entry Has Changed
de: Booteingabe hat sich geändert
it: La voce di avvio è cambiata

source: Next, either another error message appears or the operating system starts. This depends on the system update. If the following error message appears, proceeds as described below:
de: Danach erscheint entweder eine weitere Fehlermeldung oder das Betriebssystem startet. Dies ist abhängig vom System-Update. Wenn die folgende Fehlermeldung erscheint, gehen Sie wie unten beschrieben vor:
it: Poi, o appare un altro messaggio di errore o si avvia il sistema operativo. Questo dipende dall'aggiornamento del sistema. Se appare il seguente messaggio di errore, procedete come descritto di seguito:

source: First confirm the error message shown above. Then we see a list of all possible boat entries - choose the first one by simply pressing Enter.
de: Bestätigen Sie zunächst die oben gezeigte Fehlermeldung. Dann sehen wir eine Liste mit allen möglichen Bootseinträgen - wählen Sie den ersten aus, indem Sie einfach die Eingabetaste drücken.
it: Prima confermate il messaggio di errore mostrato sopra. Poi vediamo una lista di tutte le possibili voci della barca - scegliete la prima premendo semplicemente Invio.

source: To save this value as default, select the option “Make Ubuntu the default” for Ubuntu or “Make Qubes the default” for Qubes OS in the next window.
de: Um diesen Wert als Standard zu speichern, wählen Sie im nächsten Fenster die Option "Make Ubuntu the default" für Ubuntu oder "Make Qubes the default" für Qubes OS.
it: Per salvare questo valore come predefinito, selezionate l'opzione "Make Ubuntu the default" per Ubuntu o "Make Qubes the default" per Qubes OS nella prossima finestra.

source: Now the Nitrokey has to be plugged in, if this is not yet the case.
de: Nun muss der Nitrokey eingesteckt werden, falls dies noch nicht der Fall ist.
it: Ora la Nitrokey deve essere collegata, se questo non è ancora il caso.

source: Confirm the question "Saving a default will modify the disk" with Y.
de: Bestätigen Sie die Frage "Durch das Speichern einer Vorgabe wird der Datenträger verändert" mit J.
it: Confermate la domanda "Salvare un default modificherà il disco" con Y.

source: Confirm the question "Do you wish to add a disk encryption to the TPM" with N.
de: Bestätigen Sie die Frage "Möchten Sie eine Festplattenverschlüsselung zum TPM hinzufügen" mit N.
it: Confermate la domanda "Volete aggiungere una crittografia del disco al TPM" con N.

source: Confirm the question "Please confirm that your GPG card is inserted" with Y.
de: Bestätigen Sie die Frage "Bitte bestätigen Sie, dass Ihre GPG-Karte eingelegt ist" mit Y.
it: Confermate la domanda "Confermate che la vostra scheda GPG è inserita" con Y.

source: Enter the User PIN of the Nitrokey whenever prompted (default: 123456).
de: Geben Sie die Benutzer-PIN des Nitrokeys ein, wenn Sie dazu aufgefordert werden (Standard: 123456).
it: Inserire il PIN utente della Nitrokey quando richiesto (default: 123456).

source: Troubleshooting
de: Fehlersuche
it: Risoluzione dei problemi

source: Here you will find a collection of common issues.
de: Hier finden Sie eine Sammlung von häufigen Problemen.
it: Qui troverete una raccolta di problemi comuni.

source: Starting in recovery shell
de: Starten in der Wiederherstellungs-Shell
it: Iniziare nel guscio di recupero

source: If your OS doesn’t boot as shown below, please execute the following steps:
de: Wenn Ihr Betriebssystem nicht wie unten gezeigt bootet, führen Sie bitte die folgenden Schritte aus:
it: Se il vostro sistema operativo non si avvia come mostrato di seguito, eseguite i seguenti passi:

source: Restart your Laptop and go to Options.
de: Starten Sie Ihren Laptop neu und gehen Sie zu Optionen.
it: Riavvia il tuo portatile e vai su Opzioni.

source: Select “Update Checksums and sign all files on /boot”.
de: Wählen Sie "Prüfsummen aktualisieren und alle Dateien auf /boot signieren".
it: Selezionate "Aggiorna le checksum e firma tutti i file su /boot".
