Repository: DamienCassou/nitrokey-documentation
Catalog: locales/*/LC_MESSAGES/nitropad.po
Languages: de, it

source: After that, please follow `these instructions <system-update.html>`_ from step 3 onwards.
de: Danach folgen Sie bitte `dieser Anleitung <system-update.html>`_ ab Schritt 3.
it: Dopo di che, seguite `queste istruzioni <system-update.html>`_ dal passo 3 in poi.

source: NitroPad doesn’t start
de: NitroPad lässt sich nicht starten
it: NitroPad non si avvia

source: If the Laptop does not start and only flashes briefly when switched on, please try the following steps:
de: Wenn der Laptop nicht startet und beim Einschalten nur kurz blinkt, versuchen Sie bitte die folgenden Schritte:
it: Se il portatile non si avvia e lampeggia solo brevemente all'accensione, provate i seguenti passi:

source: Try a hard reboot: Remove the power supply and battery and press and hold the power button for 20 seconds. Then reconnect the power supply and battery and start.
de: Versuchen Sie einen harten Neustart: Entfernen Sie das Netzteil und die Batterie und halten Sie den Netzschalter 20 Sekunden lang gedrückt. Schließen Sie dann die Stromversorgung und die Batterie wieder an und starten Sie.
it: Provate un riavvio difficile: Rimuovere l'alimentatore e la batteria e tenere premuto il pulsante di accensione per 20 secondi. Poi ricollegate l'alimentatore e la batteria e avviate.

source: If this did not work: Remove the battery or start only with the power supply connected.
de: Wenn dies nicht funktioniert hat: Entfernen Sie die Batterie oder starten Sie nur mit angeschlossener Spannungsversorgung.
it: Se questo non funziona: Rimuovere la batteria o avviare solo con l'alimentazione collegata.

source: You could also try removing the RAMs and reinserting them.
de: Sie könnten auch versuchen, die RAMs zu entfernen und wieder einzusetzen.
it: Potresti anche provare a rimuovere le RAM e reinserirle.

source: Invalid Code
de: Ungültiger Code
it: Codice non valido

source: Each boot the code is generated on the Nitropad and the Nitrokey, if its connected. It is allowed to run 10 boots without loosing the synchronization between the devices, after which the bad code signal is shown, regardless of the rest of the system being in a correct state. If you are sure the system was not beign tampered with (e.g. the Nitropad was booted more than 10 times without the Nitrokey), you can safely reset the system’s warning.
de: Bei jedem Booten wird der Code auf dem Nitropad und dem Nitrokey generiert, sofern dieser angeschlossen ist. Es dürfen 10 Boote durchgeführt werden, ohne dass die Synchronisation zwischen den Geräten verloren geht, danach wird das Signal für den schlechten Code angezeigt, unabhängig davon, ob der Rest des Systems in einem korrekten Zustand ist. Wenn Sie sicher sind, dass das System nicht manipuliert wurde (z. B. das Nitropad wurde mehr als 10 Mal ohne den Nitrokey gebootet), können Sie die Warnung des Systems sicher zurücksetzen.
it: Ad ogni avvio il codice viene generato sul Nitropad e sulla Nitrokey, se è collegata. E' permesso eseguire 10 boot senza perdere la sincronizzazione tra i dispositivi, dopo di che viene mostrato il segnale di cattivo codice, indipendentemente dal fatto che il resto del sistema sia in uno stato corretto. Se siete sicuri che il sistema non sia stato manomesso (ad esempio il Nitropad è stato avviato più di 10 volte senza la Nitrokey), potete tranquillamente resettare l'avviso del sistema.

source: Please connect the Nitrokey and execute the following from the main boot screen:
de: Bitte schließen Sie den Nitrokey an und führen Sie im Hauptstartbildschirm Folgendes aus:
it: Collegate la Nitrokey ed eseguite quanto segue dalla schermata di avvio principale:

source: Options
de: Optionen
it: Opzioni

source: TPM/TOTP/HOTP Options
de: TPM/TOTP/HOTP-Optionen
it: Opzioni TPM/TOTP/HOTP

source: Generate new TOTP/HOTP secret
de: Neues TOTP/HOTP-Geheimnis generieren
it: Generare un nuovo segreto TOTP/HOTP

source: and follow the on-screen guide. After that the secret and counter should be both reset to a new value.
de: und folgen Sie der Anleitung auf dem Bildschirm. Danach sollten sowohl das Geheimnis als auch der Zähler auf einen neuen Wert zurückgesetzt sein.
it: e seguite la guida sullo schermo. Dopo di che il segreto e il contatore dovrebbero essere entrambi resettati ad un nuovo valore.

source: Change Disk Encryption Passphrase
de: Passphrase für Festplattenverschlüsselung ändern
it: Cambiare la passphrase di crittografia del disco

source: To change the passphrase for disk encryption, first click on “Activities” in the upper left corner and enter “disk” in the search bar. Then select the “Disks” program that appears in the middle of the screen.
de: Um die Passphrase für die Festplattenverschlüsselung zu ändern, klicken Sie zunächst links oben auf "Aktivitäten" und geben Sie "Datenträger" in die Suchleiste ein. Wählen Sie dann das Programm "Datenträger", das in der Mitte des Bildschirms erscheint.
it: Per cambiare la passphrase per la crittografia del disco, clicca prima su "Attività" in alto a sinistra e inserisci "disco" nella barra di ricerca. Poi seleziona il programma "Dischi" che appare al centro dello schermo.

source: Select the field that says “Luks”. Afterwards it should have an orange background.
de: Wählen Sie das Feld aus, auf dem "Luks" steht. Danach sollte es einen orangefarbenen Hintergrund haben.
it: Seleziona il campo che dice "Luks". In seguito dovrebbe avere uno sfondo arancione.

source: Left click on the gears and select “Change Passphrase” from the context menu.
de: Klicken Sie mit der linken Maustaste auf die Zahnräder und wählen Sie im Kontextmenü "Passphrase ändern".
it: Cliccate con il tasto sinistro del mouse sugli ingranaggi e selezionate "Change Passphrase" dal menu contestuale.

source: Enter “PleaseChangeMe” as the current passphrase and select a secure new one.
de: Geben Sie "PleaseChangeMe" als aktuelle Passphrase ein und wählen Sie eine sichere neue Passphrase.
it: Inserisci "PleaseChangeMe" come passphrase attuale e seleziona una nuova frase sicura.

source: Enter the your account password.
de: Geben Sie das Passwort für Ihr Konto ein.
it: Inserisci la password del tuo account.

source: NitroPad with Ubuntu Linux
de: NitroPad mit Ubuntu Linux
it: NitroPad con Ubuntu Linux

source: Change the passphrase for disk encryption as `described here <change-disk-encryption-passphrase.html>`_. This passphrase is different from your user acount's passphrase.
de: Ändern Sie die Passphrase für die Festplattenverschlüsselung wie hier `beschrieben <change-disk-encryption-passphrase.html>`_. Diese Passphrase unterscheidet sich von der Passphrase Ihres Benutzerkontos'.
it: Cambia la passphrase per la crittografia del disco come ` descritto qui <change-disk-encryption-passphrase.html>`_. Questa passphrase è diversa da quella del tuo account utente.

source: Windows: `Rufus <https://rufus.ie/>`_, `balenaEtcher <https://www.balena.io/etcher/>`_;
de: Fenster: `Rufus <https://rufus.ie/>`_, `balenaEtcher <https://www.balena.io/etcher/>`_;
