Repository: DamienCassou/nitrokey-documentation
Catalog: locales/*/LC_MESSAGES/nitropad.po
Languages: de, it

source: Connect your NitroPad to a power plug and load its battery to over 70%
de: Schließen Sie Ihr NitroPad an eine Steckdose an und laden Sie seinen Akku auf über 70 % auf
it: Collega il tuo NitroPad a una presa di corrente e carica la sua batteria oltre il 70%.

source: Download the `latest firmware <https://github.com/Nitrokey/heads/releases/latest>`_ and store it on a USB drive. For the NitroPad T430 use ``nitropad-t430-[version].npf`` and for the NitroPad X230 use ``nitropad-x230-[version].npf``.
de: Laden Sie die `neueste Firmware <https://github.com/Nitrokey/heads/releases/latest>`_ herunter und speichern Sie sie auf einem USB-Laufwerk. Für das NitroPad T430 verwenden Sie ``nitropad-t430-[version].npf`` und für das NitroPad X230 verwenden Sie ``nitropad-x230-[version].npf``.
it: Scaricare il ` firmware più recente <https://github.com/Nitrokey/heads/releases/latest>`_ e salvarlo su una chiavetta USB. Per il NitroPad T430 usare ``nitropad-t430-[version].npf`` e per il NitroPad X230 usare ``nitropad-x230-[version].npf``.

source: For hash sum verification, store ``sha256sum`` file at the USB drive.
de: Zur Überprüfung der Hashsumme speichern Sie die Datei ``sha256sum`` auf dem USB-Laufwerk.
it: Per la verifica della somma hash, memorizzare il file ``sha256sum`` sul drive USB.

source: Firmware file verification
de: Überprüfung der Firmware-Datei
it: Verifica del file del firmware

source: It is mandatory to run a firmware file consistency check before writing it to the device. After copying the firmware file to the USB drive make sure the latter is properly unmounted/ejected to avoid write issues. The consistency check should be run on NitroPad, so the data verified will be exact same as the later read by the update application. This action will not be required in the further firmware updates.
de: Es ist zwingend erforderlich, eine Konsistenzprüfung der Firmware-Datei durchzuführen, bevor sie auf das Gerät geschrieben wird. Stellen Sie nach dem Kopieren der Firmware-Datei auf das USB-Laufwerk sicher, dass dieses ordnungsgemäß ausgehängt/ausgeworfen wird, um Schreibprobleme zu vermeiden. Die Konsistenzprüfung sollte auf dem NitroPad durchgeführt werden, damit die geprüften Daten exakt mit den später von der Update-Anwendung gelesenen übereinstimmen. Diese Aktion wird bei den weiteren Firmware-Updates nicht mehr erforderlich sein.
it: È obbligatorio eseguire un controllo di coerenza del file del firmware prima di scriverlo sul dispositivo. Dopo aver copiato il file del firmware sul drive USB, assicuratevi che quest'ultimo sia smontato/espulso correttamente per evitare problemi di scrittura. Il controllo di consistenza dovrebbe essere eseguito su NitroPad, in modo che i dati verificati siano esattamente gli stessi che verranno poi letti dall'applicazione di aggiornamento. Questa azione non sarà richiesta nei successivi aggiornamenti del firmware.

source: Start Nitropad and open recovery console from ``Options -> Exit to recovery shell``
de: Starten Sie Nitropad und öffnen Sie die Wiederherstellungskonsole über ``Optionen -> Beenden zur Wiederherstellungsshell``
it: Avviare Nitropad e aprire la console di recupero da ``Options -> Exit to recovery shell``

source: Execute the following to verify the firmware:
de: Führen Sie Folgendes aus, um die Firmware zu überprüfen:
it: Eseguite quanto segue per verificare il firmware:

source: For ``v1.1-rc3`` version this should result in:
de: Für die Version ``v1.1-rc3`` sollte dies zur Folge haben:
it: Per la versione ``v1.1-rc3`` questo dovrebbe risultare:

source: This confirms the content of the file is as expected. Please reboot the Nitropad to continue (either by switching off and powering on again, or hitting CTRL+ALT+DELETE).
de: Dies bestätigt, dass der Inhalt der Datei wie erwartet ist. Bitte starten Sie das Nitropad neu, um fortzufahren (entweder durch Ausschalten und erneutes Einschalten oder durch Drücken von STRG+ALT+ELETE).
it: Questo conferma che il contenuto del file è quello previsto. Riavvia il Nitropad per continuare (o spegnendo e riaccendendo, o premendo CTRL+ALT+CANC).

source: This is the actual update procedure. Usually the first two screens will not be shown - in that case please start from step 3.
de: Dies ist der eigentliche Update-Vorgang. Normalerweise werden die ersten beiden Bildschirme nicht angezeigt - in diesem Fall beginnen Sie bitte mit Schritt 3.
it: Questa è la procedura di aggiornamento vera e propria. Di solito le prime due schermate non vengono mostrate - in tal caso si prega di iniziare dal passo 3.

source: (Optional screen) Select “Ignore error and continue to default boot menu”.
de: (Optionaler Bildschirm) Wählen Sie "Fehler ignorieren und mit dem Standard-Bootmenü fortfahren".
it: (Schermo opzionale) Selezionare "Ignora l'errore e continua al menu di avvio predefinito".

source: Go to “Options”.
de: Gehen Sie zu "Optionen".
it: Vai a "Opzioni".

source: Select “Flash/Update the BIOS”.
de: Wählen Sie "Flash/Update des BIOS".
it: Selezionate "Flash/Update the BIOS".

source: Please confirm the first option.
de: Bitte bestätigen Sie die erste Option.
it: Si prega di confermare la prima opzione.

source: Select the desired .npf file.
de: Wählen Sie die gewünschte .npf-Datei aus.
it: Selezionate il file .npf desiderato.

source: Confirm the restart with Enter.
de: Bestätigen Sie den Neustart mit Enter.
it: Confermate il riavvio con Enter.

source: You have successfully updated your firmware!
de: Sie haben Ihre Firmware erfolgreich aktualisiert!
it: Hai aggiornato con successo il tuo firmware!

source: Further steps
de: Weitere Schritte
it: Ulteriori passi

source: In case ``ERROR: TOTP Generation Failed!`` screen will show up, please follow the instructions for Factory Reset (on the left side menu), starting from step 11.
de: Falls der Bildschirm ``ERROR: TOTP Generation Failed!`` angezeigt wird, folgen Sie bitte den Anweisungen für den Factory Reset (im Menü auf der linken Seite), beginnend mit Schritt 11.
it: Nel caso in cui venga visualizzata la schermata ``ERROR: TOTP Generation Failed!``, si prega di seguire le istruzioni per il Factory Reset (nel menu a sinistra), partendo dal passo 11.

source: Firmware Update v1.4+
de: Firmware-Aktualisierung v1.4+
it: Aggiornamento firmware v1.4+

source: Starting with v1.4 due to elementary changes inside Heads and the firmware layout, the update requires some additional considerations. This applies for both NitroPads X230 and T430.
de: Beginnend mit v1.4 erfordert das Update aufgrund elementarer Änderungen in Heads und dem Firmware-Layout einige zusätzliche Überlegungen. Dies gilt sowohl für NitroPads X230 als auch für T430.
it: A partire dalla v1.4 a causa di cambiamenti elementari all'interno di Heads e del layout del firmware, l'aggiornamento richiede alcune considerazioni aggiuntive. Questo vale per entrambi i NitroPad X230 e T430.

source: Should I update my NitroPad?
de: Sollte ich mein NitroPad aktualisieren?
it: Devo aggiornare il mio NitroPad?

source: When updating your firmware to 1.4 (without using an external flasher device) the graphical HEADS dialogues will be replaced with a less convenient text-only version.
de: Wenn Sie Ihre Firmware auf 1.4 aktualisieren (ohne ein externes Flasher-Gerät zu verwenden), werden die grafischen HEADS-Dialoge durch eine weniger komfortable reine Textversion ersetzt.
it: Quando si aggiorna il firmware alla 1.4 (senza usare un dispositivo esterno di flasher) i dialoghi grafici HEADS saranno sostituiti da una versione meno comoda di solo testo.

source: If you use Ubuntu, Debian, LinuxMint, or Qubes 4.0 updating the firmware beyond v1.3.1 is (as of today) not needed. If you use Qubes 4.1 *without* the integrated Ethernet port, you don't need to update the firmware either.
de: Wenn Sie Ubuntu, Debian, LinuxMint oder Qubes 4.0 verwenden, ist eine Aktualisierung der Firmware über v1.3.1 hinaus (ab heute) nicht erforderlich. Wenn Sie Qubes 4.1 *ohne* den integrierten Ethernet-Port verwenden, müssen Sie die Firmware ebenfalls nicht aktualisieren.
it: Se usi Ubuntu, Debian, LinuxMint, o Qubes 4.0 aggiornare il firmware oltre la v1.3.1 non è (ad oggi) necessario. Se usi Qubes 4.1 *senza* la porta Ethernet integrata, non hai nemmeno bisogno di aggiornare il firmware.

source: If you want to use Qubes 4.1 or newer *and* the integrated Ethernet port you need to update the firmware to 1.4.
de: Wenn Sie Qubes 4.1 oder neuer *und* den integrierten Ethernet-Anschluss verwenden möchten, müssen Sie die Firmware auf 1.4 aktualisieren.
it: Se vuoi usare Qubes 4.1 o più recente *e* la porta Ethernet integrata devi aggiornare il firmware alla 1.4.

source: If the `.npf` file is not accepted by HEADS, likely you do not run the latest HEADS version. So either 1st update to version 1.3.1 or `unzip` the `.npf` file and use the resulting `.rom` file instead.
de: Wenn die `.npf`-Datei von HEADS nicht akzeptiert wird, haben Sie wahrscheinlich nicht die neueste HEADS-Version. Aktualisieren Sie also entweder auf Version 1.3.1 oder `entpacken` Sie die `.npf`-Datei und verwenden Sie stattdessen die resultierende `.rom`-Datei.
it: Se il file `.npf` non viene accettato da HEADS, è probabile che tu non abbia l'ultima versione di HEADS. Quindi o aggiorni alla versione 1.3.1 o "scompatti" il file `.npf` e usi invece il file `.rom` risultante.

source: How can I update my NitroPad?
de: Wie kann ich mein NitroPad aktualisieren?
it: Come posso aggiornare il mio NitroPad?

source: Updating from ``v1.3.1`` onwards has two different ways:
de: Für die Aktualisierung ab ``v1.3.1`` gibt es zwei verschiedene Möglichkeiten:
it: L'aggiornamento da ``v1.3.1`` in poi ha due modi diversi:

source: Legacy update using either ``nitropad-t430-v1.4.npf`` or ``nitropad-x230-v1.4.npf`` from the Heads menu, see: :doc:`firmware-update`
de: Legacy-Update entweder mit ``nitropad-t430-v1.4.npf`` oder ``nitropad-x230-v1.4.npf`` aus dem Heads-Menü, siehe: :doc:`firmware-update`
it: Aggiornamento legacy usando o ``nitropad-t430-v1.4.npf`` o ``nitropad-x230-v1.4.npf`` dal menu Heads, vedi: :doc:`firmware-update`

source: When using an external flasher device you can use the ``-maximized`` images. This keeps graphical HEADS dialogues working. Read about the external flashing below.
de: Wenn Sie einen externen Flasher verwenden, können Sie die ``-maximierten`` Bilder benutzen. Dadurch funktionieren die grafischen HEADS-Dialoge weiterhin. Lesen Sie unten über das externe Flashen.
it: Quando si usa un dispositivo flasher esterno si possono usare le immagini ``-maximized``. Questo mantiene i dialoghi grafici HEADS funzionanti. Leggi di seguito il flashing esterno.

source: Never try updating your NitroPad using the `-maximized` image, if you do not know exactly what you are doing! You will brick your NitroPad and it can only be repaired using an external flasher!
de: Versuchen Sie niemals, Ihr NitroPad mit dem `maximierten` Image zu aktualisieren, wenn Sie nicht genau wissen, was Sie tun! Sie werden Ihr NitroPad zerstören und es kann nur mit einem externen Flasher repariert werden!
it: Non provi mai ad aggiornare il vostro NitroPad usando l'immagine `-massimizzata`, se non sapete esattamente che cosa state facendo! Mattonerete il vostro NitroPad e può essere riparato soltanto usando un flasher esterno!

source: How can I update to *-maximized*?
de: Wie kann ich auf *-maximiert* aktualisieren?
it: Come posso aggiornare a *-massimizzato*?

source: We highly recommend to NOT DO THIS ON YOUR OWN, as long as you are not exactly know what you are doing!
de: Wir empfehlen dringend, dies NICHT SELBST zu tun, solange Sie nicht genau wissen, was Sie tun!
it: Raccomandiamo vivamente di NON FARE QUESTO DA SOLI, finché non si sa esattamente cosa si sta facendo!

source: We have a service to do this upgrade on your NitroPad, please write an e-mail to "shop at nitrokey.com" together with your sales order number (SOxxxxxx).
de: Wir haben einen Service, um dieses Upgrade für Ihr NitroPad durchzuführen. Bitte schreiben Sie eine E-Mail an "shop at nitrokey.com" zusammen mit Ihrer Bestellnummer (SOxxxxxx).
it: Abbiamo un servizio per fare questo aggiornamento sul tuo NitroPad, scrivi una e-mail a "shop at nitrokey.com" insieme al tuo numero di ordine di vendita (SOxxxxxx).

source: The following procedure describes roughly how to flash your NitroPad using an external flasher - it is intentionally on a high level as we do not recommend doing this process on your own. But for the sake of completeness we document this here for the curios.
de: Das folgende Verfahren beschreibt grob, wie Sie Ihr NitroPad mit einem externen Flasher flashen können - es ist absichtlich auf hohem Niveau, da wir nicht empfehlen, diesen Prozess selbst durchzuführen. Aber der Vollständigkeit halber dokumentieren wir dies hier für die Neugierigen.
it: La seguente procedura descrive approssimativamente come flashare il vostro NitroPad usando un flasher esterno - è intenzionalmente ad alto livello in quanto non raccomandiamo di fare questo processo da soli. Ma per il bene della completezza documentiamo questo qui per i curiosi.

source: Make sure you have a (``flashrom``) compatible flasher like ``ch341a_spi`` with a SOIC-8 clamp.
de: Stellen Sie sicher, dass Sie einen (``flashrom``) kompatiblen Flasher wie ``ch341a_spi`` mit einer SOIC-8 Klemme haben.
it: Assicurati di avere un (``flashrom``) flasher compatibile come ``ch341a_spi`` con un morsetto SOIC-8.

source: Open the device (`see coreboot docs <https://doc.coreboot.org/mainboard/lenovo/Ivy_Bridge_series.html>`_) and make sure you can access both flash chips.
de: Öffnen Sie das Gerät (`siehe coreboot docs <https://doc.coreboot.org/mainboard/lenovo/Ivy_Bridge_series.html>`_) und stellen Sie sicher, dass Sie auf beide Flash-Chips zugreifen können.
it: Aprite il dispositivo (` vedi coreboot docs <https://doc.coreboot.org/mainboard/lenovo/Ivy_Bridge_series.html>`_) e assicuratevi di poter accedere a entrambi i chip flash.

source: Using ``flashrom`` read out the **bottom** flash (the 8MB image)
de: Mit ``flashrom`` den **untersten** Flash auslesen (das 8MB Image)
it: Usando ``flashrom`` leggete la flash **bottom** (l'immagine da 8MB)

source: Using ``ifdtool`` (`coreboot ifdtool docs <https://doc.coreboot.org/ifdtool/index.html>`_) extract the ``GbE`` flashregion from the image and replace the ``GbE``-region inside your ``-maximized`` image.
de: Mit ``ifdtool`` (`coreboot ifdtool docs <https://doc.coreboot.org/ifdtool/index.html>`_) die ``GbE`` flashregion aus dem Bild und ersetzen die ``GbE``-Region innerhalb Ihres ``-maximized``-Bildes.
it: Usando ``ifdtool`` (`coreboot ifdtool docs <https://doc.coreboot.org/ifdtool/index.html>`_) estrarre la ``GbE`` flashregion dall'immagine e sostituire la ``GbE``-all'interno della vostra ``-maximized`` immagine.

source: Split the modified firmware image using ``dd`` (as described in the coreboot documentation) into ``-top`` and ``-bottom``
de: Teilen Sie das modifizierte Firmware-Image mit ``dd`` (wie in der coreboot-Dokumentation beschrieben) in ``-top`` und ``-bottom`` auf
it: Dividere l'immagine del firmware modificato usando ``dd`` (come descritto nella documentazione di coreboot) in ``-top`` e ``-bottom``

source: Flash the images to the matching flash chips using your flasher and clamp
de: Übertragen Sie die Bilder mit Hilfe Ihres Blitzgerätes und einer Klemme auf die entsprechenden Blitzchips
it: Flashate le immagini sui chip flash corrispondenti usando il vostro lampeggiatore e il morsetto

source: Reboot into your system (you should see ``-maximized`` inside the Heads menu)
de: Starten Sie Ihr System neu (Sie sollten ``-maximized`` im Heads Menü sehen)
it: Riavvia il tuo sistema (dovresti vedere ``-maximized`` dentro il menu Heads)

source: Background information
de: Hintergrundinformationen
it: Informazioni di base

source: The new firmware *class* of ``-maximized`` images change the firmware layout in a way that it is incompatible with Heads' internal firmware upgrade feature on the NitroPads.
de: Die neue Firmware *Klasse* der ``-maximierten`` Images verändert das Firmware-Layout so, dass es mit Heads interner Firmware-Upgrade-Funktion auf den NitroPads nicht kompatibel ist.
it: La nuova *classe* di firmware delle immagini ``-maximized`` cambia il layout del firmware in un modo che è incompatibile con Heads' funzione interna di aggiornamento del firmware sui NitroPad.

source: This change mainly originates from a reduces *Management Engine* size inside the firmware image. Furthermore the ``-maximized`` images do contain all flash regions inside the firmware, this also includes ``GbE``, which contains the Ethernet MAC address.
de: Diese Änderung hat ihren Ursprung hauptsächlich in einer verringerten Größe der *Management Engine* innerhalb des Firmware-Images. Außerdem enthalten die ``maximierten`` Images alle Flash-Regionen innerhalb der Firmware, dazu gehört auch ``GbE``, das die Ethernet-MAC-Adresse enthält.
it: Questo cambiamento deriva principalmente da una riduzione delle dimensioni del *Management Engine* all'interno dell'immagine del firmware. Inoltre le immagini ``-maximized`` contengono tutte le regioni flash all'interno del firmware, questo include anche ``GbE``, che contiene il MAC address Ethernet.

source: The non ``-maximized`` images have no **functional** differences compared to the ``-maximized`` images except of the reduced Heads GUI.
de: Die nicht ``maximierten`` Bilder haben keine **funktionalen** Unterschiede zu den ``maximierten`` Bildern, mit Ausnahme der reduzierten Heads GUI.
it: Le immagini non ``-maximized`` non hanno differenze **funzionali** rispetto alle immagini ``-maximized`` tranne la GUI ridotta di Heads.

source: First check the:
de: Prüfen Sie zunächst die:
it: Prima controlla il:

source: or choose your operating system:
de: oder wählen Sie Ihr Betriebssystem:
it: o scegliete il vostro sistema operativo:

source: Operating System Reinstallation
de: Neuinstallation des Betriebssystems
it: Reinstallazione del sistema operativo

source: Booting this USB drive entirely erases all data on the hard disk or SSD of the NitroPad without further warning. Don’t boot this USB drive on any computer which contains data you want to keep. Make sure to format the USB drive after the intended use.
de: Durch das Booten dieses USB-Laufwerks werden alle Daten auf der Festplatte oder SSD des NitroPad ohne weitere Warnung vollständig gelöscht. Booten Sie dieses USB-Laufwerk nicht auf einem Computer, der Daten enthält, die Sie behalten möchten. Stellen Sie sicher, dass Sie das USB-Laufwerk nach der beabsichtigten Verwendung formatieren.
it: L'avvio di questo drive USB cancella completamente tutti i dati sul disco rigido o SSD del NitroPad senza ulteriore avviso. Non avviare questo drive USB su un computer che contiene dati che vuoi conservare. Assicurati di formattare il drive USB dopo l'uso previsto.

source: Download one of the operating system images: `Ubuntu Linux <https://www.nitrokey.com/files/ci/nitropad/ubuntu-oem/>`_, `Qubes OS <https://www.nitrokey.com/files/ci/nitropad/qubes-oem/>`_, `Debian <https://www.nitrokey.com/files/ci/nitropad/debian-oem/>`_, `Linux Mint <https://linuxmint.com/download.php>`_
de: Laden Sie eines der Betriebssystem-Images herunter: `Ubuntu Linux <https://www.nitrokey.com/files/ci/nitropc/ubuntu-oem/>`__, `Qubes OS <https://www.nitrokey.com/files/ci/nitropc/qubes-oem/>`__, `Debian <https://www.nitrokey.com/files/ci/nitropc/debian-oem/>`__, `Linux Mint <https://www.nitrokey.com/files/linuxmint/latest.iso>`__
it: Scaricare una delle immagini del sistema operativo: `Ubuntu Linux <https://www.nitrokey.com/files/ci/nitropad/ubuntu-oem/>`_, `Qubes OS <https://www.nitrokey.com/files/ci/nitropad/qubes-oem/>`_, `Debian <https://www.nitrokey.com/files/ci/nitropad/debian-oem/>`_, `Linux Mint <https://linuxmint.com/download.php>`_

source: Optional: Download hash sum and `verify <https://proprivacy.com/guides/how-why-and-when-you-should-hash-check#how-to-hash-check>`_ the downloaded operating system image.
de: Optional: Download der Hash-Summe und `Verifizierung <https://proprivacy.com/guides/how-why-and-when-you-should-hash-check#how-to-hash-check>`__ des heruntergeladenen Betriebssystem-Images.
it: Opzionale: Scarica la somma dell'hash e ` verifica <https://proprivacy.com/guides/how-why-and-when-you-should-hash-check#how-to-hash-check>`_ l'immagine del sistema operativo scaricata.

source: Write the operating system image to any USB drive. Possible applications:
de: Schreiben Sie das Image des Betriebssystems auf ein beliebiges USB-Laufwerk. Mögliche Anwendungen:
it: Scrivere l'immagine del sistema operativo su qualsiasi unità USB. Possibili applicazioni:

source: Connect the USB drive to your NitroPad and start it. In Heads menu select Boot Options -> USB Boot.
de: Schließen Sie das USB-Laufwerk an Ihr NitroPad an und starten Sie es. Wählen Sie im Heads-Menü Boot Options -> USB Boot.
it: Collega il drive USB al tuo NitroPad e avvialo. Nel menu Heads seleziona Boot Options -> USB Boot.

source: Depending on the operating system you may need to confirm its reinstallation.
de: Je nach Betriebssystem müssen Sie eventuell dessen Neuinstallation bestätigen.
it: A seconda del sistema operativo potrebbe essere necessario confermare la sua reinstallazione.

source: `Sign the boot partition. <system-update.html>`_
de: `Signieren Sie die Boot-Partition. <system-update.html>`_
it: `Significa la partizione di avvio. <system-update.html>`_

source: To avoid accidential overwriting of valuable data, format the USB drive afterwards.
de: Um ein versehentliches Überschreiben wertvoller Daten zu vermeiden, formatieren Sie das USB-Laufwerk anschließend.
it: Per evitare la sovrascrittura accidentale di dati importanti, formattate il drive USB dopo.

source: Change User and Admin PIN
de: Benutzer- und Admin-PIN ändern
it: Cambiare il PIN dell'utente e dell'amministratore

source: User PIN
de: Benutzer-PIN
it: PIN utente

source: The user PIN is at least 6-digits long and is used to get access to the content of the Nitrokey. This is the PIN you will use a lot in every day use e.g. for decrypting messages, for unlocking your encrypted storage (NK Storage only) etc.
de: Die Benutzer-PIN ist mindestens 6-stellig und wird verwendet, um Zugriff auf den Inhalt des Nitrokeys zu erhalten. Dies ist die PIN, die Sie im täglichen Gebrauch häufig verwenden werden, z. B. zum Entschlüsseln von Nachrichten, zum Entsperren Ihres verschlüsselten Speichers (nur NK Storage) usw.
it: Il PIN utente è lungo almeno 6 cifre e viene utilizzato per accedere al contenuto della Nitrokey. Questo è il PIN che userai spesso nell'uso quotidiano, ad esempio per decifrare i messaggi, per sbloccare il tuo archivio criptato (solo NK Storage) ecc.

source: You can change the user PIN with the Nitrokey App if using a Nitrokey Pro or Nitrokey Storage. In the `Nitrokey <https://www.nitrokey.com/download>`_ App open ‘Menu -> Configure -> Change User PIN’ to open the dialog to change the PIN.
de: Sie können die Benutzer-PIN mit der Nitrokey App ändern, wenn Sie einen Nitrokey Pro oder Nitrokey Storage verwenden. Öffnen Sie in der `Nitrokey <https://www.nitrokey.com/download>`_ App "Menü -> Konfigurieren -> Benutzer-PIN ändern", um den Dialog zum Ändern der PIN zu öffnen.
it: Puoi cambiare il PIN utente con l'App Nitrokey se usi una Nitrokey Pro o Nitrokey Storage. Nell'app `Nitrokey <https://www.nitrokey.com/download>`_ apri 'Menu -> Configure -> Change User PIN' per aprire la finestra di dialogo per cambiare il PIN.

source: You can change the User PIN in the dialog window now.
de: Sie können die Benutzer-PIN jetzt im Dialogfenster ändern.
it: Ora puoi cambiare il PIN utente nella finestra di dialogo.
