Repository: DamienCassou/nitrokey-documentation
Catalog: locales/*/LC_MESSAGES/nitrophone.po
Languages: it

source: NitroPhone Apps
it: App NitroPhone

source: For very high security requirements, you should use as few apps as possible to provide a small attack surface. If instead you want to use the NitroPhone as an everyday smartphone with more apps we recommend:
it: Per esigenze di sicurezza molto elevate, dovreste usare il minor numero possibile di app per fornire una piccola superficie di attacco. Se invece vuoi usare il NitroPhone come uno smartphone di tutti i giorni con più app ti consigliamo:

source: Install the `F-Droid <https://f-droid.org/F-Droid.apk>`_ App Store. This has exclusively open source apps that do without drastic tracking and without advertising. Here you will find thousands of apps from a wide variety of fields. If you are looking for an app, check F-Droid first.
it: Installare il `F-Droid <https://f-droid.org/F-Droid.apk>`_ App Store. Questo ha esclusivamente applicazioni open source che fanno a meno del tracciamento drastico e senza pubblicità. Qui troverete migliaia di app da una grande varietà di campi. Se stai cercando un'app, controlla prima F-Droid.

source: If the apps in F-Droid are not enough for you, open F-Droid and install Aurora Store. In Aurora Store, you can install all apps from Google Play Store.
it: Se le applicazioni in F-Droid non sono sufficienti per te, apri F-Droid e installa Aurora Store. In Aurora Store, puoi installare tutte le app di Google Play Store.

source: Many apps work without Google Play Services. However, if you want to use apps that require Google Play Services, you can install `Google Play Services in a sandbox <https://grapheneos.org/usage#sandboxed-play-services>`_ as follows. In the future, an installer will be provided to simplify the installation process.
it: Molte app funzionano senza Google Play Services. Tuttavia, se vuoi usare app che richiedono Google Play Services, puoi installare `Google Play Services in una sandbox <https://grapheneos.org/usage#sandboxed-play-services>`_ come segue. In futuro, verrà fornito un programma di installazione per semplificare il processo di installazione.

source: Install `com.google.android.gsf <https://apps.grapheneos.org/packages/com.google.android.gsf/>`_.
it: Installare `com.google.android.gsf <https://apps.grapheneos.org/packages/com.google.android.gsf/>`_.

source: Install `com.google.android.gms <https://apps.grapheneos.org/packages/com.google.android.gms/>`_.
it: Installare `com.google.android.gms <https://apps.grapheneos.org/packages/com.google.android.gms/>`_.

source: Download all 5 files from `com.android.vending <https://apps.grapheneos.org/packages/com.android.vending/>`_.
it: Scarica tutti i 5 file da `com.android.vending <https://apps.grapheneos.org/packages/com.android.vending/>`_.

source: Open F-Droid and install Split APKs Installer (SAI). (Also available from the Aurora Store)
it: Aprire F-Droid e installare Split APKs Installer (SAI). (Disponibile anche su Aurora Store)

source: Open Split APKs Installer and install all five files you downloaded in step 3. **Note:** The correct base file has probably been renamed to ``base (2).apk``.
it: Aprite Split APKs Installer e installate tutti e cinque i file che avete scaricato al punto 3. **Nota:** Il file base corretto è stato probabilmente rinominato in ``base (2).apk``.

source: From the home screen, select: *Settings -> Apps -> Google Play services and disable battery optimization*
it: Dalla schermata iniziale, selezionare: *Impostazioni -> Applicazioni -> Servizi Google Play e disabilita l'ottimizzazione della batteria*

source: Open the Google Play Store once and press "Sign in" to start the initialization. You don't have to finish the sign in and a real login is not necessary. This is solely to initialize the software.
it: Aprite il Google Play Store una volta e premete "Accedi" per avviare l'inizializzazione. Non devi finire l'accesso e non è necessario un vero e proprio login. Questo è solo per inizializzare il software.

source: To prevent some apps from accessing Google Play Services, install Google Play Services in a separate profile. To do this, create a new dedicated user profile and install the Google Play Services there. Using a work profile together with *Shelter* is also possible, but without as much isolation.
it: Per impedire ad alcune app di accedere a Google Play Services, installa Google Play Services in un profilo separato. Per fare questo, crea un nuovo profilo utente dedicato e installa lì i Google Play Services. È anche possibile utilizzare un profilo di lavoro insieme a *Shelter*, ma senza lo stesso isolamento.

source: The Google Play Store cannot install and update apps due to the sandbox. Instead, always use F-Droid (for open source apps) or Aurora Store (for apps from Google Play Store) to install apps.
it: Il Google Play Store non può installare e aggiornare le app a causa della sandbox. Invece, usa sempre F-Droid (per le app open source) o Aurora Store (per le app del Google Play Store) per installare le app.

source: Compatible Apps
it: App compatibili

source: Earlier there was a list, but as the Play Service implementation progresses, most of the apps should work, although there are still some not working, a list will be available `here <https://github.com/Peter-Easton/GrapheneOS-Knowledge/tree/master/App%20Incompatibility%20List>`_.
it: Prima c'era una lista, ma con il progredire dell'implementazione del Play Service, la maggior parte delle app dovrebbe funzionare, anche se ce ne sono ancora alcune non funzionanti, una lista sarà disponibile `qui <https://github.com/Peter-Easton/GrapheneOS-Knowledge/tree/master/App%20Incompatibility%20List>`_.

source: Recommended Apps
it: Applicazioni raccomandate

source: Browser: The pre-installed browser Vanadium is hardened and therefore recommended for high security. For better ad blocking, `Bromite <https://github.com/bromite/bromite/releases/latest>`_ browser is recommended instead.
it: Browser: Il browser preinstallato Vanadium è indurito e quindi raccomandato per un'alta sicurezza. Per un migliore blocco degli annunci, si raccomanda invece il browser ` Bromite <https://github.com/bromite/bromite/releases/latest>`_.

source: Email: K9-mail and OpenKeyChain (for OpenPGP encryption) or FairEmail.
it: Email: K9-mail e OpenKeyChain (per la crittografia OpenPGP) o FairEmail.

source: VPN: Orbot uses the free TOR network. Mullvad VPN and IVPN are paid VPN services.
it: VPN: Orbot utilizza la rete gratuita TOR. Mullvad VPN e IVPN sono servizi VPN a pagamento.

source: Backup: The integrated backup (Seedvault) and Nextcloud. Choose Settings -> System -> Backup.
it: Backup: Il backup integrato (Seedvault) e Nextcloud. Scegli Impostazioni -> Sistema -> Backup.

source: Messenger:
it: Messaggero:

source: `Signal <https://signal.org/android/apk/>`_ is secure and now widely used. It can also be downloaded without an app store.
it: `Signal <https://signal.org/android/apk/>`_ è sicuro e ormai ampiamente utilizzato. Può anche essere scaricato senza un app store.

source: `Element <https://element.io/>`_ does not require a central infrastructure and allows the use of own servers. An own account can be registered for free at `NitroChat <https://nitro.chat>`_ for example.
it: `L'elemento <https://element.io/>`_ non richiede un'infrastruttura centrale e permette l'uso di server propri. Un proprio account può essere registrato gratuitamente su `NitroChat <https://nitro.chat>`_ per esempio.

source: `Briar <https://briarproject.org/>`_ is a peer-to-peer messenger without any server at all, which can be used without internet with contacts nearby.
it: `Briar <https://briarproject.org/>`_ è un messaggero peer-to-peer senza alcun server, che può essere utilizzato senza internet con contatti nelle vicinanze.

source: Contacts and calendar synchronization: DAVx5 supports CalDAV, CardDAV and WebCAL.
it: Sincronizzazione di contatti e calendario: DAVx5 supporta CalDAV, CardDAV e WebCAL.

source: One-time password generator (2FA, OTP): `Aegis Authenticator <https://github.com/beemdevelopment/Aegis>`_.
it: Generatore di password monouso (2FA, OTP): `Aegis Authenticator <https://github.com/beemdevelopment/Aegis>`_.

source: Regarding camera app, see `here <https://grapheneos.org/usage#camera>`_.
it: Per quanto riguarda l'app fotocamera, vedere ` qui <https://grapheneos.org/usage#camera>`_.

source: Permissions of Individual Apps
it: Permessi delle singole app

source: To check or change the permissions on network access and sensors for a specific app:
it: Per controllare o cambiare i permessi di accesso alla rete e ai sensori per un'app specifica:

source: *Long press on the respective app icon -> app info -> permissions*
it: *Premere a lungo sull'icona della rispettiva app -> app info -> permessi*

source: Background Images
it: Immagini di sfondo

source: You can use these nice background images:
it: Potete usare queste belle immagini di sfondo:

source: **Q:** Does the Nitrophone work with my carrier network?
it: **Q:** Il Nitrophone funziona con la mia rete portante?

source: Google claims `all major carriers`_ should work with the Pixel phones. Nevertheless there might be exceptions, obviously we cannot check `all` carriers around the world. Best practice, is to check if you find some tests/experience stories about the Pixel 4a together with your planned carrier network.
it: Google sostiene che `tutti i principali carrier`_ dovrebbero funzionare con i telefoni Pixel. Tuttavia ci potrebbero essere delle eccezioni, ovviamente non possiamo controllare "tutti" i carrier nel mondo. La migliore pratica, è quella di controllare se si trovano alcuni test/storie di esperienza sul Pixel 4a insieme alla rete del vostro vettore previsto.

source: **Q:** What is and how to activate *PIN Layout Scrambling*
it: **Q:** Cos'è e come attivare il *PIN Layout Scrambling*?

source: To make it difficult for strangers to read the PIN when typing it in, you can display the PIN layout in a random order. Additionally, we recommend a `privacy screen <https://shop.nitrokey.com/shop/product/privacyscreen-for-nitrophone-1-194>`_. To enable, select: *Settings -> Security -> PIN scrambling -> Scramble PIN*
it: Per rendere difficile agli estranei la lettura del PIN durante la digitazione, è possibile visualizzare il layout del PIN in un ordine casuale. Inoltre, si consiglia un ` schermo per la privacy <https://shop.nitrokey.com/shop/product/privacyscreen-for-nitrophone-1-194>`_. Per attivare, selezionare: *Impostazioni -> Sicurezza -> Rimescolamento PIN -> Rimescolamento PIN*

source: **Q:** What is a *Kill Switch* and how to activate it?
it: **Q:** Cos'è un *Kill Switch* e come attivarlo?

source: Kill Switches, which erase all the phone's data when triggered, are very risky in practice as they could be triggered unintentionally. Therefore, the NitroPhone instead has the feature to automatically shut down and restart when inactive for a set period of time. This puts the phone in a secure state where all data is encrypted, no data is in RAM, and the phone can only be unlocked with the legitimate PIN or password. To enable, select: *Settings -> Security -> Auto reboot -> select the idle time duration after which the phone should reboot*
it: I Kill Switch, che cancellano tutti i dati del telefono quando vengono attivati, sono molto rischiosi in pratica perché potrebbero essere attivati involontariamente. Pertanto, il NitroPhone ha invece la caratteristica di spegnere e riavviare automaticamente quando inattivo per un periodo di tempo impostato. Questo mette il telefono in uno stato sicuro dove tutti i dati sono criptati, nessun dato è nella RAM, e il telefono può essere sbloccato solo con il PIN legittimo o la password. Per abilitare, selezionare: *Impostazioni -> Sicurezza -> Riavvio automatico -> selezionare la durata del tempo di inattività dopo il quale il telefono dovrebbe riavviarsi*

source: **Q:** Why do I get "Warning: Your device is loading a different operating system"?
it: **Q:** Perché ricevo "Attenzione: Il tuo dispositivo sta caricando un sistema operativo diverso"?

source: Shortly after the phone is turned on, the warning "Your device is loading a different operating system" is displayed. This warning indicates that no ordinary Google Android is running and can be ignored.
it: Poco dopo l'accensione del telefono, viene visualizzato l'avviso "Il tuo dispositivo sta caricando un sistema operativo diverso". Questo avvertimento indica che non è in esecuzione un normale Google Android e può essere ignorato.

source: **Q:** How can I check, if my NitroPhone has been hacked/compromised?
it: **Q:** Come posso controllare se il mio NitroPhone è stato violato/compromesso?

source: If you want to check the integrity of the operating system, you can use `remote verification <https://attestation.app/about>`_.
it: Se volete controllare l'integrità del sistema operativo, potete usare la verifica remota `<https://attestation.app/about>`_.

source: **Q:** Where can I get further information about GrapheneOS?
it: **Q:** Dove posso ottenere ulteriori informazioni su GrapheneOS?

source: `Here <https://grapheneos.org/faq>`_ you can find further information on GrapheneOS.
it: `Qui <https://grapheneos.org/faq>`_ potete trovare ulteriori informazioni su GrapheneOS.

source: **Q:** Why is OEM unlocking enabled by default?
it: **Q:** Perché lo sblocco OEM è abilitato di default?

source: The only real purpose of the OEM Unlocking setting is `anti-theft protection <https://grapheneos.org/faq#anti-theft>`_ which is not implemented by GrapheneOS. OEM unlocking controls whether the device can be unlocked via boot loader. In the later case all user data is wiped. If OEM Unlocking is disabled, someone can still boot up in recovery mode, enter the menu, wipe data, then boot the OS and enable OEM unlocking. Therefore it doesn't really increase the security but `disabling it <index.html>`_ reduces the potential physical attack surface.
it: L'unico vero scopo dell'impostazione OEM Unlocking è ` la protezione antifurto <https://grapheneos.org/faq#anti-theft>`_ che non è implementata da GrapheneOS. Lo sblocco OEM controlla se il dispositivo può essere sbloccato tramite boot loader. In quest'ultimo caso tutti i dati dell'utente vengono cancellati. Se lo sblocco OEM è disabilitato, qualcuno può ancora avviarsi in modalità di recupero, entrare nel menu, cancellare i dati, quindi avviare il sistema operativo e abilitare lo sblocco OEM. Quindi non aumenta realmente la sicurezza ma `disabilitarlo <index.html>`_ riduce la potenziale superficie di attacco fisico.

source: Getting Started
it: Come iniziare

source: By default you have a secure smartphone, already pre-installed with all the most necessary apps.
it: Di default hai uno smartphone sicuro, già preinstallato con tutte le app più necessarie.

source: Set up a six-digit PIN to protect the phone. In cooperation with the security chip, this will ensure high security while maintaining good usability.
it: Imposta un PIN di sei cifre per proteggere il telefono. In cooperazione con il chip di sicurezza, questo garantirà un'alta sicurezza pur mantenendo una buona usabilità.

source: For extra hardening (optional): Go to Settings -> System -> Developer Options and disable the "OEM unlocking" setting. Afterwards disable the "Developer Options".
it: Per l'indurimento extra (opzionale): Andate in Impostazioni -> Sistema -> Opzioni sviluppatore e disabilitate l'impostazione "Sblocco OEM". Dopodiché disabilitate le "Opzioni sviluppatore".

source: Please familiarize yourself with `using your GrapheneOS <https://grapheneos.org/usage>`_.
it: Si prega di familiarizzare con ` utilizzando il vostro GrapheneOS <https://grapheneos.org/usage>`_.

source: For more details, see the following pages:
it: Per maggiori dettagli, vedere le pagine seguenti:
