Repository: DamienCassou/nitrokey-documentation
Catalog: locales/*/LC_MESSAGES/nitropad.po
Languages: de, it

source: With the NitroPad, malicious changes to the BIOS, operating system, and software can be easily detected. For example, if you left your NitroPad in a hotel room, you can use your Nitrokey to check if it has been tampered with while you were away. If an attacker modifies the NitroPad’s firmware or operating system, the Nitrokey will detect this (instructions below).
de: Mit dem NitroPad können böswillige Änderungen an BIOS, Betriebssystem und Software leicht erkannt werden. Wenn Sie Ihr NitroPad z. B. in einem Hotelzimmer vergessen haben, können Sie mit dem Nitrokey überprüfen, ob während Ihrer Abwesenheit daran herumgepfuscht wurde. Wenn ein Angreifer die Firmware oder das Betriebssystem des NitroPads modifiziert, wird der Nitrokey dies erkennen (Anleitung unten).
it: Con NitroPad, le modifiche dannose al BIOS, al sistema operativo e al software possono essere facilmente rilevate. Per esempio, se hai lasciato il tuo NitroPad in una stanza d'albergo, puoi usare la tua Nitrokey per controllare se è stato manomesso mentre eri via. Se un malintenzionato modifica il firmware o il sistema operativo di NitroPad, Nitrokey lo rileverà (istruzioni sotto).

source: Verification of Sealed Hardware
de: Verifizierung der versiegelten Hardware
it: Verifica dell'hardware sigillato

source: If you have ordered the unit with the option “sealed screws and sealed bag”, please `verify the sealing <sealed-hardware.html>`_ before unpacking. If you do not know what this means, skip this section.
de: Wenn Sie das Gerät mit der Option "versiegelte Schrauben und versiegelter Beutel" bestellt haben, überprüfen Sie bitte `vor dem Auspacken die Versiegelung <sealed-hardware.html>`_. Wenn Sie nicht wissen, was das bedeutet, überspringen Sie diesen Abschnitt.
it: Se avete ordinato l'unità con l'opzione "viti sigillate e sacchetto sigillato", per favore ` verificate la sigillatura <sealed-hardware.html>`_ prima di disimballare. Se non sapete cosa significa, saltate questa sezione.

source: Secure Starting Procedure
de: Sicherer Startvorgang
it: Procedura di avvio sicuro

source: Each time you start the NitroPad, you should - if possible - connect your Nitrokey. If the Nitrokey is plugged in and the system has not been modified, the following screen will appear when the NitroPad is turned on.
de: Jedes Mal, wenn Sie das NitroPad starten, sollten Sie - wenn möglich - Ihren Nitrokey anschließen. Wenn der Nitrokey eingesteckt ist und das System nicht verändert wurde, erscheint beim Einschalten des NitroPad der folgende Bildschirm.
it: Ogni volta che avviate NitroPad, dovreste - se possibile - collegare la vostra Nitrokey. Se la Nitrokey è collegata e il sistema non è stato modificato, all'accensione di NitroPad apparirà la seguente schermata.

source: The box marked in red contains the information that the BIOS has not been changed and that the shared secret of the NitroPad and the Nitrokey match. But this information is not sufficient, because an attacker could have faked it. If at the same time the Nitrokey also flashes green, everything is fine. An attacker would have to have had access to the NitroPad and Nitrokey to achieve this result. It is therefore important that you do not leave both devices unattended.
de: Das rot markierte Feld enthält die Information, dass das BIOS nicht verändert wurde und dass das gemeinsame Geheimnis von NitroPad und Nitrokey übereinstimmt. Diese Information ist aber nicht ausreichend, da ein Angreifer sie gefälscht haben könnte. Wenn gleichzeitig auch der Nitrokey grün blinkt, ist alles in Ordnung. Ein Angreifer müsste Zugriff auf das NitroPad und den Nitrokey gehabt haben, um dieses Ergebnis zu erreichen. Deshalb ist es wichtig, dass Sie nicht beide Geräte unbeaufsichtigt lassen.
it: La casella segnata in rosso contiene l'informazione che il BIOS non è stato cambiato e che il segreto condiviso di NitroPad e la Nitrokey corrispondono. Ma questa informazione non è sufficiente, perché un attaccante potrebbe averla falsificata. Se allo stesso tempo anche la Nitrokey lampeggia in verde, tutto è a posto. Un aggressore avrebbe dovuto avere accesso al NitroPad e alla Nitrokey per ottenere questo risultato. È quindi importante non lasciare entrambi i dispositivi incustoditi.

source: If the information on the NitroPad does not match the information on the Nitrokey, the background would turn red and the message “Invalid Code” would appear. This could indicate that manipulation has taken place.
de: Wenn die Informationen auf dem NitroPad nicht mit den Informationen auf dem Nitrokey übereinstimmen, würde der Hintergrund rot werden und die Meldung "Ungültiger Code" erscheinen. Dies könnte darauf hinweisen, dass eine Manipulation stattgefunden hat.
it: Se le informazioni sul NitroPad non corrispondono a quelle sulla Nitrokey, lo sfondo diventa rosso e appare il messaggio "Invalid Code". Questo potrebbe indicare che c'è stata una manipolazione.

source: How the boot process may look like if the system has been changed (for example after an update) and what error messages may otherwise occur is described further below.
de: Wie der Bootvorgang aussehen kann, wenn das System verändert wurde (z. B. nach einem Update) und welche Fehlermeldungen sonst auftreten können, ist weiter unten beschrieben.
it: Come può apparire il processo di avvio se il sistema è stato cambiato (per esempio dopo un aggiornamento) e quali messaggi di errore possono verificarsi altrimenti è descritto più avanti.

source: The NitroPad can also be started without the Nitrokey. If you don’t have the Nitrokey with you, but are sure that the hardware has not been manipulated, you can boot your system without checking.
de: Das NitroPad kann auch ohne den Nitrokey gestartet werden. Wenn Sie den Nitrokey nicht dabei haben, aber sicher sind, dass die Hardware nicht manipuliert wurde, können Sie Ihr System ohne Überprüfung starten.
it: NitroPad può essere avviato anche senza la Nitrokey. Se non avete la Nitrokey con voi, ma siete sicuri che l'hardware non è stato manipolato, potete avviare il sistema senza controllare.

source: Behavior After a System Update
de: Verhalten nach einem System-Update
it: Comportamento dopo un aggiornamento del sistema

source: The NitroPad firmware checks certain system files for changes. If your operating system has updated important components, you will be warned the next time you boot the NitroPad. This could look like this, for example:
de: Die NitroPad-Firmware prüft bestimmte Systemdateien auf Änderungen. Wenn Ihr Betriebssystem wichtige Komponenten aktualisiert hat, werden Sie beim nächsten Start des NitroPads gewarnt. Dies könnte z. B. so aussehen:
it: Il firmware di NitroPad controlla alcuni file di sistema per le modifiche. Se il vostro sistema operativo ha aggiornato componenti importanti, sarete avvisati al prossimo avvio di NitroPad. Questo potrebbe apparire così, per esempio:

source: That’s why it’s important to restart your NitroPad under controlled conditions after a system update. Only when the new status has been confirmed can you leave the device unattended again. Otherwise, you will not be able to distinguish a possible attack from a system update. Detailed instructions for a system update can be `found here <system-update.html>`_.
de: Deshalb ist es wichtig, Ihr NitroPad nach einer Systemaktualisierung unter kontrollierten Bedingungen neu zu starten. Erst wenn der neue Status bestätigt wurde, können Sie das Gerät wieder unbeaufsichtigt lassen. Andernfalls sind Sie nicht in der Lage, einen möglichen Angriff von einer Systemaktualisierung zu unterscheiden. Eine detaillierte Anleitung für ein Systemupdate finden Sie `hier <system-update.html>`_.
it: Ecco perché è importante riavviare il NitroPad in condizioni controllate dopo un aggiornamento del sistema. Solo quando il nuovo stato è stato confermato potete lasciare il dispositivo di nuovo incustodito. Altrimenti, non sarete in grado di distinguere un possibile attacco da un aggiornamento di sistema. Istruzioni dettagliate per un aggiornamento di sistema possono essere `trovate qui <system-update.html>`_.

source: Default Boot
de: Standard-Boot
it: Avvio predefinito

source: If you have installed a new operating system, it may be that default boot is not yet assigned. If this is the case, please proceed as described below.
de: Wenn Sie ein neues Betriebssystem installiert haben, kann es sein, dass der Standard-Boot noch nicht zugewiesen ist. Wenn dies der Fall ist, gehen Sie bitte wie unten beschrieben vor.
it: Se avete installato un nuovo sistema operativo, è possibile che l'avvio di default non sia ancora assegnato. Se questo è il caso, procedete come descritto di seguito.

source: Select “Default boot”.
de: Wählen Sie "Standard-Boot".
it: Selezionate "Default boot" (avvio predefinito).

source: Heads informs you that it does not yet know any default. First you agree to the update of the checksums.
de: Heads teilt Ihnen mit, dass es noch keine Vorgabe kennt. Sie stimmen zunächst der Aktualisierung der Prüfsummen zu.
it: Heads vi informa che non conosce ancora nessun default. Prima accettate l'aggiornamento delle checksum.

source: Confirm the process with Enter.
de: Bestätigen Sie den Vorgang mit Enter.
it: Confermate il processo con Invio.

source: Now insert the Nitrokey if this is not already the case and confirm with Enter. Then you have to enter the User PIN of the Nitrokey.
de: Fügen Sie nun den Nitrokey ein, falls dies noch nicht der Fall ist, und bestätigen Sie mit Enter. Dann müssen Sie die Benutzer-PIN des Nitrokeys eingeben.
it: Ora inserite la Nitrokey se non è già così e confermate con Enter. Poi dovete inserire il PIN utente della Nitrokey.

source: Now the NitroPad marks the files that changed by the update as verified.
de: Nun markiert das NitroPad die durch das Update geänderten Dateien als verifiziert.
it: Ora NitroPad segna i file cambiati dall'aggiornamento come verificati.

source: You will then see a list of all possible boot entries - choose the first one here by simply pressing Enter. Boot Options
de: Sie sehen dann eine Liste mit allen möglichen Booteinträgen - wählen Sie hier den ersten aus, indem Sie einfach die Eingabetaste drücken. Boot-Optionen
it: Vedrete quindi una lista di tutte le possibili voci di avvio - scegliete la prima qui premendo semplicemente Invio. Opzioni di avvio

source: To save this value as default, select “Make Ubuntu the default” for Ubuntu or “Make Qubes the default” for Qubes OS. Confirm Boot Details
de: Um diesen Wert als Standard zu speichern, wählen Sie "Make Ubuntu the default" für Ubuntu oder "Make Qubes the default" für Qubes OS. Bestätigen der Boot-Details
it: Per salvare questo valore come predefinito, selezionate "Make Ubuntu the default" per Ubuntu o "Make Qubes the default" per Qubes OS. Confermare i dettagli di avvio

source: Confirm the next three questions with Enter and enter the PIN of the Nitrokey if you are prompted to do so.
de: Bestätigen Sie die nächsten drei Fragen mit Enter und geben Sie die PIN des Nitrokeys ein, wenn Sie dazu aufgefordert werden.
it: Confermate le prossime tre domande con Invio e inserite il PIN della Nitrokey se vi viene richiesto.

source: Your system will then boot.
de: Ihr System wird dann hochgefahren.
it: Il sistema si avvierà quindi.

source: Changing default kernel
de: Ändern des Standard-Kernels
it: Cambiare il kernel di default

source: This is a workaround for Heads v1.1 bug, which does not allow to change the kernel to the one later (lower) in the list.
de: Dies ist eine Abhilfe für Heads v1.1 Fehler, der es nicht erlaubt, den Kernel auf einen späteren (niedrigeren) in der Liste zu ändern.
it: Questo è un workaround per il bug di Heads v1.1, che non permette di cambiare il kernel a quello successivo (inferiore) nella lista.

source: Usual way would be to go to ``Options -> Boot Options -> Show OS boot menu``, selecting the kernel and making it default, however the latter is not working at the moment. Instead please use the following workaround:
de: Der übliche Weg wäre, unter ``Optionen -> Boot-Optionen -> OS-Boot-Menü anzeigen`` den Kernel auszuwählen und als Standard einzustellen, aber letzteres funktioniert im Moment nicht. Verwenden Sie stattdessen bitte den folgenden Workaround:
it: Il modo usuale sarebbe andare su ``Options -> Boot Options -> Show OS boot menu``, selezionare il kernel e renderlo predefinito, tuttavia quest'ultimo non funziona al momento. Si prega invece di utilizzare il seguente workaround:

source: Start recovery console and remove the default boot files. Please make sure the correct files are removed. Here 2 default files were available:
de: Starten Sie die Wiederherstellungskonsole und entfernen Sie die Standard-Bootdateien. Bitte achten Sie darauf, dass die richtigen Dateien entfernt werden. Hier waren 2 Standarddateien vorhanden:
it: Avviare la console di recupero e rimuovere i file di avvio predefiniti. Assicuratevi che vengano rimossi i file corretti. Qui erano disponibili 2 file di default:

source: Sign all current boot files with: ``Options --> Update checksums and sign all files in /boot``
de: Signieren Sie alle aktuellen Bootdateien mit: ``Optionen --> Prüfsummen aktualisieren und alle Dateien in /boot signieren``
it: Firma tutti i file di avvio correnti con: ``Options --> Update checksums and sign all files in /boot``

source: Return to main menu and select default boot ``Main Menu --> Default boot``
de: Kehren Sie zum Hauptmenü zurück und wählen Sie Standard-Boot ``Hauptmenü --> Standard-Boot``
it: Torna al menu principale e seleziona l'avvio predefinito ``Main Menu --> Default boot``

source: Agree to select default kernel (screen: ``No Default Boot Option Configured`` )
de: Zustimmen, um den Standard-Kernel auszuwählen (Bildschirm: ``Keine Standard-Boot-Option konfiguriert`` )
it: Accettare di selezionare il kernel predefinito (schermata: ``No Default Boot Option Configured`` )

source: Select the desired kernel to work as the default
de: Wählen Sie den gewünschten Kernel aus, der als Standard arbeiten soll
it: Selezionare il kernel desiderato per lavorare come predefinito

source: Select 2nd option: ``Make <kernel version> the default``
de: Wählen Sie die 2. Option: ``Mache <Kernelversion> zum Standard``
it: Selezionare la seconda opzione: ``Make <kernel version> the default``

source: Save the kernel with accepting default options (proceed, do not agree for TPM encryption, confirm GPG card):
de: Speichern Sie den Kernel mit dem Akzeptieren der Standardoptionen (Fortfahren, nicht zustimmen für TPM-Verschlüsselung, GPG-Karte bestätigen):
it: Salvare il kernel accettando le opzioni predefinite (procedere, non accettare la crittografia TPM, confermare la scheda GPG):

source: Enter PIN for the Nitrokey Pro/Storage device to execute signing process
de: PIN für das Nitrokey Pro/Speichergerät eingeben, um den Signiervorgang durchzuführen
it: Inserire il PIN del dispositivo Nitrokey Pro/Storage per eseguire il processo di firma

source: The selected kernel will boot and it will be the default one the next time when selecting ``Default Boot`` option from the menu.
de: Der gewählte Kernel wird gebootet und ist das nächste Mal der Standardkernel, wenn Sie die Option ``Default Boot`` aus dem Menü auswählen.
it: Il kernel selezionato si avvierà e sarà quello predefinito la volta successiva quando si seleziona l'opzione ``Default Boot`` dal menu.

source: Factory Reset
de: Werkseinstellung
it: Reset di fabbrica

source: Reasons for resetting to factory settings
de: Gründe für das Zurücksetzen auf Werkseinstellungen
it: Motivi per ripristinare le impostazioni di fabbrica

source: Your Nitrokey is locked (e.g. due to multiple incorrect PIN entries)
de: Ihr Nitrokey ist gesperrt (z. B. durch mehrfache falsche PIN-Eingabe)
it: La tua Nitrokey è bloccata (ad esempio a causa di molteplici inserimenti errati del PIN)

source: You have lost your Nitrokey (in which case you will first need a new one)
de: Sie haben Ihren Nitrokey verloren (in diesem Fall benötigen Sie zunächst einen neuen)
it: Hai perso la tua Nitrokey (in questo caso avrai bisogno di una nuova chiave)

source: You have installed an operating system yourself (e.g. after changing the hard disk)
de: Sie haben selbst ein Betriebssystem installiert (z. B. nach einem Festplattentausch)
it: Avete installato voi stessi un sistema operativo (per esempio dopo aver cambiato il disco rigido)

source: Your operating system does not start
de: Ihr Betriebssystem startet nicht
it: Il sistema operativo non si avvia

source: All your data will be lost if you reset your device. Therefore please backup your data before performing the reset.
de: Wenn Sie Ihr Gerät zurücksetzen, gehen alle Ihre Daten verloren. Sichern Sie daher Ihre Daten, bevor Sie das Zurücksetzen durchführen.
it: Tutti i vostri dati saranno persi se resettate il vostro dispositivo. Pertanto, si prega di eseguire il backup dei dati prima di eseguire il reset.

source: Procedure
de: Verfahren
it: Procedura

source: Connect any USB flash drive to the NitroPad. (You need that USB flash drive for saving your security key)
de: Schließen Sie ein beliebiges USB-Flash-Laufwerk an das NitroPad an. (Sie benötigen dieses USB-Flash-Laufwerk zum Speichern Ihres Sicherheitsschlüssels)
it: Collegare una qualsiasi chiavetta USB al NitroPad. (La chiavetta USB ti serve per salvare la tua chiave di sicurezza)

source: Connect your Nitrokey to the NitroPad.
de: Verbinden Sie Ihren Nitrokey mit dem NitroPad.
it: Collega la tua Nitrokey al NitroPad.

source: Turn on the NitroPad.
de: Schalten Sie das NitroPad ein.
it: Accendere il NitroPad.

source: Select “Options”.
de: Wählen Sie "Optionen".
it: Selezionare "Opzioni".

source: Select “OEM-Factory Reset”.
de: Wählen Sie "OEM-Factory Reset".
it: Selezionare "OEM-Factory Reset".

source: Confirm the “OEM Factory Reset” with “Continue”.
de: Bestätigen Sie den "OEM Factory Reset" mit "Weiter".
it: Confermare il "OEM Factory Reset" con "Continua".

source: You will be asked if you want to set the User and Admin/TPM PIN yourself. You press Enter to continue without changing the PINs.
de: Sie werden gefragt, ob Sie die Benutzer- und Admin/TPM-PIN selbst setzen wollen. Sie drücken Enter, um fortzufahren, ohne die PINs zu ändern.
it: Vi verrà chiesto se volete impostare voi stessi il PIN Utente e Admin/TPM. Premete Invio per continuare senza cambiare i PIN.

source: You will then be asked if manual user information should be added. You confirm with ‘y’ and enter your name and then the email address.
de: Sie werden dann gefragt, ob manuelle Benutzerinformationen hinzugefügt werden sollen. Sie bestätigen mit 'y' und geben Ihren Namen und anschließend die E-Mail-Adresse ein.
it: Ti verrà quindi chiesto se le informazioni dell'utente manuale devono essere aggiunte. Confermate con 'y' e inserite il vostro nome e poi l'indirizzo email.

source: If you are using Nitrokey storage, you must then select the drive. If the drives /dev/sdb1, /dev/sdc, /dev/sdd1 are displayed, select /dev/sdd1. If the drives /dev/sdb1, /dev/sdc1, /dev/sdd are displayed, select /dev/sdb1.
de: Wenn Sie einen Nitrokey-Speicher verwenden, müssen Sie anschließend das Laufwerk auswählen. Wenn die Laufwerke /dev/sdb1, /dev/sdc, /dev/sdd1 angezeigt werden, wählen Sie /dev/sdd1. Wenn die Laufwerke /dev/sdb1, /dev/sdc1, /dev/sdd angezeigt werden, wählen Sie /dev/sdb1.
it: Se state usando lo storage Nitrokey, dovete poi selezionare l'unità. Se sono visualizzate le unità /dev/sdb1, /dev/sdc, /dev/sdd1, seleziona /dev/sdd1. Se sono visualizzate le unità /dev/sdb1, /dev/sdc1, /dev/sdd, seleziona /dev/sdb1.

source: The rest of the configuration will be done automatically. You confirm the subsequent restart.
de: Der Rest der Konfiguration wird automatisch durchgeführt. Sie bestätigen den anschließenden Neustart.
it: Il resto della configurazione verrà fatta automaticamente. Confermate il successivo riavvio.

source: After the restart the OTP secret must be created. Confirm the process with Enter.
de: Nach dem Neustart muss das OTP-Geheimnis erstellt werden. Bestätigen Sie den Vorgang mit Enter.
it: Dopo il riavvio deve essere creato il segreto OTP. Confermare il processo con Enter.

source: Confirm that new OTP Secrets should be created.
de: Bestätigen Sie, dass neue OTP-Geheimnisse erstellt werden sollen.
it: Conferma che i nuovi OTP Secrets devono essere creati.

source: When prompted, enter the Admin PIN and TPM password. Both are by default: “12345678”.
de: Wenn Sie dazu aufgefordert werden, geben Sie die Admin-PIN und das TPM-Passwort ein. Beide sind standardmäßig: "12345678".
it: Quando viene richiesto, inserire il PIN dell'amministratore e la password del TPM. Entrambi sono di default: "12345678".

source: You should then reach the Start menu.
de: Sie sollten dann das Startmenü erreichen.
it: Si dovrebbe quindi raggiungere il menu Start.

source: Press Enter to start the “Default Boot”.
de: Drücken Sie die Eingabetaste, um den "Default Boot" zu starten.
it: Premere Invio per avviare il "Default Boot".

source: If you see the message that no default exists yet, please follow the procedure described in “Troubleshooting: Default Boot Menu”.
de: Wenn Sie die Meldung sehen, dass noch kein Standard vorhanden ist, gehen Sie bitte wie unter "Fehlerbehebung" beschrieben vor: Standard-Boot-Menü".
it: Se vedete il messaggio che non esiste ancora un default, seguite la procedura descritta in "Risoluzione dei problemi": Menu di avvio predefinito".

source: Once the operating system starts until the encryption password is requested, you are done.
de: Sobald das Betriebssystem startet, bis das Verschlüsselungskennwort abgefragt wird, sind Sie fertig.
it: Una volta che il sistema operativo si avvia fino alla richiesta della password di crittografia, avete finito.

source: Finally, copy the public PGP key from the data stick to your computer, e.g. to use it for e-mail encryption.
de: Kopieren Sie abschließend den öffentlichen PGP-Schlüssel vom Datenstick auf Ihren Computer, um ihn z. B. zur E-Mail-Verschlüsselung zu verwenden.
it: Infine, copia la chiave pubblica PGP dalla chiavetta al tuo computer, ad esempio per usarla per la crittografia delle e-mail.

source: **Q:** What is the default hard-disk encryption password?
de: **Q:** Wie lautet das Standardkennwort für die Festplattenverschlüsselung?
it: **Q:** Qual è la password di crittografia predefinita del disco rigido?

source: The default Nitropad disk encryption password: "PleaseChangeMe"
de: Das Standardpasswort für die Nitropad-Festplattenverschlüsselung: "PleaseChangeMe"
it: La password predefinita di cifratura del disco di Nitropad: "PleaseChangeMe"

source: Firmware Update
it: Aggiornamento del firmware

source: This guide describes how to update the Heads firmware of the NitroPad.
de: Diese Anleitung beschreibt, wie Sie die Heads-Firmware des NitroPad aktualisieren.
it: Questa guida descrive come aggiornare il firmware degli Heads del NitroPad.

source: These instructions are relevant in the following cases:
de: Diese Anweisungen sind in den folgenden Fällen relevant:
it: Queste istruzioni sono rilevanti nei seguenti casi:

source: You want to update the Heads firmware.
de: Sie wollen die Heads-Firmware aktualisieren.
it: Vuoi aggiornare il firmware delle teste.

source: You have already performed an OEM factory reset, but the TPM counter has not been reset.
de: Sie haben bereits einen OEM-Werksreset durchgeführt, aber der TPM-Zähler wurde nicht zurückgesetzt.
it: Avete già eseguito un reset di fabbrica OEM, ma il contatore TPM non è stato resettato.

source: Preparation
de: Vorbereitung
it: Preparazione
