Repository: DamienCassou/nitrokey-documentation
Catalog: locales/*/LC_MESSAGES/start.po
Languages: it

source: Optional: `OpenPGP Minidriver <https://wald.intevation.org/frs/?group_id=49&release_id=353>`_
it: Opzionale: `OpenPGP Minidriver <https://wald.intevation.org/frs/?group_id=49&release_id=353>`_

source: **1) Pageant**
it: **1) Concorso**

source: start pageant.exe. That this is running is shown in the notification area of the taskbar.
it: avviare pageant.exe. Che questo è in esecuzione viene mostrato nell'area di notifica della barra delle applicazioni.

source: A double click opens the view of the current keys.
it: Un doppio clic apre la vista delle chiavi correnti.

source: After inserting the key it looks like this.
it: Dopo aver inserito la chiave appare così.

source: If nothing is displayed here, pageant may have to be restarted or another application is already using the stick. A possibly running pgp-agent must be terminated! Now we only need the public key we want to store in the ssh configuration of the server. Therefore we press CTRL while inserting the stick…
it: Se non viene visualizzato nulla qui, Pageant potrebbe dover essere riavviato o un'altra applicazione sta già usando la chiavetta. Un eventuale pgp-agent in esecuzione deve essere terminato! Ora abbiamo solo bisogno della chiave pubblica che vogliamo memorizzare nella configurazione ssh del server. Quindi premiamo CTRL mentre inseriamo la chiavetta…

source: and then view the Pageant-PublicKeys.txt.
it: e poi visualizzare il Pageant-PublicKeys.txt.

source: I searched for the ssh-rsa entry of the auth key and added the line on the server to the authorized_keys.
it: Ho cercato la voce ssh-rsa della chiave auth e ho aggiunto la linea sul server alle authorized_keys.

source: There is surprisingly little to say about PuTTY itself.
it: C'è sorprendentemente poco da dire su PuTTY stesso.

source: “Attempt authentication using Pageant” must be set, which is the default anyway.
it: "Attempt authentication using Pageant" deve essere impostato, che è comunque il default.

source: That’s it, as soon as you connect to the server while pageant is running and you have the keys, you will be asked for the password of the Crypto-Stick and can log in.
it: Questo è tutto, appena ti connetti al server mentre il concorso è in corso e hai le chiavi, ti verrà chiesta la password della Crypto-Stick e potrai accedere.

source: **3) openpgp-minidriver (optional)**
it: **3) openpgp-minidriver (opzionale)**

source: If you are annoyed that Windows reports every time you plug in the stick that no driver could be found for “Smartcard”, you can get rid of it. You just have to install the x86 or x64 version of the above mentioned driver and the smartcard looks like this:
it: Se siete infastiditi dal fatto che Windows segnala ogni volta che inserite la chiavetta che non è stato trovato alcun driver per "Smartcard", potete liberarvene. Basta installare la versione x86 o x64 del suddetto driver e la smartcard si presenta così:

source: Setting KDF-DO
it: Impostazione di KDF-DO

source: At the moment it is only possible to set the KDF-DO, when the Nitrokey Start is empty (just after a factory reset).
it: Al momento è possibile impostare il KDF-DO solo quando il Nitrokey Start è vuoto (subito dopo un reset di fabbrica).

source: Overview
it: Panoramica

source: Run factory reset
it: Eseguire il reset di fabbrica

source: Set up KDF-DO using GnuPG
it: Impostare KDF-DO usando GnuPG

source: Change Admin PIN (optional; without keys only Admin PIN change is possible)
it: Modifica del PIN dell'amministratore (opzionale; senza chiavi è possibile solo la modifica del PIN dell'amministratore)

source: Import / generate keys
it: Importare / generare chiavi

source: Change User and Admin PIN
it: Cambiare il PIN dell'utente e dell'amministratore

source: Setting KDF-DO using GnuPG
it: Impostare KDF-DO usando GnuPG

source: Run `gpg2 --card-edit`
it: Esegui `gpg2 --card-edit`

source: Enter Admin PIN
it: Inserisci il PIN dell'amministratore

source: Verify current state state by looking at the card details (`gpg2 --card-status`), where `KDF setting ......: on` should be visible, e.g.:
it: Verificare lo stato attuale guardando i dettagli della carta (`gpg2 --card-status`), dove `KDF setting ......: on` dovrebbe essere visibile, ad es:

source: Tested with
it: Testato con

source: Curve 25519 keys
it: Curva 25519 tasti

source: S/MIME Email Encryption
it: Crittografia e-mail S/MIME

source: If you are in doubt which one to choose, you should use OpenPGP, see `here <openpgp.html>`_. This page describes the usage of S/MIME email encryption.
it: Se sei in dubbio su quale scegliere, dovresti usare OpenPGP, vedi ` qui <openpgp.html>`_. Questa pagina descrive l'uso della crittografia e-mail S/MIME.

source: You need to purchase a S/MIME certificate or may already got one by your company. Furthermore, you need to install `OpenSC <https://github.com/OpenSC/OpenSC/wiki>`_ on your System. While GNU/Linux users usually can install OpenSC over the package manager (e.g. ``sudo apt install opensc`` on Ubuntu), macOS and Windows users can download the installation files from the `OpenSC <https://github.com/OpenSC/OpenSC/wiki>`_ page.
it: Dovete acquistare un certificato S/MIME o potreste già averne uno dalla vostra azienda. Inoltre, è necessario installare ` OpenSC <https://github.com/OpenSC/OpenSC/wiki>`_ sul vostro sistema. Mentre gli utenti GNU/Linux di solito possono installare OpenSC tramite il gestore dei pacchetti (ad esempio ``sudo apt install opensc`` su Ubuntu), gli utenti macOS e Windows possono scaricare i file di installazione dalla pagina `OpenSC <https://github.com/OpenSC/OpenSC/wiki>`_.

source: Windows users with 64-bit system (standard) need to install both, the 32-bit and the 64-bit version of OpenSC!
it: Gli utenti di Windows con sistema a 64 bit (standard) devono installare entrambe le versioni, quella a 32 bit e quella a 64 bit di OpenSC!

source: Import Existing Key and Certificate
it: Importare la chiave e il certificato esistenti

source: The following instructions are based on the `wiki of OpenSC <https://github.com/OpenSC/OpenSC/wiki/OpenPGP-card>`_. We will assume, that you already got a key-certificate pair as a .p12 file. Please have a look at the wiki page, if you got a separate key and certificate file.
it: Le seguenti istruzioni sono basate sul `wiki di OpenSC <https://github.com/OpenSC/OpenSC/wiki/OpenPGP-card>`_. Assumiamo che abbiate già una coppia chiave-certificato come file .p12. Per favore date un'occhiata alla pagina del wiki, se avete un file chiave e certificato separati.

source: To make these commands as simple as possible, the .p12 file needs to be in your home folder. On Windows this is usually ‘C:\Users\yourusername’ and on macOS and GNU/Linux system it will be ‘/home/yourusername’. If you do not store the .p12 file there, you have to adapt the path in the commands below. Please plug in the Nitrokey before submitting the commands.
it: Per rendere questi comandi il più semplice possibile, il file .p12 deve essere nella tua cartella home. Su Windows questa è di solito 'C:\Users\yourusername' e su macOS e GNU/Linux sarà '/home/yourusername'. Se non memorizzi il file .p12 lì, devi adattare il percorso nei comandi qui sotto. Inserisci la Nitrokey prima di inviare i comandi.

source: Assuming that your key-certificate file reads ‘myprivate.p12’ the commands for Windows looks like this:
it: Supponendo che il vostro file di certificato-chiave sia 'myprivate.p12', i comandi per Windows sono questi:

source: and on macOS and GNU/Linux it will be
it: e su macOS e GNU/Linux sarà

source: The two commands copy the key-certificate pair to the slot 2 (needed for decrypting emails) and slot 3 (needed for signing). The output looks on both systems something like this:
it: I due comandi copiano la coppia chiave-certificato nello slot 2 (necessario per decifrare le email) e nello slot 3 (necessario per la firma). L'output appare su entrambi i sistemi qualcosa di simile a questo:

source: Please note that there will be error messages that can be safely ignored (see output example above). You now have the key-certificate pair loaded on the Nitrokey.
it: Notate che ci saranno dei messaggi di errore che possono essere tranquillamente ignorati (vedi l'esempio di output qui sopra). Ora avete la coppia chiave-certificato caricata sulla Nitrokey.

source: for using `S/MIME encryption on Thunderbird <smime-thunderbird.html>`_
it: per usare la crittografia `S/MIME su Thunderbird <smime-thunderbird.html>`_

source: for using `S/MIME encryption on Outlook <smime-outlook.html>`_
it: per usare la crittografia `S/MIME su Outlook <smime-outlook.html>`_

source: On Windows: Did you install **both**, the 32-bit and the 64-bit version of OpenSC?
it: Su Windows: Avete installato **entrambi**, la versione a 32-bit e quella a 64-bit di OpenSC?

source: Nitrokey Storage 2: You need to install OpenSC in version 0.18 or higher. You can find the files on the `OpenSC website <https://github.com/OpenSC/OpenSC/releases>`_ for Windows and macOS user or `here <https://github.com/Nitrokey/opensc-build>`_ for Debian/Ubuntu users.
it: Nitrokey Storage 2: è necessario installare OpenSC nella versione 0.18 o superiore. Potete trovare i file sul ` sito web di OpenSC <https://github.com/OpenSC/OpenSC/releases>`_ per utenti Windows e macOS o ` qui <https://github.com/Nitrokey/opensc-build>`_ per utenti Debian/Ubuntu.

source: S/MIME Email Encryption with Outlook
it: Crittografia e-mail S/MIME con Outlook

source: If you do not have a S/MIME key-certificate pair installed on your Nitrokey yet, please look at `this page <smime.html>`_ first.
it: Se non avete ancora una coppia chiave-certificato S/MIME installata sulla vostra Nitrokey, guardate prima `questa pagina <smime.html>`_.

source: You need to have OpenSC installed on your System. Please have a look at the `wiki page of the OpenSC project <https://github.com/OpenSC/OpenSC/wiki>`_.
it: Devi avere OpenSC installato sul tuo sistema. Dai un'occhiata alla ` pagina wiki del progetto OpenSC <https://github.com/OpenSC/OpenSC/wiki>`_.

source: Settings in Outlook
it: Impostazioni in Outlook

source: Before you can use the Nitrokey in Outlook you have to activate S/MIME encryption. You can achieve this by clicking on to ‘Start’ -> ‘Options’ and clicking on ‘Trust Center’ in the options window. In section ‘Email Security’ you can choose your S/MIME identity. Your certificate should already be recognized by Outlook.
it: Prima di poter usare Nitrokey in Outlook devi attivare la crittografia S/MIME. Puoi ottenere questo cliccando su 'Start' -> 'Opzioni' e cliccando su 'Trust Center' nella finestra delle opzioni. Nella sezione 'Email Security' puoi scegliere la tua identità S/MIME. Il tuo certificato dovrebbe già essere riconosciuto da Outlook.

source: When composing a mail you can now choose to encrypt and sign the message in the ‘Options’ ribbon of the compose window.
it: Quando si compone una mail si può ora scegliere di criptare e firmare il messaggio nel nastro 'Opzioni' della finestra di composizione.

source: Outlook will only encrypt message to mail addresses which are saved in your address book. So make sure, that the persons you want to write an encrypted mail to have an entry in Outlook’s contacts. You can ask the person to write you a signed mail, so that you can import the certificate information.
it: Outlook cripta solo i messaggi agli indirizzi di posta che sono salvati nella vostra rubrica. Assicuratevi quindi che le persone a cui volete scrivere un messaggio criptato abbiano una voce nei contatti di Outlook. Puoi chiedere alla persona di scriverti un messaggio firmato, in modo da poter importare le informazioni del certificato.

source: Depending on your certificate or the certificate of your partners you may have to import a so-called root certificate. This is the certificate of the party which issued the certificate you or your partner uses. You should usually got informed if this is necessary.
it: A seconda del tuo certificato o di quello dei tuoi partner potresti dover importare un cosiddetto certificato di root. Questo è il certificato della parte che ha emesso il certificato che voi o il vostro partner usate. Di solito dovresti essere informato se questo è necessario.

source: S/MIME Email Encryption with Thunderbird
it: Crittografia e-mail S/MIME con Thunderbird

source: If you do not have a S/MIME key-certificate pair installed on your Nitrokey yet or if you did not installed OpenSC, please look at `this page <smime.html>`_ first.
it: Se non avete ancora una coppia chiave-certificato S/MIME installata sulla vostra Nitrokey o se non avete installato OpenSC, guardate prima ` questa pagina <smime.html>`_.

source: You need to have `OpenSC installed <https://github.com/OpenSC/OpenSC/wiki>`_ on your System. While GNU/Linux users usually can install OpenSC over the package manager (e.g. ``sudo apt update && sudo apt install opensc`` on Ubuntu), macOS and Windows users can download the installation files from OpenSC directly.
it: Dovete avere `OpenSC installato <https://github.com/OpenSC/OpenSC/wiki>`_ sul vostro sistema. Mentre gli utenti GNU/Linux di solito possono installare OpenSC tramite il gestore di pacchetti (ad esempio ``sudo apt update && sudo apt install opensc`` su Ubuntu), gli utenti macOS e Windows possono scaricare direttamente i file di installazione da OpenSC.

source: Settings in Thunderbird
it: Impostazioni in Thunderbird

source: Before you can use the Nitrokey in Thunderbird you have to activate S/MIME encryption in the account settings. You can achieve this by clicking on the menu and go to ‘Preferences’ -> ‘Account Settings’ and clicking on ‘Security’ in the account settings window.
it: Prima di poter usare Nitrokey in Thunderbird devi attivare la crittografia S/MIME nelle impostazioni dell'account. Puoi ottenerlo cliccando sul menu e andando su 'Preferenze' -> 'Impostazioni account' e cliccando su 'Sicurezza' nella finestra delle impostazioni dell'account.

source: Click on “Security Devices” to import the right PCKS11 module. Click on “Load” on the right-hand side. Now give the Module a name (like “OpenSC Module”) and click on “Browse” to choose the location of the Module (see below).
it: Cliccate su "Dispositivi di sicurezza" per importare il modulo PCKS11 giusto. Cliccate su "Load" sul lato destro. Ora dai un nome al modulo (come "OpenSC Module") e clicca su "Browse" per scegliere la posizione del modulo (vedi sotto).

source: On Windows the right file lays under “C:\Windows\System32\opensc-pkcs11.dll”. On macOS and GNU/Linux the file should be in “/lib/pkcs11/opensc-pkcs11.so” or “/usr/lib/pkcs11/opensc-pkcs11.so” or alike. Press “OK” twice and you are back in security section of the account settings. Now you can actually choose a certificate on the upper part of the window. You should get asked for a PIN to unlock your Nitrokey. Please type in your User PIN.
it: Su Windows il file giusto si trova sotto "C:\Windows\System32\opensc-pkcs11.dll". Su macOS e GNU/Linux il file dovrebbe essere in "/lib/pkcs11/opensc-pkcs11.so" o "/usr/lib/pkcs11/opensc-pkcs11.so" o simili. Premi due volte "OK" e sei di nuovo nella sezione sicurezza delle impostazioni dell'account. Ora puoi effettivamente scegliere un certificato nella parte superiore della finestra. Ti dovrebbe essere chiesto un PIN per sbloccare la tua Nitrokey. Digita il tuo PIN utente.

source: When composing an email you can now choose to encrypt and sign the message.
it: Quando si compone un'e-mail è ora possibile scegliere di crittografare e firmare il messaggio.

source: Install `GnuPG 2.1 <https://gpgtools.org/>`_ or higher.
it: Installare `GnuPG 2.1 <https://gpgtools.org/>`_ o superiore.

source: Connect your Nitrokey to your computer and confirm all dialogs so that the USB smart card device driver gets installed almost automatically.
it: Collegate la vostra Nitrokey al computer e confermate tutte le finestre di dialogo in modo che il driver del dispositivo smart card USB venga installato quasi automaticamente.

source: Install `Gpg4win <https://www.gpg4win.org/>`_ on your Computer.
it: Installate `Gpg4win <https://www.gpg4win.org/>`_ sul vostro computer.

source: Windows may fail to install an additional device driver for the smart card. Its safe to ignore this warning.
it: Windows potrebbe non riuscire a installare un driver aggiuntivo per la smart card. È sicuro ignorare questo avvertimento.

source: It is indeed necessary to first import or create new keys and change the PINs afterwards. Otherwise changing User PIN will fail! Furthermore overriding keys results in PIN reset (default values), please keep this in mind!
it: È infatti necessario prima importare o creare nuove chiavi e poi cambiare i PIN. Altrimenti la modifica del PIN utente non riuscirà! Inoltre, la sovrascrittura delle chiavi comporta la reimpostazione del PIN (valori predefiniti), tienilo a mente!

source: Use ‘gpg –card-edit’ -> ‘admin’ -> ‘passwd’ to achieve this (for Admin PIN case). - Please be careful to change Admin PIN first and User PIN second! Otherwise the admin-less mode got activated, see `this instructions <https://www.fsij.org/doc-gnuk/gnuk-passphrase-setting.html#>`_ for further information.
it: Usa 'gpg -card-edit' -> 'admin' -> 'passwd' per ottenere questo (per il caso dell'Admin PIN). - Fai attenzione a cambiare prima il PIN amministratore e poi il PIN utente! Altrimenti si attiva la modalità admin-less, vedi ` queste istruzioni <https://www.fsij.org/doc-gnuk/gnuk-passphrase-setting.html#>`_ per ulteriori informazioni.

source: Optionally Reset code can be set up (`guide <https://www.fsij.org/doc-gnuk/gnuk-passphrase-setting.html>`_). The minimum length accepted is 8 characters, however it should be as long as User PIN.
it: Opzionalmente è possibile impostare il codice di reset (`guida <https://www.fsij.org/doc-gnuk/gnuk-passphrase-setting.html>`_). La lunghezza minima accettata è di 8 caratteri, tuttavia dovrebbe essere lunga quanto il PIN utente.

source: **Firmware version 1.2.5 or below: In case you forget a PIN or enter it wrongly three times you need the reset code to unblock the PIN. Otherwise the device wouldn’t be usable anymore! Therefore please** `set the reset code <https://www.fsij.org/doc-gnuk/gnuk-passphrase-setting.html>`_ **as well when initialising the key!**
it: **Firmware versione 1.2.5 o inferiore: Nel caso in cui si dimentichi un PIN o lo si inserisca erroneamente per tre volte è necessario il codice di reset per sbloccare il PIN. Altrimenti il dispositivo non sarebbe più utilizzabile! Quindi per favore** ` imposta il codice di reset <https://www.fsij.org/doc-gnuk/gnuk-passphrase-setting.html>`_ **anche quando inizializzi la chiave!
