Repository: DamienCassou/nitrokey-documentation
Catalog: locales/*/LC_MESSAGES/start.po
Languages: it

source: `Generate keys on Nitrokey <openpgp-keygen-gpa.html>`_ - this is the best option if you are unexperienced, but you won’t have a backup of your keys and therefore won’t be able to mitigate the loss of the Nitrokey
it: `Genera le chiavi su Nitrokey <openpgp-keygen-gpa.html>`_ - questa è l'opzione migliore se non hai esperienza, ma non avrai un backup delle tue chiavi e quindi non potrai mitigare la perdita della Nitrokey

source: `Generate keys on Nitrokey with different algorithm or key size <openpgp-keygen-on-device.html>`_ - this is as secure as the previous option and thus you won’t have a backup as well, but you can change the key attributes (that is the algorithm and key size)
it: ` Genera chiavi su Nitrokey con un algoritmo o una dimensione diversa <openpgp-keygen-on-device.html>`_ - questo è sicuro come l'opzione precedente e quindi non avrai anche un backup, ma puoi cambiare gli attributi della chiave (cioè l'algoritmo e la dimensione della chiave)

source: `Generate keys locally <openpgp-keygen-backup.html>`_ and copy them to Nitrokey - this is the most flexible, expert option, but only secure if your system is not compromised, because you can create a backup key outside your Nitrokey A similar description in french can be found `here <https://xieme-art.org/post/importer-des-clefs-gnupg-dans-sa-nitrokey-pro/>`_.
it: `Genera le chiavi localmente <openpgp-keygen-backup.html>`_ e copiale su Nitrokey - questa è l'opzione più flessibile ed esperta, ma sicura solo se il tuo sistema non è compromesso, perché puoi creare una chiave di backup fuori da Nitrokey Una descrizione simile in francese può essere trovata ` qui <https://xieme-art.org/post/importer-des-clefs-gnupg-dans-sa-nitrokey-pro/>`_.

source: Importing Existing Keys
it: Importare le chiavi esistenti

source: If you already have OpenPGP keys you may want to use them with your Nitrokey, instead of generating new ones. Importing exsiting keys works basically the same as generating keys locally first and copy them to the Nitrokey (see above). Therefore, please have a look at the `corresponding instructions <openpgp-keygen-backup.html#key-import>`_. Note that you probably want to generate another subkey for authentication to your existing key. See at the same instructions for `subkey generation <openpgp-keygen-backup.html#subkey-for-authentication>`_.
it: Se avete già delle chiavi OpenPGP potreste volerle usare con la vostra Nitrokey, invece di generarne di nuove. Importare le chiavi esistenti funziona fondamentalmente come generare prima le chiavi localmente e copiarle sulla Nitrokey (vedi sopra). Pertanto, date un'occhiata alle ` istruzioni corrispondenti <openpgp-keygen-backup.html#key-import>`_. Notate che probabilmente volete generare un'altra sottochiave per l'autenticazione alla vostra chiave esistente. Vedi le stesse istruzioni per ` la generazione di sottochiavi <openpgp-keygen-backup.html#subkey-for-authentication>`_.

source: You can find further information about the usage on these pages:
it: Potete trovare ulteriori informazioni sull'uso in queste pagine:

source: for using `OpenPGP encryption with Thunderbird <openpgp-thunderbird.html>`_
it: per usare ` la crittografia OpenPGP con Thunderbird <openpgp-thunderbird.html>`_

source: for using `OpenPGP encryption with Outlook <openpgp-outlook.html>`_
it: per usare `la crittografia OpenPGP con Outlook <openpgp-outlook.html>`_

source: for using `Claws Mail <https://www.claws-mail.org/plugin.php?plugin=gpg>`_, an email client (and news reader) for Linux and Windows
it: per usare `Claws Mail <https://www.claws-mail.org/plugin.php?plugin=gpg>`_, un client di posta elettronica (e lettore di notizie) per Linux e Windows

source: for using `Evolution <https://help.gnome.org/users/evolution/stable/mail-encryption.html.en>`_, an email client for the Gnome Desktop on Linux systems
it: per l'utilizzo di `Evolution <https://help.gnome.org/users/evolution/stable/mail-encryption.html.en>`_, un client di posta elettronica per il desktop Gnome su sistemi Linux

source: for using `GPGTools <https://gpgtools.org/>`_ on macOS.
it: per usare `GPGTools <https://gpgtools.org/>`_ su macOS.

source: OpenPGP Key Generation With Backup
it: Generazione di chiavi OpenPGP con backup

source: The following instructions explain the generation of OpenPGP keys and how to copy them to the Nitrokey. This method has the advantage of providing a backup of the keys in case of losing or breaking the Nitrokey. The instructions are based on the command line interface of GnuPG. Thus, you need to have GnuPG installed on your system. The newest GnuPG version for Windows can be found `here <https://www.gpg4win.org/>`_ and the newest version for MacOS can be found `here <https://gpgtools.org/>`_. Users of Linux systems please install GnuPG with help of the package manager.
it: Le seguenti istruzioni spiegano la generazione di chiavi OpenPGP e come copiarle sulla Nitrokey. Questo metodo ha il vantaggio di fornire un backup delle chiavi in caso di perdita o rottura della Nitrokey. Le istruzioni sono basate sull'interfaccia a riga di comando di GnuPG. Quindi, dovete avere GnuPG installato sul vostro sistema. La versione più recente di GnuPG per Windows può essere trovata `qui <https://www.gpg4win.org/>`_ e la versione più recente per MacOS può essere trovata `qui <https://gpgtools.org/>`_. Gli utenti di sistemi Linux sono pregati di installare GnuPG con l'aiuto del gestore di pacchetti.

source: At first, you need to generate a key locally. You can decide, which key attributes to use and - most importantly - you can export the key and keep it somewhere save in case you need to restore the key.
it: All'inizio, è necessario generare una chiave a livello locale. Puoi decidere quali attributi chiave usare e - cosa più importante - puoi esportare la chiave e tenerla da qualche parte per salvarla nel caso tu abbia bisogno di ripristinarla.

source: Main Key and Encryption Subkey
it: Chiave principale e sottochiave di crittografia

source: We can use the command ``gpg --full-generate-key --expert`` to start a guided key generation with all possible options. You can choose the key type (usually RSA (1) or ECC (9)), the length of the key and other attributes. The following output is just a simple example, you may choose other values.
it: Possiamo usare il comando ``gpg --full-generate-key --expert`` per iniziare una generazione guidata della chiave con tutte le opzioni possibili. Si può scegliere il tipo di chiave (di solito RSA (1) o ECC (9)), la lunghezza della chiave e altri attributi. Il seguente output è solo un semplice esempio, puoi scegliere altri valori.

source: The following table illustrates which algorithm can be used on which device, in case you want to use different key attributes.
it: La seguente tabella illustra quale algoritmo può essere usato su quale dispositivo, nel caso in cui si vogliano usare diversi attributi chiave.

source: curve25519 (ECC)
it: curva25519 (ECC)

source: Subkey for Authentication
it: Sottochiave di autenticazione

source: You now have a main key with the capability to sign and certify (marked as [SC]) and a subkey for encryption (marked as [E]). It is necessary to have another subkey for use cases in which authentication is needed. This subkey is generated in the next step. Type in ``gpg --edit-key --expert keyID`` to start the process, whereas “keyID” is either the id of the key or the email address used during key generation.
it: Ora avete una chiave principale con la capacità di firmare e certificare (segnata come [SC]) e una sottochiave per la crittografia (segnata come [E]). È necessario avere un'altra sottochiave per i casi in cui è necessaria l'autenticazione. Questa sottochiave viene generata nel prossimo passo. Scrivi ``gpg --edit-key --expert keyID`` per iniziare il processo, mentre "keyID" è o l'id della chiave o l'indirizzo email usato durante la generazione della chiave.

source: Now you are in the interactive mode of GnuPG and you can add a key by simply typing ``addkey``. You need to choose the key you want to use. It is crucial to choose “set your own capabilities”, because we want to have the “authenticate” capability which is not available otherwise. We toggle sign and encrypt by typing ``s`` and ``e`` and we activate authenticate by typing ``a``.
it: Ora siete nella modalità interattiva di GnuPG e potete aggiungere una chiave semplicemente digitando ``addkey``. Dovete scegliere la chiave che volete usare. È fondamentale scegliere "set your own capabilities", perché vogliamo avere la capacità "authenticate" che altrimenti non è disponibile. Alterniamo la firma e la crittografia digitando ``s`` e ``e`` e attiviamo l'autenticazione digitando ``a``.

source: We quit with ``q``. Afterwards we need to answer the same questions as before. Finally, we have a ready-to-go key set which we can import to our device.
it: Usciamo con ``q``. Dopodiché dobbiamo rispondere alle stesse domande di prima. Infine, abbiamo un set di chiavi pronto per l'uso che possiamo importare nel nostro dispositivo.

source: Now is good time to backup your key. Please keep this backup very secure. It is best practice to never have this key on a regular computer which has connection to the internet, so that the key never gets compromised. You can create a backup with something like:
it: Ora è un buon momento per fare il backup della vostra chiave. Per favore tenete questo backup molto sicuro. È una buona pratica non avere mai questa chiave su un normale computer che abbia una connessione a internet, in modo che la chiave non venga mai compromessa. Puoi creare un backup con qualcosa come:

source: Key Import
it: Importazione chiave

source: You have a main key and two subkeys which can be imported to your Nitrokey. Before proceeding please make sure that you really have a backup of the key, if you need one. The ``keytocard`` command used in the next steps will **delete** your key from your disk!
it: Avete una chiave principale e due sottochiavi che possono essere importate nella vostra Nitrokey. Prima di procedere assicuratevi di avere davvero un backup della chiave, se ne avete bisogno. Il comando ``keytocard`` usato nei prossimi passi **cancellerà** la vostra chiave dal vostro disco!

source: We start the process by accessing the interactive interface of GnuPG again with ``gpg --edit-key --expert keyID``, whereas ``keyID`` is either the id of the key or the email address used during key generation.
it: Iniziamo il processo accedendo nuovamente all'interfaccia interattiva di GnuPG con ``gpg --edit-key --expert keyID``, mentre ``keyID`` è l'id della chiave o l'indirizzo email usato durante la generazione della chiave.

source: We just imported the main key to the card. Now we proceed with the two subkeys. We type ``key 1`` to select the encryption subkey and type in ``keytocard`` again and select the slot to use.
it: Abbiamo appena importato la chiave principale nella scheda. Ora procediamo con le due sottochiavi. Digitiamo ``key 1`` per selezionare la sottochiave di crittografia e digitiamo ``keytocard`` nuovamente e selezioniamo lo slot da utilizzare.

source: Now we deselect the first key with ``key 1`` and select the second subkey with ``key 2`` and move it as well with ``keytocard``. Afterwards we quit and save the changes.
it: Ora deselezioniamo la prima chiave con ``key 1`` e selezioniamo la seconda sottochiave con ``key 2`` e spostiamo anche questa con ``keytocard``. Dopodiché usciamo e salviamo le modifiche.

source: Your keys are now moved to the Nitrokey and thus secured in hardware. Congratulations!
it: Le tue chiavi sono ora spostate nella Nitrokey e quindi assicurate nell'hardware. Congratulazioni!

source: Exporting Public Key and Keyserver Usage
it: Esportazione della chiave pubblica e uso del Keyserver

source: Although you can start to use your Nitrokey right away after generating the keys on your system, you need to import your public key on every system, you want to use the Nitrokey on. So to be prepared you have two options: You either save the public key anywhere you like and use it on another system or you save the public key on a webpage/keyserver.
it: Anche se puoi iniziare a usare la tua Nitrokey subito dopo aver generato le chiavi sul tuo sistema, devi importare la tua chiave pubblica su ogni sistema su cui vuoi usare la Nitrokey. Quindi per essere preparati avete due opzioni: O salvi la chiave pubblica dove vuoi e la usi su un altro sistema o salvi la chiave pubblica su una pagina web/keyserver.

source: Generating a Public Key File
it: Generare un file di chiave pubblica

source: To get a simple file of your public key, you can just use ``gpg --armor --export keyID > pubkey.asc``. Use either the fingerprint as “keyID” (look at ``gpg -K`` to get it) or just use your email address as an identifier.
it: Per ottenere un semplice file della vostra chiave pubblica, potete semplicemente usare ``gpg --armor --export keyID > pubkey.asc``. Usa l'impronta digitale come "keyID" (guarda ``gpg -K`` per ottenerlo) o usa semplicemente il tuo indirizzo email come identificatore.

source: You can carry this file with you or send it to anyone who you like. This file is not secret at all. If you want to use the Nitrokey on another system, you first import this public key via ``gpg --import pubkey.asc`` and then types ``gpg --card-status`` so that the system knows where to look for this key. That’s all.
it: Potete portare questo file con voi o inviarlo a chiunque vogliate. Questo file non è affatto segreto. Se vuoi usare la Nitrokey su un altro sistema, prima importa questa chiave pubblica tramite ``gpg --import pubkey.asc`` e poi digita ``gpg --card-status`` in modo che il sistema sappia dove cercare questa chiave. Questo è tutto.

source: Uploading the Public Key
it: Caricare la chiave pubblica

source: If you do not want to carry a public keyfile with you, you can upload it to keyserver. You can do this by typing ``gpg --keyserver search.keyserver.net --send-key keyID``. If you are using another machine you can just import it by using ``gpg --keyserver search.keyserver.net --recv-key keyID``.
it: Se non volete portare con voi un keyfile pubblico, potete caricarlo su keyserver. Puoi farlo digitando ``gpg --keyserver search.keyserver.net --send-key keyID``. Se stai usando un'altra macchina puoi semplicemente importarlo usando ``gpg --keyserver search.keyserver.net --recv-key keyID``.

source: Another possibility is to change the URL setting on your card. Start ``gpg --card-edit`` again and first set the URL where the key is situated (e.g. on the keyserver or on your webpage etc.) via the ``url`` command. From now on you can import the key on another system by just using the ``fetch`` command within the ``gpg --card-edit environment``.
it: Un'altra possibilità è quella di cambiare l'impostazione dell'URL sulla vostra scheda. Avviate di nuovo ``gpg --card-edit`` e prima impostate l'URL dove si trova la chiave (ad esempio sul keyserver o sulla vostra pagina web ecc.) tramite il comando ``url``. D'ora in poi potrete importare la chiave su un altro sistema usando semplicemente il comando ``fetch`` all'interno del ``gpg --card-edit environment``.

source: OpenPGP Key Generation Using GPA
it: Generazione di chiavi OpenPGP usando GPA

source: The following instructions explain the generation of OpenPGP keys directly on the Nitrokey with help of the GNU Privacy Assistant (GPA). You won’t be able to create a backup of these keys. Thus, if you lose the Nitrokey or it breaks you can not decrypt mails or use these keys anymore. Please see `here <openpgp-outlook.html>`_ for a comparison of the different methods to generate OpenPGP keys.
it: Le seguenti istruzioni spiegano la generazione di chiavi OpenPGP direttamente su Nitrokey con l'aiuto del GNU Privacy Assistant (GPA). Non sarete in grado di creare un backup di queste chiavi. Quindi, se perdete la Nitrokey o si rompe, non potrete più decifrare le mail o usare queste chiavi. Vedi `qui <openpgp-outlook.html>`_ per un confronto dei diversi metodi per generare chiavi OpenPGP.

source: You need to have GnuPG and GPA installed on your system. The newest version for Windows can be found `here <https://www.gpg4win.org/>`_ (make sure to check “GPA” during the installation!). Users of Linux systems please install GnuPG and GPA with help of the package manager (e.g. using ``sudo apt install gnupg gpa`` on Ubuntu).
it: Dovete avere GnuPG e GPA installati sul vostro sistema. La versione più recente per Windows può essere trovata `qui <https://www.gpg4win.org/>`_ (assicuratevi di controllare "GPA" durante l'installazione!) Gli utenti di sistemi Linux sono pregati di installare GnuPG e GPA con l'aiuto del gestore di pacchetti (ad esempio usando ``sudo apt install gnupg gpa`` su Ubuntu).

source: At first, open the GNU Privacy Assistant (GPA). You may are asked to generate a key, you can skip this step for now by clicking “Do it later”. In the main window, please click on “Card” or “Card Manager”.
it: All'inizio, aprite il GNU Privacy Assistant (GPA). Potrebbe esserti chiesto di generare una chiave, puoi saltare questo passaggio per ora cliccando su "Fallo dopo". Nella finestra principale, clicca su "Card" o "Card Manager".

source: Another windows opens. Please go to “Card” -> “Generate key” to start the key generation process.
it: Si apre un'altra finestra. Vai su "Card" -> "Generate key" per iniziare il processo di generazione della chiave.

source: Now you can put in your name and the email address you want to use for the key that will be generated next. You may choose an expiration date for your key, but you don’t have to.
it: Ora puoi inserire il tuo nome e l'indirizzo email che vuoi usare per la chiave che verrà generata successivamente. Puoi scegliere una data di scadenza per la tua chiave, ma non è obbligatorio.

source: **Please do not use the backup checkbox**. This “backup” does only save the encryption key. In case of a loss of the device, you will not be able to restore the whole key set. So on the one hand it is no full backup (use `these instructions <openpgp-keygen-backup.html>`_ instead, if you need one) and on the other hand you risk that someone else can get in possession of your encryption key. The advantage of generating keys on-device is to make sure that keys are stored securely. Therefore, we recommend to skip this half-backup.
it: **Si prega di non usare la casella di controllo del backup**. Questo "backup" salva solo la chiave di crittografia. In caso di perdita del dispositivo, non sarà possibile ripristinare l'intero set di chiavi. Quindi da un lato non è un backup completo (usa ` queste istruzioni <openpgp-keygen-backup.html>`_ invece, se ne hai bisogno) e dall'altro rischi che qualcun altro possa entrare in possesso della tua chiave di cifratura. Il vantaggio di generare le chiavi sul dispositivo è quello di assicurarsi che le chiavi siano memorizzate in modo sicuro. Pertanto, si consiglia di saltare questo mezzo backup.

source: You will be asked for the admin PIN (default: 12345678) and the user PIN (default: 123456). When the key generation is finished, you can see the fingerprints of the keys on the bottom of the window. You may fill up the fields shown above, which are saved on your Nitrokey as well.
it: Ti verrà chiesto il PIN amministratore (predefinito: 12345678) e il PIN utente (predefinito: 123456). Quando la generazione della chiave è finita, puoi vedere le impronte delle chiavi nella parte inferiore della finestra. Potete riempire i campi mostrati sopra, che vengono salvati anche sulla vostra Nitrokey.

source: Now you can close the window and go back to the main window. Your key will be visible in the key manager after refreshing. Every application which makes use of GnuPG will work with your Nitrokey as well, because GnuPG is fully aware of the fact, that the keys are stored on your Nitrokey.
it: Ora puoi chiudere la finestra e tornare alla finestra principale. La vostra chiave sarà visibile nel gestore delle chiavi dopo il refresh. Ogni applicazione che fa uso di GnuPG funzionerà anche con la vostra Nitrokey, perché GnuPG è pienamente consapevole del fatto che le chiavi sono memorizzate sulla vostra Nitrokey.

source: Right-click on your key entry in the key manager and click “Export Keys…” to export the public key to a file and/or “Send Keys…” to upload the key to a keyserver.
it: Clicca con il tasto destro del mouse sulla voce della tua chiave nel key manager e clicca su "Esporta chiavi..." per esportare la chiave pubblica in un file e/o "Invia chiavi..." per caricare la chiave su un keyserver.

source: You can carry the keyfile with you or send it to anyone who you like. This file is not secret at all. If you want to use the Nitrokey on another system, you first import this public key via clicking on “Keys” -> “Importing Keys…” and choosing the file.
it: Potete portare il file chiave con voi o inviarlo a chiunque vogliate. Questo file non è affatto segreto. Se vuoi usare la Nitrokey su un altro sistema, devi prima importare questa chiave pubblica cliccando su "Keys" -> "Importing Keys..." e scegliendo il file.

source: If you do not want to carry a public keyfile with you, you can upload it to keyserver. If you are using another machine you can just import it by using “Server” -> “Retrieve Keys…” and entering your name or key id.
it: Se non vuoi portare con te un keyfile pubblico, puoi caricarlo su keyserver. Se stai usando un'altra macchina puoi semplicemente importarlo usando "Server" -> "Retrieve Keys..." e inserendo il tuo nome o l'id della chiave.

source: Another possibility is to change the URL setting on your card. Open the card manager again and fill in the URL where the key is situated (e.g. on the keyserver or on your webpage etc.). From now on you can import the key on another system by right-clicking on the URL and click on “Fetch Key”.
it: Un'altra possibilità è quella di cambiare l'impostazione dell'URL sulla tua scheda. Apri di nuovo il card manager e inserisci l'URL dove si trova la chiave (per esempio sul keyserver o sulla tua pagina web ecc.). D'ora in poi puoi importare la chiave su un altro sistema cliccando con il tasto destro sull'URL e cliccando su "Fetch Key".

source: OpenPGP Key Generation On-Device
it: Generazione di chiavi OpenPGP sul dispositivo

source: The following instructions explain the generation of OpenPGP keys directly on the Nitrokey. This is done by using the command line interface of GnuPG. Thus, you need to have GnuPG installed on your system. The newest GnuPG version for Windows can be found `here <https://www.gpg4win.org/>`_ and the newest version for MacOS can be found `here <https://gpgtools.org/>`_. Users of Linux systems please install GnuPG with help of the package manager.
it: Le seguenti istruzioni spiegano la generazione di chiavi OpenPGP direttamente su Nitrokey. Questo viene fatto usando l'interfaccia a riga di comando di GnuPG. Quindi, dovete avere GnuPG installato sul vostro sistema. La versione più recente di GnuPG per Windows può essere trovata `qui <https://www.gpg4win.org/>`_ e la versione più recente per MacOS può essere trovata `qui <https://gpgtools.org/>`_. Gli utenti di sistemi Linux sono pregati di installare GnuPG con l'aiuto del gestore di pacchetti.

source: These instructions are based on GnuPG version 2.2.6 or higher. Some Linux Distributions have an older version installed. In this case please choose a different method as listed `here <openpgp.html>`_ or install a newer version if possible.
it: Queste istruzioni si basano su GnuPG versione 2.2.6 o superiore. Alcune distribuzioni Linux hanno installato una versione precedente. In questo caso si prega di scegliere un metodo diverso come elencato `qui <openpgp.html>`_ o installare una versione più recente se possibile.
