Repository: DamienCassou/nitrokey-documentation
Catalog: locales/*/LC_MESSAGES/start.po
Languages: it

source: The following descriptions explain the basic key generation on-device via GnuPG’s command line interface. The default behaviour is to generate RSA keys of 2048 bit size. If you want to change the key algorithm and length, have a look at the next section first.
it: Le seguenti descrizioni spiegano la generazione di base delle chiavi sul dispositivo tramite l'interfaccia a riga di comando di GnuPG. Il comportamento predefinito è quello di generare chiavi RSA di 2048 bit. Se volete cambiare l'algoritmo e la lunghezza della chiave, date prima un'occhiata alla prossima sezione.

source: Open a command line and type ``gpg2 --card-edit``.
it: Aprite una linea di comando e digitate ``gpg2 --card-edit``.

source: To open the Windows command line please push the Windows-key and R-key. Now type ‘cmd.exe’ in the text field and hit enter. To open a Terminal on macOS or GNU/Linux please use the application search (e.g. spotlight on macOS).
it: Per aprire la riga di comando di Windows premete il tasto Windows e il tasto R. Ora scrivi 'cmd.exe' nel campo di testo e premi invio. Per aprire un terminale su macOS o GNU/Linux usa la ricerca delle applicazioni (ad esempio Spotlight su macOS).

source: Now you are in the interactive interface of GnuPG. Activate the admin commands with ``admin`` and use ``generate`` afterwards to start the generation of keys.
it: Ora siete nell'interfaccia interattiva di GnuPG. Attivate i comandi di amministrazione con ``admin`` e usate ``generate`` dopo per iniziare la generazione delle chiavi.

source: **Please do not create the suggested off-card backup.** This “backup” does only save the encryption key, but not the signature and authentication keys. In case of a loss of the device, you will not be able to restore the whole key set. So on the one hand it is no full backup (use `these instructions <openpgp-keygen-backup.html>`_ instead, if you need one) and on the other hand you risk that someone else can get in possession of your encryption key. The advantage of generating keys on-device is to make sure that keys are stored securely. Therefore, we recommend to skip this half-backup.
it: **Questo "backup" salva solo la chiave di crittografia, ma non la firma e le chiavi di autenticazione. In caso di perdita del dispositivo, non sarà possibile ripristinare l'intero set di chiavi. Quindi da un lato non è un backup completo (usate `queste istruzioni <openpgp-keygen-backup.html>`_ invece, se ne avete bisogno) e dall'altro lato rischiate che qualcun altro possa entrare in possesso della vostra chiave di cifratura. Il vantaggio di generare le chiavi sul dispositivo è quello di assicurarsi che le chiavi siano conservate in modo sicuro. Pertanto, si consiglia di saltare questo mezzo backup.

source: Now you have a complete key set on your device which can be used for the `various applications <https://www.nitrokey.com/documentation/applications>`_ listed on our site. Type ``quit`` and hit enter to exit.
it: Ora avete un set completo di chiavi sul vostro dispositivo che può essere utilizzato per le `varie applicazioni <https://www.nitrokey.com/documentation/applications>`_ elencate sul nostro sito. Scrivi ``quit`` e premi invio per uscire.

source: Change Key Attributes
it: Cambiare gli attributi chiave

source: This section is about changing the key attributes. If you want to use the default values, you can proceed with the next section.
it: Questa sezione riguarda la modifica degli attributi chiave. Se vuoi usare i valori predefiniti, puoi procedere con la prossima sezione.

source: Open a command line and type ``gpg2 --card-edit --expert``.
it: Aprite una linea di comando e digitate ``gpg2 --card-edit --expert``.

source: Now you are in the interactive interface of GnuPG. As you can see in the “Key attributes” field above, the default value rsa2048 is set. To change them, activate the admin commands with ``admin`` and use ``key-attr`` afterwards to change the attributes of the keys.
it: Ora siete nell'interfaccia interattiva di GnuPG. Come potete vedere nel campo "Key attributes" sopra, è impostato il valore predefinito rsa2048. Per cambiarli, attivate i comandi di amministrazione con ``admin`` e usate ``key-attr`` successivamente per cambiare gli attributi delle chiavi.

source: You can choose the attribute for each key (that is, signature, encryption and authentication key). Most people will use the same attributes for every key. Type ``list`` to see the results (have look at the “Key attributes” field, which now reads rsa4096).
it: Puoi scegliere l'attributo per ogni chiave (cioè firma, chiave di crittografia e di autenticazione). La maggior parte delle persone userà gli stessi attributi per ogni chiave. Scrivi ``list`` per vedere i risultati (guarda il campo "Key attributes", che ora dice rsa4096).

source: Type ``quit`` and hit enter to exit or proceed directly with the previous section to actually generate the keys with the key attributes you just set.
it: Scrivi ``quit`` e premi invio per uscire o procedi direttamente con la sezione precedente per generare effettivamente le chiavi con gli attributi chiave che hai appena impostato.

source: The following table illustrates which algorithm can be used on which device.
it: La seguente tabella illustra quale algoritmo può essere utilizzato su quale dispositivo.

source: To get a simple file of your public key, you can just use ``gpg2 --armor --export keyID > pubkey.asc``. Use either the fingerprint as “keyID” (look at ``gpg -K`` to get it) or just use your email address as an identifier.
it: Per ottenere un semplice file della vostra chiave pubblica, potete semplicemente usare ``gpg2 --armor --export keyID > pubkey.asc``. Usa l'impronta digitale come "keyID" (guarda ``gpg -K`` per ottenerlo) o usa semplicemente il tuo indirizzo email come identificatore.

source: You can carry this file with you or send it to anyone who you like. This file is not secret at all. If you want to use the Nitrokey on another system, you first import this public key via ``gpg2 --import pubkey.asc`` and then types ``gpg2 --card-status`` so that the system knows where to look for this key. That’s all.
it: Potete portare questo file con voi o inviarlo a chiunque vogliate. Questo file non è affatto segreto. Se volete usare la Nitrokey su un altro sistema, dovete prima importare questa chiave pubblica tramite ``gpg2 --import pubkey.asc`` e poi scrivere ``gpg2 --card-status`` in modo che il sistema sappia dove cercare questa chiave. Questo è tutto.

source: Another possibility is to change the URL setting on your card. Start gpg –card-edit again and first set the URL where the key is situated (e.g. on the keyserver or on your webpage etc.) via the ``url`` command. From now on you can import the key on another system by just using the ``fetch`` command within the ``gpg --card-edit`` environment.
it: Un'altra possibilità è cambiare l'impostazione dell'URL sulla vostra scheda. Avviate nuovamente gpg -card-edit e per prima cosa impostate l'URL dove si trova la chiave (ad esempio sul keyserver o sulla vostra pagina web ecc.) tramite il comando ``url``. D'ora in poi potrete importare la chiave su un altro sistema usando semplicemente il comando ``fetch`` all'interno dell'ambiente ``gpg --card-edit``.

source: OpenPGP Email Encryption with Outlook
it: Crittografia e-mail OpenPGP con Outlook

source: Unfortunately, there is no solution to use OpenPGP in Outlook for macOS yet.
it: Purtroppo, non esiste ancora una soluzione per utilizzare OpenPGP in Outlook per macOS.

source: Prerequisites
it: Prerequisiti

source: If you do not have PGP-Keys on your Nitrokey yet, please look at `this page <openpgp.html>`_ first.
it: Se non avete ancora PGP-Keys sulla vostra Nitrokey, guardate prima ` questa pagina <openpgp.html>`_.

source: You need to have GnuPG installed on your System. The newest GnuPG version for Windows can be found `here <https://www.gpg4win.org>`_. You need to make sure to have “GpgOL” checked during installation process (see below).
it: Dovete avere GnuPG installato sul vostro sistema. La versione più recente di GnuPG per Windows può essere trovata `qui <https://www.gpg4win.org>`_. Dovete assicurarvi di aver spuntato "GpgOL" durante il processo di installazione (vedi sotto).

source: After installing GPG4Win along with GpgOL, you will see a new icon labeled “Secure” in the composing window. To encrypt and sign a mail you just click on the sign like seen below.
it: Dopo aver installato GPG4Win insieme a GpgOL, vedrete una nuova icona etichettata "Secure" nella finestra di composizione. Per crittografare e firmare una mail basta cliccare sul segno come si vede qui sotto.

source: GnuPG will start signing and encrypting the mail as soon as you click on ‘send’. You are requested to choose the identity you want to sign with and encrypt for.
it: GnuPG inizierà a firmare e crittografare la posta non appena si clicca su "invia". Viene richiesto di scegliere l'identità con cui si vuole firmare e crittografare.

source: Furthermore, you are asked for typing in the User PIN of the Nitrokey for signing the mail.
it: Inoltre, vi viene chiesto di digitare il PIN utente della Nitrokey per firmare la posta.

source: You will be asked automatically for your User PIN if you want to read an encrypted mail.
it: Ti verrà chiesto automaticamente il tuo PIN utente se vuoi leggere una mail criptata.

source: OpenPGP Email Encryption With Thunderbird
it: Crittografia e-mail OpenPGP con Thunderbird

source: Thunderbird 78.3 and newer
it: Thunderbird 78.3 e più recente

source: At the moment Thunderbird’s 78 support for the OpenPGP emails is not easy to set up. See `Thunderbird’s documentation <https://wiki.mozilla.org/Thunderbird:OpenPGP:Smartcards>`_ for details. Here is a `comprehensive German guide <https://decatec.de/it/thunderbird-78-pgp-verschluesselung-mit-dem-nitrokey-storage/>`_.
it: Al momento il supporto 78 di Thunderbird per le email OpenPGP non è facile da configurare. Vedere ` la documentazione di Thunderbird <https://wiki.mozilla.org/Thunderbird:OpenPGP:Smartcards>`_ per i dettagli. Qui c'è una `guida tedesca completa <https://decatec.de/it/thunderbird-78-pgp-verschluesselung-mit-dem-nitrokey-storage/>`_.

source: Error message: ``The configured key ID '4BA0183FCBA844A7' cannot be found on your keyring``
it: Messaggio di errore: ``The configured key ID '4BA0183FCBA844A7' cannot be found on your keyring``

source: Make sure that the public key is imported to the Thunderbird’s manager and
it: Assicurati che la chiave pubblica sia importata nel gestore di Thunderbird e

source: The key ID does not contain any whitespace, and consists of 16 characters from range 0-9 A-F
it: L'ID della chiave non contiene spazi bianchi e consiste di 16 caratteri dall'intervallo 0-9 A-F

source: you have GPA or Kleopatra software installed.
it: avete installato il software GPA o Kleopatra.

source: Please use Kleopatra or `GPA <openpgp-keygen-gpa.html>`_ software to handle the smart card.
it: Si prega di utilizzare Kleopatra o `GPA <openpgp-keygen-gpa.html>`_ software per gestire la smart card.

source: Thunderbird 77 and older
it: Thunderbird 77 e più vecchio

source: Installation
it: Installazione

source: Install the device driver as described `here <https://www.nitrokey.com/documentation/installation>`_.
it: Installare il driver del dispositivo come descritto ` qui <https://www.nitrokey.com/documentation/installation>`_.

source: Install `Thunderbird <https://www.thunderbird.net/en-US/>`_ and the Add-on `Enigmail <https://www.enigmail.net/index.php/en/>`_.
it: Installare `Thunderbird <https://www.thunderbird.net/en-US/>`_ e l'add-on `Enigmail <https://www.enigmail.net/index.php/en/>`_.

source: Changing PINs
it: Cambiare i PIN

source: There are two PINs for the Nitrokey:
it: Ci sono due PIN per la Nitrokey:

source: The User PIN required for daily work
it: Il PIN utente necessario per il lavoro quotidiano

source: The Admin PIN is required to change keys or other settings of the device. In addition, the Nitrokey can be unlocked (for example, after 3 times incorrect input of the User PIN) by means of the Admin PIN.
it: Il PIN amministratore è necessario per cambiare i tasti o altre impostazioni del dispositivo. Inoltre, la Nitrokey può essere sbloccata (per esempio, dopo 3 volte l'inserimento errato del PIN utente) per mezzo del PIN amministratore.

source: After receiving the Nitrokey, you should immediately change the User PIN = “123456” and Admin PIN = “12345678”.
it: Dopo aver ricevuto la Nitrokey, dovete immediatamente cambiare il PIN utente = "123456" e il PIN amministratore = "12345678".

source: Procedure
it: Procedura

source: Insert the Nitrokey into a USB port on your computer.
it: Inserisci la Nitrokey in una porta USB del tuo computer.

source: Start Thunderbird.
it: Avviare Thunderbird.

source: In Thunderbird, select as shown in the following picture. “OpenPGP” → “Manage smart card”
it: In Thunderbird, selezionare come mostrato nell'immagine seguente. "OpenPGP" → "Gestisci smart card"

source: In the “SmartCard Details” window, select “SmartCard → Change PIN”
it: Nella finestra "Dettagli della SmartCard", seleziona "SmartCard → Modifica PIN"

source: Select “Change PIN”. This is your User PIN you need for daily work. Enter the current PIN ( “123456” for delivery) and twice your new PIN. For this PIN you can use the characters: a-z A-Z 0-9 / .;;:- !? () [] {}% +. The PIN should be at least 6 characters long. Click “OK”.
it: Seleziona "Cambia PIN". Questo è il tuo PIN utente che ti serve per il lavoro quotidiano. Inserisci il PIN attuale ("123456" per la consegna) e due volte il tuo nuovo PIN. Per questo PIN puoi usare i caratteri: a-z A-Z 0-9 / .;;:- !? () [] {}% +. Il PIN deve essere lungo almeno 6 caratteri. Clicca su "OK".

source: Repeat the procedure for the Admin PIN. “SmartCard → Change PIN”
it: Ripetere la procedura per il PIN dell'amministratore. "SmartCard → Modifica PIN"

source: Select Change Admin PIN. This is your Admin PIN that you only rarely need. Enter the current PIN ( “12345678” for delivery) and the new PIN twice. For this PIN, you can use the characters: a-z A-Z 0-9 / .;;:- !? () [] {}% +. The PIN should be at least 8 characters long. Click “OK”.
it: Seleziona Change Admin PIN. Questo è il tuo PIN amministratore che ti serve solo raramente. Inserisci il PIN attuale ("12345678" per la consegna) e il nuovo PIN due volte. Per questo PIN, puoi usare i caratteri: a-z A-Z 0-9 / .;;:- !? () [] {}% +. Il PIN deve essere lungo almeno 8 caratteri. Clicca su "OK".

source: You have now changed the PINs and should continue to generate your personal keys.
it: Ora hai cambiato i PIN e dovresti continuare a generare le tue chiavi personali.

source: Generation of Keys
it: Generazione di chiavi

source: To encrypt data and e-mails, a key pair consisting of a public key and a private key, must first be generated. The so-called public key is used to **en**\ crypt the data or e-mails. You can distribute this to all those with whom you want to communicate securely (for example, publish it publicly on your site). The so-called private key is used to **de**\ crypt the data or messages. This key should **NEVER** be made known! Usually, you also do not have direct access to it (see below), since this is stored securely on the Nitrokey. Use the Nitrokey to create both keys using the following procedure:
it: Per criptare i dati e le e-mail, si deve prima generare una coppia di chiavi composta da una chiave pubblica e una chiave privata. La cosiddetta chiave pubblica viene utilizzata per criptare i dati o le e-mail. Puoi distribuirla a tutti coloro con cui vuoi comunicare in modo sicuro (per esempio, pubblicandola pubblicamente sul tuo sito). La cosiddetta chiave privata serve a **criptare i dati o i messaggi. Questa chiave non deve **mai** essere resa nota! Di solito, non hai nemmeno accesso diretto ad essa (vedi sotto), poiché è memorizzata in modo sicuro sulla Nitrokey. Usate la Nitrokey per creare entrambe le chiavi usando la seguente procedura:

source: Insert the Nitrokey into a USB port on your computer. StartThunderbird
it: Inserisci la Nitrokey in una porta USB del tuo computer. AvviareThunderbird

source: In Thunderbird, select as shown in the following picture „OpenPGP“ → „Manage Smart Card“
it: In Thunderbird, selezionare come mostrato nell'immagine seguente "OpenPGP" → "Manage Smart Card"

source: In the “SmartCard details” window, select “SmartCard” → “Generate key”
it: Nella finestra "Dettagli SmartCard", seleziona "SmartCard" → "Genera chiave"

source: In the following window, select your e-mail address for which you want to generate keys. Verify that the e-mail address specified in “User ID” is correct. You can also specify whether a private key backup copy should be stored on your computer.
it: Nella seguente finestra, seleziona il tuo indirizzo e-mail per il quale vuoi generare le chiavi. Verifica che l'indirizzo e-mail specificato in "User ID" sia corretto. Puoi anche specificare se una copia di backup della chiave privata deve essere memorizzata sul tuo computer.

source: If you do not create a backup copy, you have no chance to get your encrypted data if the Nitrokey is lost or damaged!
it: Se non crei una copia di backup, non hai alcuna possibilità di recuperare i tuoi dati criptati se la Nitrokey viene persa o danneggiata!

source: It is recommended to store this safety device. Select “Save key copy of the key outside the Smard Card”. Then enter your personal password for the backup copy under “Passphrase”. This password should not be less than 8 characters, and should contain both uppercase and lowercase letters and numbers. You can also use a long sentence, but avoid known prose or lyric. Also, no name or known term should be used.
it: Si raccomanda di conservare questo dispositivo di sicurezza. Selezioni "Salva la copia della chiave fuori dalla Smard Card". Poi inserisci la tua password personale per la copia di sicurezza sotto "Passphrase". Questa password non dovrebbe essere inferiore a 8 caratteri e dovrebbe contenere sia lettere maiuscole che minuscole e numeri. Puoi anche usare una frase lunga, ma evita la prosa o i testi noti. Inoltre, nessun nome o termine noto dovrebbe essere usato.

source: **Allowed characters**: a-z A-Z 0-9 /.,;:-!?( )%+ (no umlauts ä,ü,ö,Ä,Ü,Ö or ß)
it: **Caratteri consentiti**: a-z A-Z 0-9 /.,;:-!?( )%+ (no umlaut ä,ü,ö,Ä,Ü,Ö o ß)

source: **Poor Password**: qwerty123, ILoveSusi3, Password, If you can dream it, you can do it.
it: **Poor Password**: qwerty123, ILoveSusi3, Password, Se puoi sognarlo, puoi farlo.

source: **Strong Password**: g(Ak?2Pn7Yn or Ki.stg2bLqzp%d or A dog with greeen Earz and fife legs (spelling errors increase security)
it: **Password forte**: g(Ak?2Pn7Yn o Ki.stg2bLqzp%d o A dog with greeen Earz and fife legs (gli errori di ortografia aumentano la sicurezza)

source: You do **not** need this password for daily work. It is only necessary for the restoration of the secret key, e.g. if you have lost the Nitrokey. Therefore, keep the password in a safe place.
it: Non avete **non** bisogno di questa password per il lavoro quotidiano. È necessaria solo per il ripristino della chiave segreta, ad esempio se hai perso la Nitrokey. Pertanto, conserva la password in un luogo sicuro.

source: You can also specify whether and when the key should be automatically invalid. This means, from this point onwards, no more e-mails can be encrypted with this key and you have to create a new key pair.
it: Potete anche specificare se e quando la chiave deve essere automaticamente invalidata. Ciò significa che, da questo punto in poi, non si possono più criptare e-mail con questa chiave e si deve creare una nuova coppia di chiavi.

source: Finally, click on “Generate key pair”.
it: Infine, clicca su "Genera coppia di chiavi".

source: You are now asked if the key should be generated. Confirm with “Yes”.
it: Ora ti viene chiesto se la chiave deve essere generata. Confermate con "Sì".

source: In order for the program to write your keys to the stick, you must enter the admin PIN and the user PIN (changed above).
it: Affinché il programma scriva le tue chiavi sulla chiavetta, devi inserire il PIN amministratore e il PIN utente (modificato sopra).

source: The key generation can take a few minutes. Do not terminate the program prematurely!
it: La generazione della chiave può durare alcuni minuti. Non terminate prematuramente il programma!

source: When the key generation is complete, you receive the following message. A certificate is now created that allows you to invalidate your key in an emergency. This certificate is automatically saved with your private key. This should be printed out or backed up on at least one other external medium so that you can revoke the validity of the keys if your keys and backups are lost. Click “Yes”
it: Quando la generazione della chiave è completa, si riceve il seguente messaggio. Ora viene creato un certificato che ti permette di invalidare la tua chiave in caso di emergenza. Questo certificato viene automaticamente salvato con la vostra chiave privata. Questo dovrebbe essere stampato o fatto un backup su almeno un altro supporto esterno in modo da poter revocare la validità delle chiavi se le chiavi e i backup vengono persi. Fare clic su "Sì".

source: You can now select the directory in which the backup copy is stored. This copy is encrypted with your password entered above. This means that no one can read or use the keys without your password. Do not give your password to anyone. This file with the name of your e-mail address and the suffix “.asc” should be backed up on another medium. After selecting the directory, click “Save”.
it: Ora puoi selezionare la directory in cui viene memorizzata la copia di backup. Questa copia è criptata con la tua password inserita sopra. Questo significa che nessuno può leggere o usare le chiavi senza la tua password. Non date la vostra password a nessuno. Questo file con il nome del tuo indirizzo e-mail e il suffisso ".asc" deve essere salvato su un altro supporto. Dopo aver selezionato la directory, clicca su "Salva".

source: Here you must again specify your user PIN or passphrase. Then click “OK”
it: Qui devi di nuovo specificare il tuo PIN utente o la tua passphrase. Poi clicca su "OK".

source: You will now see the message that the certificate was created and saved. Click “OK”
it: Ora vedrai il messaggio che il certificato è stato creato e salvato. Clicca su "OK".

source: Key generation is now complete. You can now exit the program (File - Close).
it: La generazione della chiave è ora completa. Ora puoi uscire dal programma (File - Close).

source: Your Nitrokey is personalized and ready to use. **Have fun with the secure email encryption!**
it: La tua Nitrokey è personalizzata e pronta all'uso. **Divertiti con la crittografia sicura delle e-mail!

source: This mini-howto assumes that the Nitrokey has been initialized and contains cryptographic keys.
it: Questo mini-howto presuppone che Nitrokey sia stato inizializzato e che contenga chiavi crittografiche.

source: **Required on the client side:**
it: **Richiesto sul lato client:**

source: `PuTTY <https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html>`_ or a variant of it
it: `PuTTY <https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html>`_ o una sua variante

source: `GPG4Win <https://gpg4win.org/>`_ or `pageant.exe <https://smartcard-auth.de/download-de.html>`_ with Smartcard support from Dr. Peter Koch
it: `GPG4Win <https://gpg4win.org/>`_ o `pageant.exe <https://smartcard-auth.de/download-de.html>`_ con supporto Smartcard dal Dr. Peter Koch
