Repository: DamienCassou/nitrokey-documentation
Catalog: locales/*/LC_MESSAGES/start.po
Languages: it

source: **Q:** Which Operating Systems are supported?
it: **Q:** Quali sistemi operativi sono supportati?

source: Windows, Linux, and Mac OS X.
it: Windows, Linux e Mac OS X.

source: **Q:** What can I use the Nitrokey for?
it: **Q:** Per cosa posso usare la Nitrokey?

source: See the `frontpage`_ for an overview of supported use cases.
it: Vedere la `frontpage`_ per una panoramica dei casi d'uso supportati.

source: **Q:** What are the default PINs?
it: **Q:** Quali sono i PIN di default?

source: **User PIN:** "123456"
it: **PIN utente:** "123456"

source: **Administrator PIN:** "12345678"
it: **PIN dell'amministratore:** "12345678"

source: We strongly recommend to change these PINs/password to user-chosen values before using the Nitrokey.
it: Raccomandiamo vivamente di cambiare questi PIN/password con valori scelti dall'utente prima di usare la Nitrokey.

source: **Q:** What is the maximum length of the PIN?
it: **Q:** Qual è la lunghezza massima del PIN?

source: Nitrokey uses PINs instead of passwords. The main difference is that the hardware limits the amount of tries to three while a limit doesn't exist for passwords. Because of this, a short PIN is still secure and there is not need to choose a long and complex PIN.
it: Nitrokey usa i PIN invece delle password. La differenza principale è che l'hardware limita la quantità di tentativi a tre mentre un limite non esiste per le password. Per questo motivo, un PIN breve è ancora sicuro e non è necessario scegliere un PIN lungo e complesso.

source: Nitrokey Storage's PINs can be up to 20 digits long and can consist of numbers, characters and special characters. Note: When using GnuPG or OpenSC, 32 character long PINs can be used but aren't supported by Nitrokey App.
it: I PIN di Nitrokey Storage possono essere lunghi fino a 20 cifre e possono essere composti da numeri, caratteri e caratteri speciali. Nota: Quando si usa GnuPG o OpenSC, si possono usare PIN lunghi 32 caratteri ma non sono supportati da Nitrokey App.

source: **Q:** What is the User PIN for?
it: **Q:** A cosa serve il PIN utente?

source: The user PIN is at least 6-digits long and is used to get access to the contect of the Nitrokey. This is the PIN you will use a lot in every day use e.g. for decrypting messages, for unlocking your encrypted storage (NK Storage only) etc.
it: Il PIN utente è lungo almeno 6 cifre e viene usato per accedere al contenuto della Nitrokey. Questo è il PIN che userai molto nell'uso quotidiano, ad esempio per decriptare i messaggi, per sbloccare il tuo storage criptato (solo NK Storage) ecc.

source: The user PIN can have up to 20 digits and other characters (e.g. alphabetic and special characters). But as the user PIN is blocked as soon three wrong PIN attempts were done, it is sufficiently secure to only have a 6 digits PIN. The default PIN is 123456.
it: Il PIN utente può avere fino a 20 cifre e altri caratteri (per esempio alfabetici e speciali). Ma dato che il PIN utente viene bloccato non appena vengono fatti tre tentativi di PIN errati, è sufficientemente sicuro avere solo un PIN di 6 cifre. Il PIN di default è 123456.

source: **Q:** What is the Admin PIN for?
it: **Q:** A cosa serve il PIN dell'amministratore?

source: The admin PIN is at least 8-digits long and is used to change contents/settings of the Nitrokey. That is to say after initializing the Nitrokey you probably won't need this PIN too often (e.g. if you want to add another password to the password safe of the Nitrokey Pro or Nitrokey Storage).
it: Il PIN di amministrazione è lungo almeno 8 cifre e serve per cambiare i contenuti/impostazioni di Nitrokey. Questo significa che dopo aver inizializzato la Nitrokey probabilmente non avrete bisogno di questo PIN troppo spesso (ad esempio se volete aggiungere un'altra password alla cassaforte di Nitrokey Pro o Nitrokey Storage).

source: The admin PIN can have up to 20 digits and other characters (e.g. alphabetic and special characters). But as the admin PIN is blocked as soon three wrong PIN attempts were done, it is sufficiently secure to only have 8 digits PIN. The default PIN is 12345678.
it: Il PIN amministrativo può avere fino a 20 cifre e altri caratteri (per esempio alfabetici e speciali). Ma dato che il PIN amministrativo viene bloccato non appena vengono fatti tre tentativi di PIN errati, è sufficientemente sicuro avere solo 8 cifre di PIN. Il PIN di default è 12345678.

source: **Q:** Which drivers/tools can be used?
it: **Q:** Quali driver/strumenti possono essere utilizzati?

source: GnuPG is required for many use cases. It is a command line tool but usually you don't need to invoke it directly but use another application with user interface.
it: GnuPG è necessario per molti casi d'uso. È uno strumento a riga di comando, ma di solito non è necessario invocarlo direttamente, ma utilizzare un'altra applicazione con interfaccia utente.

source: Don't use GnuPG in parallel with OpenSC or another PKCS#11 driver because both may interfere and unexpected issues may result.
it: Non usate GnuPG in parallelo con OpenSC o un altro driver PKCS#11 perché entrambi potrebbero interferire e potrebbero verificarsi problemi inaspettati.

source: Install GPG4Win which contains Gnu Privacy Assistant (GPA) and GnuPG (GPG). Start Gnu Privacy Assistant (GPA) or another application such as your email client to use GnuPG. Advanced users could use GnuPG directly (command line). Please note: The Fellowship smart card is similar to the Nitrokey Pro so that this instructions work Nitrokey as well. In general the official documentation is recommended.
it: Installare GPG4Win che contiene Gnu Privacy Assistant (GPA) e GnuPG (GPG). Avviate Gnu Privacy Assistant (GPA) o un'altra applicazione come il vostro client di posta elettronica per usare GnuPG. Gli utenti avanzati possono usare GnuPG direttamente (linea di comando). Nota: la smart card Fellowship è simile alla Nitrokey Pro, quindi queste istruzioni funzionano anche con Nitrokey. In generale si raccomanda la documentazione ufficiale.

source: **Q:** Which algorithms and maximum key length are supported?
it: **Q:** Quali algoritmi e la lunghezza massima della chiave sono supportati?

source: See the following table:
it: Vedere la seguente tabella:

source: Start
it: Iniziare

source: curve25519
it: curva25519

source: **Q:** Does the Nitrokey Start contain a secure chip or just a normal microcontroller?
it: **Q:** La Nitrokey Start contiene un chip sicuro o solo un normale microcontrollore?

source: Nitrokey Start is implemented in the microprocessor.
it: Nitrokey Start è implementato nel microprocessore.

source: **Q:** How large is the storage capacity?
it: **Q:** Quanto è grande la capacità di stoccaggio?

source: The Nitrokey Start doesn't contain storage capability for ordinary data (it can only store cryptographic keys and certificates).
it: Nitrokey Start non contiene capacità di memorizzazione di dati ordinari (può solo memorizzare chiavi crittografiche e certificati).

source: First check the:
it: Prima controlla il:

source: or choose your operating system:
it: o scegliete il vostro sistema operativo:

source: Firmware Update
it: Aggiornamento del firmware

source: To update the firmware of your Nitrokey Start, proceed as follows.
it: Per aggiornare il firmware del vostro Nitrokey Start, procedete come segue.

source: Install pip3.
it: Installare pip3.

source: Install pynitrokey. For this you need an Internet connection.
it: Installare pynitrokey. Per questo hai bisogno di una connessione a Internet.

source: Connect your Nitrokey Start and verify its recognition.
it: Collega il tuo Nitrokey Start e verifica il suo riconoscimento.

source: Start the update process. For this you need an Internet connection.
it: Avviare il processo di aggiornamento. Per questo avete bisogno di una connessione a Internet.

source: You will then be asked to enter the Admin PIN of your Nitrokey Start. (Default PIN: 12345678)
it: Ti verrà quindi chiesto di inserire il PIN Admin del tuo Nitrokey Start. (PIN predefinito: 12345678)

source: Under “Device” you will find information about the current version of your Nitrokey Start. In the first item under “Please note” you can see the latest firmware version available. Now you have to confirm the update with “yes”.
it: Sotto "Dispositivo" troverete informazioni sulla versione attuale del vostro Nitrokey Start. Nella prima voce sotto "Please note" puoi vedere l'ultima versione del firmware disponibile. Ora devi confermare l'aggiornamento con "Sì".

source: You can check the firmware version after the upgrade process has completed.
it: Potete controllare la versione del firmware dopo che il processo di aggiornamento è stato completato.

source: Setup with Gnu Privacy Assistant (GPA)
it: Impostazione con Gnu Privacy Assistant (GPA)

source: This document describes how to use Gnu Privacy Assistant (GPA) to set up the Nitrokey for its first usage.
it: Questo documento descrive come usare Gnu Privacy Assistant (GPA) per impostare la Nitrokey per il suo primo utilizzo.

source: First you need to install Gnu Privacy Assistant (GPA). For Windows you should download and install the `GPG4Win <https://www.gpg4win.org/>`_ package which contains GPA. For Linux you should install the GPA package of your distribution (e.g. on Ubuntu: sudo apt-get install gpa ).
it: Per prima cosa è necessario installare Gnu Privacy Assistant (GPA). Per Windows dovreste scaricare e installare il pacchetto `GPG4Win <https://www.gpg4win.org/>`_ che contiene GPA. Per Linux dovreste installare il pacchetto GPA della vostra distribuzione (ad esempio su Ubuntu: sudo apt-get install gpa ).

source: Start GPA and select the Card Manager; either by pressing the icon at the top or by choosing Card Manager in the Windows menu.
it: Avvia la GPA e seleziona Card Manager; premendo l'icona in alto o scegliendo Card Manager nel menu di Windows.

source: The window of the Card Manager will appear. Enter your salutation, name and optional other information. While doing so you might be asked to enter the admin PIN.
it: Apparirà la finestra del Card Manager. Inserisci il tuo saluto, il tuo nome e altre informazioni opzionali. Mentre lo fai potrebbe esserti chiesto di inserire il PIN dell'amministratore.

source: Confirm this window and enter the admin PIN in the next window.
it: Confermate questa finestra e inserite il PIN dell'amministratore nella finestra successiva.

source: In the Card Manager window you might need to scroll down until you see the buttons to change the PINs. The term PIN is used interchangeable with "password". Press the first button "Change PIN" in order to change the user password. Read and confirm the following information window.
it: Nella finestra Card Manager potrebbe essere necessario scorrere verso il basso fino a vedere i pulsanti per cambiare i PIN. Il termine PIN è usato in modo intercambiabile con "password". Premi il primo pulsante "Cambia PIN" per cambiare la password utente. Leggere e confermare la seguente finestra informativa.

source: Choose and enter your own PIN with a minimum length of six characters. This PIN is required for the daily usage of the Nitrokey.
it: Scegli e inserisci il tuo PIN con una lunghezza minima di sei caratteri. Questo PIN è necessario per l'uso quotidiano della Nitrokey.

source: Go back to the Card Manager window in step three. This time you choose the third button Change PIN in order to change the admin PIN. The admin PIN is required to change the information on the Nitrokey and to change the cryptographic keys. Proceed as described in steps four and five.
it: Torna alla finestra Card Manager al punto tre. Questa volta scegli il terzo pulsante Change PIN per cambiare il PIN dell'amministratore. Il PIN amministratore è necessario per cambiare le informazioni sulla Nitrokey e per cambiare le chiavi crittografiche. Procedi come descritto nei passi quattro e cinque.

source: After changing both the user and the admin PIN, you are back in the Card Manager window. Select "Generate key" in the "Card" menu.
it: Dopo aver cambiato sia il PIN dell'utente che quello dell'amministratore, sei di nuovo nella finestra Card Manager. Seleziona "Genera chiave" nel menu "Carta".

source: Enter your name and e-mail address. You should keep "backup" enabled in order to create a backup file of your cryptographic keys. Optionally you might select an expiration date for your cryptographic keys.
it: Inserisci il tuo nome e il tuo indirizzo e-mail. Dovresti tenere "backup" abilitato per creare un file di backup delle tue chiavi crittografiche. Opzionalmente puoi selezionare una data di scadenza per le tue chiavi crittografiche.

source: Wait until the keys are generated successfully.
it: Aspettate che le chiavi siano generate con successo.

source: Enter a strong passphrase for your backup keys. We strongly recommend to store the backup file on a separate storage(e.g. CD-ROM) and on a safe location.
it: Inserisci una passphrase forte per le tue chiavi di backup. Raccomandiamo vivamente di memorizzare il file di backup su una memoria separata (ad esempio un CD-ROM) e in un luogo sicuro.

source: Congratulations, your Nitrokey is now ready to use. Please see the `applications <https://www.nitrokey.com/documentation/applications>`_ section for further information of its usage.
it: Congratulazioni, la vostra Nitrokey è ora pronta all'uso. Si prega di consultare la sezione `applicazioni <https://www.nitrokey.com/documentation/applications>`_ per ulteriori informazioni sul suo utilizzo.

source: Install ``scdaemon`` and GnuPG 2.1 or higher by using your package manager (e.g. ``apt update && apt install scdaemon gnupg2`` on Ubuntu).
it: Installare ``scdaemon`` e GnuPG 2.1 o superiore utilizzando il proprio gestore di pacchetti (ad esempio ``apt update && apt install scdaemon gnupg2`` su Ubuntu).

source: Connect your Nitrokey to your computer.
it: Collega la tua Nitrokey al tuo computer.

source: Use GnuPG to `generate new keys or import existing ones <openpgp.html>`_.
it: Usate GnuPG per ` generare nuove chiavi o importare quelle esistenti <openpgp.html>`_.

source: It is indeed necessary to first import or create new keys and change the PINs afterwards. Otherwise changing User PIN will fail! Furthermore overriding keys results in PIN reset (default values), please keep this in mind!
it: È infatti necessario prima importare o creare nuove chiavi e poi cambiare i PIN. Altrimenti la modifica del PIN utente non riuscirà! Inoltre, la sovrascrittura delle chiavi comporta la reimpostazione del PIN (valori predefiniti), tienilo a mente!

source: Change the Admin PIN (default: ``12345678``) and then the User PIN (default: ``123456``) to your own choices.
it: Cambia il PIN dell'amministratore (predefinito: ``12345678``) e poi il PIN dell'utente (predefinito: ``123456``) secondo le tue scelte.

source: The PIN must consist of at least 14 characters (starting from RTM.8), can contain any character (not only numbers). Do not select only numbers. If your environment allows that, use emoticons or national characters.
it: Il PIN deve essere composto da almeno 14 caratteri (a partire da RTM.8), può contenere qualsiasi carattere (non solo numeri). Non selezionare solo numeri. Se il tuo ambiente lo permette, usa emoticon o caratteri nazionali.

source: The longer the PIN the better. It is possible to use 6 randomly selected words instead as well for the same or better security than random character string.
it: Più lungo è il PIN, meglio è. È possibile usare anche 6 parole scelte a caso per una sicurezza uguale o migliore di una stringa di caratteri casuali.

source: Use ‘gpg –card-edit’ -> ‘admin’ -> ‘passwd’ to achieve this (for Admin PIN case).
it: Usate 'gpg -card-edit' -> 'admin' -> 'passwd' per ottenere questo (per il caso PIN Admin).

source: Please be careful to change Admin PIN first and User PIN second! Otherwise the admin-less mode got activated, see `this instructions <https://www.fsij.org/doc-gnuk/gnuk-passphrase-setting.html#>`_ for further information.
it: Fate attenzione a cambiare prima il PIN amministratore e poi il PIN utente! Altrimenti si attiva la modalità admin-less, vedi ` queste istruzioni <https://www.fsij.org/doc-gnuk/gnuk-passphrase-setting.html#>`_ per ulteriori informazioni.

source: Optionally Reset code can be set up (`guide <http://www.fsij.org/doc-gnuk/gnuk-passphrase-setting.html>`_). The minimum length accepted is 8 characters, however it should be as long as User PIN.
it: Opzionalmente è possibile impostare il codice di reset (`guida <http://www.fsij.org/doc-gnuk/gnuk-passphrase-setting.html>`_). La lunghezza minima accettata è di 8 caratteri, tuttavia dovrebbe essere lunga quanto il PIN utente.

source: KDF-DO allows for a shorter PIN of 8 characters minimum, by executing part of the calculations on the PC.
it: KDF-DO permette un PIN più corto di 8 caratteri minimo, eseguendo parte dei calcoli sul PC.

source: **Firmware version 1.2.5 or below: In case you forget a PIN or enter it wrongly three times you need the reset code to unblock the PIN. Otherwise the device wouldn’t be usable anymore! Therefore please** `set the reset code <http://www.fsij.org/doc-gnuk/gnuk-passphrase-setting.html>`_ **as well when initialising the key!**
it: **Firmware versione 1.2.5 o inferiore: Nel caso in cui si dimentichi un PIN o lo si inserisca erroneamente per tre volte è necessario il codice di reset per sbloccare il PIN. Altrimenti il dispositivo non sarebbe più utilizzabile! Quindi per favore** ` imposta il codice di reset <http://www.fsij.org/doc-gnuk/gnuk-passphrase-setting.html>`_ **anche quando inizializzi la chiave!

source: Your Nitrokey is now ready to use. `Checkout <https://www.nitrokey.com/documentation/applications>`_ the various use cases and supported applications.
it: La vostra Nitrokey è ora pronta all'uso. ` Guarda <https://www.nitrokey.com/documentation/applications>`_ i vari casi d'uso e le applicazioni supportate.

source: Key Creation with OpenPGP or S/MIME
it: Creazione di chiavi con OpenPGP o S/MIME

source: There are two widely used standards for email encryption. While OpenPGP/GnuPG is popular among individuals, S/MIME/x.509 is mostly used by enterprises. If you are in doubt which one to choose, you should use OpenPGP.
it: Ci sono due standard ampiamente utilizzati per la crittografia delle e-mail. Mentre OpenPGP/GnuPG è popolare tra gli individui, S/MIME/x.509 è usato soprattutto dalle imprese. Se siete in dubbio su quale scegliere, dovreste usare OpenPGP.

source: `instructions <openpgp.html>`_ for using the OpenPGP standard with the Nitrokey
it: `istruzioni <openpgp.html>`_ per usare lo standard OpenPGP con la Nitrokey

source: `instructions <smime.html>`_ for using S/MIME with the Nitrokey
it: `istruzioni <smime.html>`_ per usare S/MIME con la Nitrokey

source: Please note that the Nitrokey App can not be used for this device!
it: Si prega di notare che l'App Nitrokey non può essere utilizzata per questo dispositivo!

source: Troubleshooting
it: Risoluzione dei problemi

source: On some GNU/Linux systems it is necessary to insert the UDEV rules for the Nitrokey device manually. If you followed the above instructions and get the message:
it: Su alcuni sistemi GNU/Linux è necessario inserire manualmente le regole UDEV per il dispositivo Nitrokey. Se hai seguito le istruzioni precedenti e ottieni il messaggio:

source: please install the `Nitrokey App <https://www.nitrokey.com/download>`_ or type the following commands in the terminal to download and install the UDEV rules:
it: installare l'app `Nitrokey App <https://www.nitrokey.com/download>`_ o digitare i seguenti comandi nel terminale per scaricare e installare le regole UDEV:

source: Multiple Identities
it: Identità multiple

source: The multiple identites feature allows to use 3 virtual smart cards in place of one, giving bigger flexibility in the every day use, as well as separation between user identities (business, personal etc.) or even allowing usage of it for more than one user (PINs are separate).
it: La funzione multiple identites permette di usare 3 smart card virtuali al posto di una, dando una maggiore flessibilità nell'uso quotidiano, così come la separazione tra le identità degli utenti (business, personale, ecc.) o anche permettendo l'uso per più di un utente (i PIN sono separati).

source: All of the smart cards have separate data objects, meaning they all could have different keys, certificates stored, and PINs set. Identities do not intereact between each other.
it: Tutte le smart card hanno oggetti di dati separati, il che significa che tutte potrebbero avere chiavi diverse, certificati memorizzati e PIN impostati. Le identità non interagiscono tra loro.

source: The virtual smart cards are identifyable by the first digit of the serial number, which is replaced by identity number for second (“1”) and third one (“2”). Serial number is not changed for the first identity.
it: Le smart card virtuali sono identificabili dalla prima cifra del numero di serie, che è sostituita dal numero di identità per la seconda ("1") e la terza ("2"). Il numero di serie non viene cambiato per la prima identità.

source: Usage
it: Uso

source: To change the identity it suffices to send a custom CCID command. This could be achieved with ``pynitrokey`` tool:
it: Per cambiare l'identità è sufficiente inviare un comando CCID personalizzato. Questo può essere ottenuto con lo strumento ``pynitrokey``:

source: `Install pynitrokey <https://github.com/Nitrokey/pynitrokey#installation>`_.
it: `Installa pynitrokey <https://github.com/Nitrokey/pynitrokey#installation>`_.

source: Connect your Nitrokey Start and verify that it got recognized.
it: Collega il tuo Nitrokey Start e verifica che sia stato riconosciuto.

source: Change the identity, by replacing ``<ID>`` with ``0``, ``1``, or ``2``.
it: Cambia l'identità, sostituendo ``<ID>`` con ``0``, ``1``, o ``2``.

source: Limitations
it: Limitazioni

source: As of version RTM.10 there is only one limitation - the third identity can store a certificate not longer than 1024 bytes. The other two identities have standard limit of 2048 bytes per certificate.
it: A partire dalla versione RTM.10 c'è solo una limitazione - la terza identità può memorizzare un certificato non più lungo di 1024 byte. Le altre due identità hanno un limite standard di 2048 byte per certificato.

source: OpenPGP Email Encryption
it: Crittografia e-mail OpenPGP

source: There are two widely used standards for email encryption.
it: Ci sono due standard ampiamente utilizzati per la crittografia delle e-mail.

source: OpenPGP/GnuPG is popular among individuals,
it: OpenPGP/GnuPG è popolare tra gli individui,

source: S/MIME/X.509 is mostly used by enterprises.
it: S/MIME/X.509 è usato soprattutto dalle imprese.

source: If you are in doubt which one to choose, you should use OpenPGP. While this page describes the usage of OpenPGP, S/MIME is described `here <smime.html>`_.
it: Se siete in dubbio su quale scegliere, dovreste usare OpenPGP. Mentre questa pagina descrive l'uso di OpenPGP, S/MIME è descritto `qui <smime.html>`_.

source: Please familiarize yourself with the general concept behind the OpenPGP standard first, for example by reading `this info graphic <https://emailselfdefense.fsf.org/en/infographic.html>`_ of the Free Software Foundation.
it: Si prega di familiarizzare prima con il concetto generale dietro lo standard OpenPGP, per esempio leggendo ` questo grafico informativo <https://emailselfdefense.fsf.org/en/infographic.html>`_ della Free Software Foundation.

source: Key Generation
it: Generazione di chiavi

source: If you do not have OpenPGP keys yet, you need to generate them first.
it: Se non avete ancora le chiavi OpenPGP, dovete prima generarle.
