Repository: DamienCassou/nitrokey-documentation
Catalog: locales/*/LC_MESSAGES/syntax.po
Languages: it

source: Nitrokey Documentation - Syntax
it: Documentazione su Nitrokey - Sintassi

source: (Nitrokey Product - Platform)
it: (Prodotto Nitrokey - Piattaforma)

source: H2 Heading
it: Intestazione H2

source: Some text with ``inline.code();``
it: Qualche testo con ``inline.code();``

source: This is a bulleted list.
it: Questo è un elenco puntato.

source: It has two items, the second item uses two lines.
it: Ha due voci, la seconda voce usa due linee.

source: This is a numbered list.
it: Questo è un elenco numerato.

source: It has two items too.
it: Ha anche due oggetti.

source: Normal text again.
it: Ancora testo normale.

source: this is
it: questo è

source: a list
it: un elenco

source: with a nested list
it: con un elenco annidato

source: and some subitems
it: e alcune sotto-voci

source: and here the parent list continues
it: e qui la lista dei genitori continua

source: These lines are
it: Queste linee sono

source: broken exactly like in
it: rotto esattamente come in

source: the source file.
it: il file sorgente.

source: H3 Heading
it: Intestazione H3

source: Only the following message boxes should be used:
it: Si dovrebbero usare solo le seguenti caselle di messaggio:

source: Warning text.
it: Testo di avvertimento.

source: Note text.
it: Nota testo.

source: Important text.
it: Testo importante.

source: Tip text.
it: Testo del consiglio.

source: Grid Table
it: Tabella della griglia

source: Header 1
it: Intestazione 1

source: Header 2
it: Intestazione 2

source: Header 3
it: Intestazione 3

source: body row 1
it: corpo fila 1

source: column 2
it: colonna 2

source: column 3
it: colonna 3

source: body row 2
it: corpo fila 2

source: Cells may span columns.
it: Le celle possono estendersi su più colonne.

source: body row 3
it: corpo fila 3

source: Cells may span rows.
it: Le celle possono estendersi su più righe.

source: Cells
it: Cellule

source: contain
it: contengono

source: blocks.
it: blocchi.

source: body row 4
it: corpo fila 4

source: Simple Table
it: Tavolo semplice

source: Inputs
it: Ingressi

source: Output
it: Uscita

source: A or B
it: A o B

source: False
it: Falso

source: True
it: Vero

source: This is a text that needs to be translated automatically. This is another Line to be translated.
it: Questo è un testo che deve essere tradotto automaticamente. Questa è un'altra linea da tradurre.

source: This line is one of the tests for the automated translation workflow with weblate.
it: Questa linea è uno dei test per il flusso di lavoro di traduzione automatica con weblate.

source: Adding this text should trigger the conmplete workflow of translation.
it: L'aggiunta di questo testo dovrebbe innescare il flusso di lavoro completo della traduzione.

source: This is `a Link <https://f-droid.org/F-Droid.apk>`_ with the definition of the url inline.
it: Questo è `un link <https://f-droid.org/F-Droid.apk>`_ con la definizione dell'url in linea.

source: This is another thest for `a URL <https://f-droid.org/F-Droid.apk>`_ to test translation.
it: Questo è un altro thest per `un URL <https://f-droid.org/F-Droid.apk>`_ per testare la traduzione.

source: This is a plain link https://foobar.bas/slug1/slug2
it: Questo è un semplice link https://foobar.bas/slug1/slug2

source: This line contains the product name Nitrokey Start an should not be altered by the translation.
it: Questa linea contiene il nome del prodotto Nitrokey Start e non deve essere alterata dalla traduzione.
